["This place is definitely not worth your money. The hookah is $18 and if someone in your group doesn't get a hookah there is a cover fee of $14.95. The...","This is good for Staten Island. Sorry guys but I've been to Hookah spots in both Morocco and Turkey and Egypt, its just not the same. \nI came here late late...","Blown away by the excellent service. Will definitely be back! Food was great - even at 3 in the morning. The staff is very helpful and make you feel...","Great neighborhood Chinese. \nFood is delicious. \nDecor on the dine in side is very nice. \nTake out is quick. \n\nStaff is nice and friendly.\n\nThis place is a...","It's kind of the situation and it's like you can be your own worst enemy this place could be great to be five stars but the people in the kitchen cut...","Wow! Super blown away by the quality of the food, cleanliness of the business, and most importantly, the amazing customer service. We came right when they...","Fast, friendly service! Good drinks at decent prices. I ordered KF milk tea with milk cap. The milk tea was sweet and the milk cap was salty. Loved the...","Love KFT!  Really excited and happy to see a KFT here in SI and in SI Mall of all places.  Woohoo!  Granted, they got my order wrong and I didn't realize...","BOGO free grand opening promotion ends today, 1/20!\n\nCashier was friendly and super quick with me and my friends' orders as there was a line behind us;...","I did not have high expectations when I tried Banhmigos. I mean let's face it, Staten Island isn't exactly known for our eclectic cuisine. But Banhmigos far...","There isn't really much Vietnamese food on Staten Island, so the new Banhmigos is a welcome addition. We dropped by recently to pick up some sandwiches, and...","Deilicious bubble tea & Vietnamese food in Staten Island. I haven't tried the Pho there yet, but so far with what I ate there, it has been delicious and I...","Right in the middle of the Staten Island mall food court, it can be a little easy to miss the poke bowl stand because of the fact that it's a bit separated...","The women that work here have no hospitality bone and were not trained on customer service whatsoever. I ordered and 20 minutes later I still don't have my...","I'm a sucker for Pork buns, so when I saw the sign \"signature island baos\" I jumped at the chance to get one.\n\nOrdered--\n\nRoast Pork Bao - I have to say I...","One of the best on the Island! \n\nIngredients are always fresh, and there are a variety of toppings. I love that you can customize your own bowl, and there's...","Stopped in for a quick lunch in the area. The restaurant is clean with prices that range from $9.25 to $11.25 for a poke bowl. They gave me a loyalty punch...","I can be a little picky when it comes to this type of food, so the \"Build Your Own Bowl,\" option is perfect for people like me. I get to choose exactly what...","Amazing \n\nThe food is always good and they serve large portions for reasonable prices. Staff is very polite as well. Parking can be a challenge but the food...","Pho Mac has Amazing Food \nAwesome Service and Great Prices \nMy personal favorite is the Curry Chicken it's considered a appetizer but I eat it as a meal...","Food: Beef stew is so good but only good if it's super fresh and hot. I microwaved it and it was a different taste the baguette it comes with is Soo soft...","Really nice owners and really good service!  \n\nWish they have green milk tea on the menu!!!!!","This place is amazing. I ordered the jumbo fruit tea with the mango bubbles. When I say perfection, it was really really good. You can taste the natural...","Finally there is a bubble tea place that is closer to my house and it taste amazing! I always get the fruit teas in bubble tea places so I tried lychee...","I ordered takeout here with my boyfriend the other day and gotta tell ya, it was awesome! \n\nWe were greeted by a smiling server who was patient with our...","Ordered take-out from this spot for the first time. Food was great and delivery didn't take long to arrive. I ordered the chicken teriyaki (extra chicken)...","Place is awesome, prices are so good. I wish there was more then one location on the island. There is no where to get bubble tea on the south shore of state...","Very friendly service with good recommendations. Food was great.\n\nThe Scallop with X.O. Sauce and red snapper dishes were amazing additions to eat with rice.","Subpar.... to say the least.... the waitress was more worried about the infant baby (maybe grand child or whatever) then caring to our table.. it was so...","Don't get the high reviews at all. I ordered delivery through yelp on a Thursday evening. I ordered a chicken teriyaki bento and a dragon roll. The chicken...","I really think this is a hidden gem in Staten Island. I went here with my family in the afternoon and my first impression was that it was beautiful. The...","Highlights: cute decor (Sakura trees), friendly waitress, big portions \n\nI only gave this place 3 stars because I found my entree to be mediocre and the...","Very nice staff and owner ! \n\nStarted off with a shrimp appetizer that was so crispy and flavorful! The amount of shrimp given was so worth it! Then, had...","Nice quiet cafe to hang out on a Saturday afternoon in New Dorp. Clean environment. Comfortable sitting. And most importantly FREE WIFI !!!\n\nMy 2 toddlers...","I really love the fruit teas here! The milk boba tea, chicken poppers, and gyoza are also note worthy. The location is always clean and staff is friendly....","Walking around New Dorp and this was a sight for sore eyes in the middle of rows of shut down stores. Now there are two types of people who would be reading...","Lives up to the name...ice cream, macaroons, frosty beverages, cakes, smoothies, and milk teas. If you're looking for a sugar high this is the spot!\n\nPrices...","Decent local ice cream spot!\n\nVery friendly place with comfortable seating and cute decor. They have many ice cream flavors and toppings to choose from!...","I really liked the Decour in place. They had a nice wall of pictures. They also have a wall with Polaroid pictures of customers. They had a lot of options...","I love the PokéBowl, always order this with eel and roasted duck, very tasty. Delivery is fast, and customer services is wonderful!","Honestly, I prefer to have their sushi roll more than anything else on the menu. My friend recommended me to try the sushi burrito, but TBH it wasn't that...","Very delicious Asia food ! Came here to try the famous sushi burrito as it has great reviews and it did not disappoint. Also tried the sesame seed chicken,...","Had the chai latte. Was very delicious and full of flavor. \n\nAmbience was cute and clean. Very hipster place.","I called on Thursday about a gender reveal. I was given pricing information, but had a hard time understanding the name of who I spoke to. It sounded like...","We arrived for a birthday breakfast for my nephew at 8:10am, the ONLY party in the place. We sat for 45 minutes and finally asked our server when the food...","I'm only giving this place four stars because I'm staying loyal to my other Vietnamese restaurant Pho Mac. Whenever I get a craving for Vietnamese soup or...","Pho rainbow has been around for a bit now however the ownership has changed. The new expanded menu and cleaner menu seems to have brought some new life to...","Yummy simple Vietnamese. I came here on a chilly winter night with my boyfriend and we had fresh brewed tea within a minute of sitting down. So good and...","Staten Island really needs to up their food scene and I'm glad found this new bubble tea shop. Every time I have a bubble tea craving, I wouldn't need to go...","Awesome spot! Been going here since day 1! Every drink that I've had was perfect! The snacks go perfectly with all drinks and the atmosphere is amazing!...","First time coming here and wanted to check it out. Since it was grand opening, drinks was buy one get one free. I went with my friend and I got lychee fruit...","Delicious bubble teas, and friendly staff. We love it, especially the milk tea, thai iced tea and taro bubble teas.","Super duper excited for a bubble tea on the island !!! Running around on the island and spending at least 40 hours a week has made me suffer from...","What a really really cute place (and it's on Staten Island!). My friend kept talking about a boba tea place, and I couldn't believe there was one here!...","W  W          \nI decided to have a milkshake for lunch, ending the school year with some sweetness. \nCookie jar is affiliated with the very popular Cake...","I am very surprised by all the good reviews because not only were the cookies stale but they all tasted alike. What I mean is that they were tasteless, that...","OMG this is the best bakery we've EVER been to! Where do I begin? The flavors were unique. Definitely can't find raspberry brownies, guava jelly cookies,...","I came in here today for lunch, my husband and I were seated, given menus, standard restaurant practices. I ordered the Green Curry lunch, my husband...","Food is great, management is clueless and website downright SUCKS! They want you to order online so they give you a 5% discount which is the discount code...","My favorite sushi ever ! Love their lunch special, sushi is always fresh, and during lunch time they are so quick with delivery.","It just keeps getting better. Went back a few nights ago. Service was excellent, the food was super fresh, and the place was very clean. Definitely going back.","Disgusting \nThe lo meing was basically dry old spaghettis and the fried chicken was still frozen inside","The food is terrible and they watch you through cameras !  If you order the sushi buffet and don't finish all your food they try to charge you extra money....","Cute Place\n\nThis place is really good for small outings with good friends. It's a very instagrammable spot with a cute atmosphere and really good waffles!","The food was average and the space is very limited.  My waffles were dry and I love waffles :(  I came here because I heard a lot of rave about this place...","So many options, hard to choose, especially if you love waffles. We had the red velvet waffle, apple pie waffle and the strawberry cream cheese stuffed...","Decent Chinese food and sushi. Sushi options seem to be drenched in sauce. Good option for casual takeout.","So because my friend loves the beef and broccoli from this restaurant I decided to come with her. I ordered the lunch special chicken and broccoli with pork...","So rare so good and pretty busy for a small corner restaurant on a weekday. In 2015 they won a best restaurant award. They have sushi as well. We shared a...","We'll start with a rap...\n\nIt's been 10 minutes, and I'm DUE\nFor another drink from Kung FU\nSo now I'm going to rap for YOU\nAnd if it really sucks, just...","Friendly shop, friendly service... we were the only ones there.. so this branch may need some boost! \n\nCozy space with enough room for bar stool seatings....","Come here at least once a week!\nNever had any problems or complains!\n\nEven if I come and there is a lot if people in front of me4-5), I never had to wait...","This is a really cute spot. The store is clean and cool: a nice break from the hot summer day. We've only tried their froyo. There aren't many options but...","A favorite of my ten year old daughter because of the topping bar, which offers a wide selection of goodies including fresh fruit, m&ms, chocolate covered...","The frozen yogurt is great. My family and I go there often for some smoothies and frozen yogurt I highly recommend it","Delicious rolls, great service. Love the lychee martini and dragon rolls. Ice cream tempura was a big hit too","We came in here to celebrate our wonderful sister's birthday on a quiet Sunday evening.  If you are familiar with the area, parking can be easy or painful...","Average piece of sashimi was approximately two quarters wide and half a centimeter thick. Not worth the time and the fish is AYCE grade. Actually, this...","It was my first expirience here but guess not last. I enjoyed special rolls and salads that were great. Hot sake added tasty notes. Green tea was...","This place was alright.... \nCame in on a Monday afternoon. \nA little expensive but alright...\n(due to the tuna being $2.50 per each piece) \nWe came for...","We ordered delivery last night after clarifying which chefs special sauces have gluten (soy or eel sauce) and requesting those and the crunch (I still am...","Honestly the best sushi I've had so far! I mean of course you eat good sushi here and there as you travel or even going out with your friends, but if you...","This spot is in the heart of Bay Ridge. It's a decent size restaurant and wasn't busy at the time I went (around 6pm on a weekday). Upon sitting down and...","Pretty solid spot to get a quick sushi fix. The lunch specials here are definitely worth it for the price and what you get. Ten bucks for 3 rolls and it...","I know a Boba place that will drive you LOCO\nAlthough it may give you more gas than SUNOCO\nAnd if you buy too many drinks, it may make you a BROKE HO\nBut...","I'll admit it. I have a bit of an addiction. Not even to bubble tea, but milk tea (of any flavor really) with grass jelly from this place. With fast...","The first time I came here, I thought it was great! When I asked for 30% sugar for pudding milk tea, I actually got a milk tea that wasn't too sweet. I came...","So this place shares the same location with another store, so don't be surprised when you walk in! \n\nI got 2 of their watermelon slushes with herbal jelly....","So go write this down on your CV\nThat you love the Boba at Vivi\nAnd although it tastes fake\nYou love it more than Drake\nIs loved by some rando named...","Lovely bubble tea spot :) I can't say I was disappointed at all, it's a phone accessory store and bubble tea store all in one which is interesting. When I...","Came here during the opening week. This is a great concept. You get to hang out with your friends playing board games and drinking bubble tea! I think this...","Highlights: cute decor, clean, large variety of games\n\nThis place is located conveniently by the train and surrounded by local restraurants and shops....","Even you don't play board game like me, just go in for food!!!! You will thank me!! Best Japanese fried chicken!","We love the idea of small cheesecakes so you can try different flavors. We usually make our own cheesecakes but we cannot finish one cake so this is the...","I am giving this place 4 stars, rounding up because the guy helping me was sweet and I'd love for this place to last.  We need cute places like this in the...","Get the creme brûlée cheesecake, it's soft and creamy with a hard top. There's a variety of flavors like passion fruit and matcha for about $5 for each....","the store is new and the people are really friendly/nice. cash and credit is accepted for orders greater than $10 and the food is authentic chinese bakery...","With a few improvements I would give them 4 stars. This is a good addition to the neighborhood as there is a need for more small cafe/ bakeries in the...","I had my eye on Gigi's Bakery since it appeared on Yelp and finally took a trek out.  It's sort of out of the way for me in that I don't anywhere that would...","The best handmade dumplings, bubble tea and much more! Thank you for excellent service and food.","I was coming home from the city and like any normal human being, I was really craving dumplings. This was on a Sunday in the early evening. Fortunately,...","Not sure what to say about this place. Stopped in recently and was really put off by how dirty everything felt. The interior of this was grimy and...","Outrageously good egg tarts ($1.25).  These might be the best in NYC.  So good, that its best to call them up and pre-order, otherwise they may have already...","Horrible costumer service. I called to ask if they make fruit cakes. They said yes. It was super hot that day I went all the way there with a little kid -...","This review is for the Mah lai Goh or the Malaysian Steamed Cake. If you take a look at the photos I've posted, they sell a big chunk of Mah lai goh for $4...","I've been coming here for breakfast pretty often over the last two years.\n\nI'd still continue! It's hard to find food as cheap as this around here now and...","Awesome place to grab a stemmed pork bun. The service is always excellent. Only downside is that they close kind of early for me (7pm) so sometimes I have...","Owners changed, place remodeled. Now it sells expensive subpar bakery. Their tea milk is made with POWDER, tastes like trash. And they got a C sanitary...","This place appears to have just opened in Bay Ridge, which is really convenient for when I have to visit my friends in the area. They have a pretty standard...","Dude... forreal?\n\nMy friend took one sip and the first word that came out of his mouth was Turpentine.\n\nIt was pretty obvious whoever made the drinks didn't...","We just moved to the neighborhood and we've already been to Yosweets twice. I love that you can get a variety of toppings here and that it's a kid friendly...","I came in with a friend after we grabbed brunch elsewhere. There's plenty of seating, but the place itself is pretty basic. There are tons of frozen yogurt...","Not bad. Lots of variety choice of frozen yogurts . Put some music on show be nice. Near shopping area.","Pros: 1) yummy grilled chicken Banhmi (Vietnamese Sandwich); 2) crispy and fresh sandwich bread; 3) helpful and friendly cashier; 4) big choice of food; 5)...","I stumbled upon this place today whilst I was actually on my way elsewhere for bubble tea. I had just done a quick yelp search for bubble tea in the area,...","Ordered for delivery. Very nice lady on the phone taking my order. I called maybe less than 30 mins before closing. Ordered just less than $30 worth of food...","The customer service has been really great both times I've ordered at Cream. I don't typically write Yelp reviews, but their amazing service has compelled...","I just moved in to the this hood and with DD and Strbks among other coffee spots in the area I decided to checkout Cream. This establishment is very tiny...","Very small place with only a few chairs but boy does it pack a punch. The pecan donut is ridiculous... cant go wrong with the donuts here. They should have...","Service-wise is very good, I normally I either call or order online. However, I never had any issues with ordering. They are friendly staff. Even when I...","Amazing food, but even better service. We came on 9/24/19 at around 9 pm. Our server was a wonderful, pleasant young woman who was so attentive! \n\nWe felt...","I love this place. Sushi is very fancy compared to other places.\nOne of my go-tos.\nSushi plates are beautiful and delicious.","There Sesame Chicken is beyond delicious I love the crispy thin Chicken pieces and there Beef Lomein is also delicious and not leaving out there over loaded...","Ever since eating here a month ago, this has become my go-to spot for Chinese food. I came in a on a Thursday afternoon to have lunch with a friend and...","Greasy, over-fried, overpriced, overrated. Got the shrimp and broccoli and instead of a soy based sauce it was white with so much oil on the bottom... wtf?...","I've been really happy with their prices and the freshness of their food. So affordable and really good quality every time, and the guy who usually runs the...","I've been going to this place like for 3 years. Today I came and place my order to go, and parampam --- in like 2 minutes everything was ready! Wow! Great...","Highlight: buy 1 get 1 house special rolls and big pieces of sushi\n\nMy go to spot for sushi in Brooklyn. I love the buy 1 get 1 deal they always have for...","I have been coming here for year and have never been disappointed in the food. Also got what I asked for. My brother always gets the beef cube with fried...","Review for their Take-Out-Delivery only. \n\nI've actually eaten here before looooong time ago, while shopping at Century 21.  But can't remember much, so to...","The food is good and that's why I'm giving it 3.5-4 stars but this would be a no no next time I'm craving my porkchops over rice. Ordered it today plus a...","Best place to have some curry fishballs and sugar free drink! \nEasy parking and nice services and not expensive. \nRecommended!","Gotcha Cafe is a new bubble tea and snack shop that's seems to still be getting on its feet. The owners generously gave my two friends and I samples of...","Attracted by the high ratings, and on a boba kick trying new boba shops feels like the right thing to do.  Unfortunately sometimes my instincts are very...","I order from here for lunch sometimes as it's local to my job. \n\nI first started ordering from here about a year ago and was instantly captivated by the...","Love the poke bowl serving size and the overall quality of the ingredients are pretty good.\n\nWith the recent invasion of poke restaurants everywhere, it's...","Saw a large fly landed on the Salmon cubes.\n\nThat's really bad! \n\nWas going to order Salmon bowl to go but I changed my mind. Ordered something else. It...","Came here after work on a Friday around 8. I ordered 5 rice balls and a chicken soba. 3 Japanese and 2 yaya chicken. \nThe cashier was very nice and quick...","I've only been to this location of Yaya and it's great! It's a nice place to get a quick drink and snack. I've only tried the teas and onigiri. I really...","A favorite for quick snacks and bubble tea, as well as for chilling and catching up with friends. Their service is fast for a quick grab and go, and they...","This is a wonderful place to get a quick bite and is very busy time to time, good to go with friends to hang out and although they do have a small place it...","I like Vivi's, but not this location.  I first tried Vivi's in Manhattan and I had a positive experience.  However, here the service is some of the worst...","Honestly not the best service nor the cleanest  Vivis location I've been to but it satisfies any popcorn chicken cravings I get when I'm in Bensonhurst....","Me-Do Desserts is a cute little dessert place off 86th street. It's really small inside, but it's definitely worth a visit. You can fit up to 15 people...","CATFISH LEVEL: 4/5: Looks good, tastes okay, finished but wouldn't get again\n\nCame here to try a new tong sui place, especially since they are pretty scarce...","The bubble tea wasn't good at all it was very sweet and didn't have a good taste to it. I was really disappointed with that part. However, they have small...","Love their egg waffles!! So good. The best egg waffles!\n\nDrinks are just alright, milk tea is lacked of tea flavor, too much milk and over priced!","I really wanted to try their shaved ice after seeing it the last time I was here, so got the legendary grey. The earl grey shaved ice is really good, super...","Did I really just pay for 2% milk with bubbles? It tasted like plain milk and wasn't sweet at all. I'd come here for poke but not the milk tea. The bubbles...","My favorite to go place! I usually get the sago with coconut juice and grassjelly! It's so refreshing and the coconut juice is amazing! I always buy 2 and...","First they didnt have any mango juice to go with any dessert items.\n\nSo i ordered black glutinous rice $4.00, before tax,  with warm coconut milk. The rice...","I haven't ordered anything besides the mango pomelo sago with grass jelly. The mango was sweet and ripe compared to the previous times I've been to mango...","Saturday afternoon and they did not have any bubbles/boba... how does this happen during peak hours!? I was watching customers getting disappointed every...","One of my go to bubble tea spots in the neighborhood! About a 10min walk from home and right by the Bay Parkway D train... \n\nWhenever I crave some kung fu...","Don't know what kind of services people were looking for from reading the reviews, but I never had a bad experience with this place. One of the worker did...","Love the drinks here. The service was good, quick, and efficient. It's a grab-and-go type of place (only has 2 tables). They make fresh drinks,  juices, and...","My least favorite boba chain. The bubbles range in quality each time I go with being too soft, or with a center that's too hard and not fully done yet. I...","Unacceptable/ Despicable- Customer service at its worst!\n\nThe attitude and condescending tone from this particular worker who took my order was just...","When I found out that there was a Prince Tea House in Bensonhurst, I was so happy because then I don't need to trek to Sunset Park. I absolutely adore and...","I come here way too often. This place is great, just like all their other locations that I too, habitually frequent. Parking is hard around this...","This cafe is very cute and it definitely appeals to my aesthetics. I sat indoors and in the garden area and I think the garden area is definitely the place...","I'm lucky to be working in such culinary diverse neighborhood. Breakfast is the most important meal of the day. This Chinese bakery will satisfy your most...","Bought some dim sum a few days ago... not that fresh and delicious...fried dumplings all filled with veggie with very little meat.... spring rolls were ok.","Probably one of my favorite Chinese bakery around this area! Seriously best dollar(s) worth of food!  All the baos are pretty decent, and while it's not...","One of the best places for Portuguese egg tarts. It's almost like a self fulfilling prophecy. Since there is always a demand for them, they are always...","I bought a heart shaped cake for my mom's birthday.  It was frozen when we tried to cut it.  We ended up eating it for breakfast the next morning. It tasted...","Never buy  crepe cake here !!!! It's  terribly not tasty. My children just spilled it right away  don't waste your money !","If you're looking for a modern yet traditional Chinese Birthday Cake in the neighborhood, this is THE place to go! \n\nI was pretty desperate to find a cake...","After dinner, my husband hyped me up for something sweet, so we stopped into King's Bakery for the first time on 86th Street.  The overall decor and...","My friend really likes the cheese tarts here and always buys a box to bring home. Their milk tea is great! It's a good Ceylon tea flavor and really his the...","This sushi place is really awesome!\n\nFish were fresh, soup were great, and their tempura rolls were cooked well!\n\nThey are nice and professional to the...","Went today for lunch, and both my boyfriend and I WERE NOT disappointed. He ordered 1 Philadelphia roll, 1 chicken teriyaki roll (AMAZING) and one crunchy...","We order from here when we get really busy and they deliver quickly, but lately they have been a little inconsistent, flavor wise. They are still good.","Delivery review: \nYelp says its Permanently Closed but its actually open! I found it on delivery.com. the delivery came on time.\nI ordered pork katsu with...","I wish I can give a negative rating, this restaurant is listed on seamless and is now a delivery only restaurant. Upon arrival, the delivery man who barely...","I ordered twice before reviewing to make sure of consistency. Both orders combined I've ordered; salmon sushi and sashimi, white tuna sashimi, alaskan roll,...","This is the perfect definition of greasy, deep fried goodness. This place doesn't advertise how healthy they are and they aren't ! \n\nWhen I am craving for...","Update: came here last night to order food for myself and 2 other people. All 3 of us were up all night with a horrible stomach ache. Can't speak for them,...","The moment I walked into this place, I almost slipped on the huge puddle of water. Unsure why haven't they cleaned it up, it's a huge hazard for customers....","Although I've been multiple times before, I felt like it wouldn't be right if I didn't write a review this time around. The food was much better than I...","This restaurant/cafe has been a staple of HK cuisine in Bensonhurst for years. The prices here are cheap and I always finish my meal, satisfied and happy....","This is a nice, cozy place to go to for Cantonese food.  It's right off the 20th Avenue train station.\n\nYou can request tea or water which is constantly...","My go to spot any day . There food is amazing the taste really reminds you of Chinese home cooked food. It's usually nice and quiet between 12-4 . Their...","MSG overload! Quite disappointed for their quality of food for a home cuisine.\n\nOrdered mini French toast, yellow eel clay pot rice, hot and sour potato...","Each time returning to Samui, we return to Food on Samui.\nWe use the delivery service, and catering, and of course we arrive at the cafe itself. Always at...","Ting fai is fortunate reminder of a time when things are still affordable. If you come here, youre bound to get some decent hk food in large portions at a...","2day we ordered 3 foods for pick up??\nShe only gave us 1 plastic bag?\nShould give 2 bags?\n1 bag can't hold 3 items of foods?\nPlus soup & all..\n2 bags is...","Ordered for delivery, food is good and cheap but service is BAD !!! the guy over the telephone was rude, he had no patience at all, seems like he can't wait...","Service was good! But the quality of food has really declined over the years :( there are a few good items. My faves are the cheese baked clams , hot and...","Do not waste your money. I've been to my fair share of buffets before and this is not worth your time nor your money, trust me. I never write reviews but I...","A lot of options for food and very friendly staff! Food is delicious, for two persons me and my friend paid just around 50$, but we ate a lot and that was...","When she whines at you just ignore her\nIf she's boring, maybe you bore her\nBut if she's exciting\nThen consider delighting\nHer by bringing her to...","3.5/5\n\nLocated right across the famous Leif Ericson Park lies Teadora!!!\n\nEver since the spot opened I've always wanted to give it a try for the gaming...","After going yum cha I was very thirsty and just so happened to walk by this bubble tea shop. I was captured by the beautiful flower wall when I looked in so...","Super flavorful Rose Milk Tea and only place to get HK egg waffles in the area. The matcha flavor waffle might be a bit overpowering for some but the sesame...","Having only recently found out that this place exists (for about a month now), I went in here about ten minutes to closing. They were already cleaning up...","We finally got to try this place out! Me and the hubby were having a sweet tooth and decided to pass by this place since it's right around the corner from...","Excited for this place to open. I was hoping it be a much closer option similar to Audrey's. But my first visit has shown that it definitely has a lot more...","Definitely coming again!! I ordered this cake for my mom's birthday and it was sooo good. I worked so hard to find a place that made durian cakes and was...","Their service is always the best if you want boba in this neighborhood. I live for their sakura milk tea! Their snack corner is so cute and diverse. Their...","Thanks to Desserts18 for my dad's beautiful birthday cake. Not only did it look beautiful, it tasted amazing. We ordered a two tier fresh fruit cream cake...","Ordered mango mousse cake for my daughter's birthday since she is a pretty picky eater and she enjoyed it  \nWas pleasantly surprised at how cute the cake...","Nice and clean place. The guy working there was very nice and also very cute ngl. Would recommend going to this place :) they also have nice computers and...","I really like this gaming cafe. I came here with my friends because it was close to me and seemed like a fun place to try for the first time. Getting down...","Me and my girlfriend came here and we were amazed of how much fun we had. ARENA OF VALOR AND FORNITE IS OUR GAME. Had a blast with the staff and the service...","I love this combo menu! Worth coming back!\nThat pineapple chicken fillet was bomb! \nThe fruit salad, refreshing! \nNice quite place to study too! \n\n\nTip:...","Visiting a new dessert spot in Brooklyn always feels like a risky adventure, given the mediocre ratings. \n\nI had my doubts on this store, but I let my...","This is worth an update! I would totally return just for this gem... savory, sweet and crunch - perfect balance! \n\nPineapple Bun with Chicken Filet, omg......","I usually go to the Canal St Chinatown branch but ever since this place opened up I've been eyeing at this Vivi location for a while. I kept on avoiding...","I really loved their signature drink. The Vivi signature fruit tea! They actually put in real fresh fruits and jello. I never had this back at home so I'll...","Have had Vivi's a few other times in other locations, first time at this location.  I went with the Yakult green tea, half-sweet, with boba.\n\nThe drink...","Walked by this corner noodle shop and noticed a picnic table on the side of the restaurant.\nInside the restaurant there were large china picture.\nI ordered...","I came here on a quiet Saturday afternoon and I must say the ambience of the restaurant is very homey. My group decided to try the chefs special spicy pot...","Flaming Pepper Kitchen is new a restaurant to the neighborhood and I'm glad they opened their doors. The place has a simple design, clean and nothing overly...","This is an decent bubble tea joint. Located outside of Fei Long super market. Each time I've ordered here the lines are usually long but it goes...","This boba place is just a grab and go with no place to sit down. Ordered a \"boba milk tea\" and it was alright~not super creamy which i liked but came with a...","Every time I go to Fei Long Supermarket to buy groceries, I've come here for bubble tea.  It's convenient since it's right outside the supermarket and their...","The Tbaar here looks so sketchy; all the lights are dimmed out, no music, slightly broken door, dirty interior, etc. I usually love the Thai tea w/ whipped...","This is a nice place to get some refreshing black bubble tea. A small one goes for $3.75. I also recommend the frozen lemon drink made with real lemons and...","Was looking for a bubble tea spot in the area at 10 pm, and TBaar was open so i came in. Definitely regret the decision.\n\nThe place was dirty, not sure if...","So glad that they opened a location close by home! I like how their line system is well-managed & kept under control. I cannot imagine standing in line for...","Unfortunately, I was one of those customers and I went into the store 10 minutes before closing because I wanted to let my friend try Tiger Sugar just for...","Line has died down since when it first opened. Go around late afternoon (5-6pm) and there's usually no line. However, there is still wait time for your...","If you want good quality tea and milk tea this is the place to grab and go! I'm so happy that they finally opened up on the east coast! They are my favorite...","This was truly a meh experience for me. I will say that staff are very nice and helpful and that's why they get any stars. \n\nI came in with 2 coupons for a...","Drink was ok\nThey got lots of different flavor of puff foam.\nI got matcha with tiramisu puff form.\nCouldn't really taste matcha flavor, and it's bit too...","The stuff was super nice.\nShe was very patient to answer my question. And give really good suggestion.\nThe brown sugar boba milk is really good. The boba is...","Review is for the food only, I didn't get a chance to try their drinks. I would recommend getting their noodle but they definitely need training in customer...","I got my most expensive bubble tea ever from here.  It was $8 for their signature Roasted Macchiato Brown Sugar Bubble Tea with egg yolk cheese macchiato....","We always get the red dragonfruit drink, this drink itself deserves a five star. They have the best dragonfruit drink out of all the bubble tea places we've...","Came here with a friend to have drinks after our spicy noodle dinner. I got the special fruit green tea and my friend got the cheese foam rose oolong,...","I'm disappointed. Looks pretty but so tasteless. I ordered the purple Yam dirty milk tea with bubbles. Bubbles taste like absolutely nothing, yam is...","At crap bars they make Coors and Bud flow\nAnd crap boba shops are just Duds tho\nBut this one is yummy\nAnd will expand your tummy\nSo get Brown Sugar Milk Tea...","I came to this place for the brown sugar milk tea \n\n+ the positives + \n* cute interior \n* authentic tasting milk tea\n* boba is nice and chewy \n* friendly...","Tried the strawberry milk from the poster outside, and the Hokkaido milk tea with herbal jelly (don't judge me plz). \n\nThe strawberry milk tasted really...","This review is solely based on the interior of this place.  \n\nCAN I JUST SAY HOW DAMN PRETTY IT IS!?? I felt like my emotions can only be conveyed through...","Staff is not helpful. I just want normal bubble milk tea but they give me something look strange. \n- Cold drink in paper cup which big straw hardly fit in...","Came here twice and not sure if I would return for a third time. \n\nFirst time I came here, they didn't have any Peach Oolong tea, so I had to opt for...","I love this place. Even with the new place that just opened that gets all the hype (ahem tiger sugar) i still think i would come back to this place more....","I ordered two tea (one milk and one fruit) to go. We were surprised to see starfruit in the menu and decided to try, but it turned out to be like salty...","Will definitely come back and try their famous brown sugar bubble tea, but for now I wanted something light so I stuck with fruit drinks. When ordering you...","This place is surprisingly really spacious! I especially loved the bright white interior and lighting! This is perfect for those aesthetic photos.\n\nHowever,...","Scammers. They will purposely forget your drink when you order takeout or delivery. Ordered a boneless chicken combo meal and the soda was missing. When...","This is a good place to hang out with friends! The store is spacious with many tables, seats, and delicious drinks.\n\nI ordered the Iced Kiwi Green Tea and...","This is one of the few bubble tea shops I always come to in 8Ave. It's cheap and relatively tasty. Most of their drinks are under 5 dollars and taste great....","I am such a fan of their $1 bubble tea specials. Really though, where else do you find such a deal? You have the option of choosing between regular or green...","They offer a 12 oz bubble tea for $1.  Awesome! There are 2 flavors that switch each week. \n\nThe lines can get long and a bit disorganized.\n\nStop by if you...","I got the oolong milk tea and basil popcorn chicken. The popcorn chicken is *amazing* - soft on the inside and a crunchy exterior/coating. Although, it is...","Waited forever for a taro milk tea with boba. Seriously? And the employees there are all squished and gossiping and laughing. Horrible service. And then...","I got the honey dew bubble tea. The bubbles and tea was really good :) very refreshing","Very nice drinks!!!! Especially the milk shakes  highly recommended love them ! Must try","This relatively small bubble tea and dessert place that opened up not too long ago had thin brown wooden-edged chairs along with white rectangle-shaped...","I finally walked in after being intrigued by this new place. Walking in I was stuck by the decor, light, and coziness of the place. Asian-run but a lot of...","Great ambiance and friendly service. Tried the brown sugar bubble tea and loved it. Interestingly their sugar levels seem to only be 100%, 50%, 30%, and 0...","I come here all the time. Their bubble teas are amazing and their shaved ice is great too. You can pick a ton of different toppings and they also let you...","This is a small and family owned shop.  I usually get the bubble taro milk tea or the passion fruit green tea with lychee jelly.   It taste pretty good, not...","Good tasting bubble tea for a reasonable price. Long list of drinks to choose from. Anytime I'm in the area, I come get a drink. Employees are also nice....","This is the epitome of a cute kind of Japanese style place. It reminds me 100% of something that would work with a dollhouse-esque place.\n\nI came in with my...","cute space, like Instagram threw up everywhere. tea drinks are ok, it's a little disorganised, but the food was ok! \n\nthere are better places but the cream...","Sweetie House's gorgeous space with good lighting, custom-made crystal beaded curtain with its cafe name, light grey marble tables, soft velvet chairs, tins...","Always loved the taro bubble tea here.  The atmosphere here is down to earth and very comfortable.  The aroma of the teas are amazing.","I thought I'd stop in at Ten Ren\nAnd order a Boba or ten\nIt didn't taste great\nAnd there was a long wait\nSo I don't think I'll come here again\n\nVery...","Bought jasmine green milk tea ($5 large) but thought it was just okay! Had sort of a tannin feeling with each sip that left a slightly gritty aftertaste....","It was very busy when I went today and one of the girls was very attentive and told me the wait for tables is about 1 hr and to go is about 30 mins. I didnt...","The store has two sections--one to order the item to go and another to dine in. The shaved snow/kakigori desserts are available for sit-down only. The line...","I don't think any new business should turn away customers without notice. They should write it on the doors outside or on social media. I walked in to a...","Interior changed; color scheme reminds me of IKEA \nQR code WiFi on the counter \nMenu has less items than before! \n\nRose oolong milk tea with sago tastes...","Very cute spot. Love the colors. Tea is pretty good - feels like a blend of Earl Grey and some others. Price is standard/ reasonable for the quality. The...","This boba joint is noticeably larger than most other hole in the wall ones. It's a great place to sit down and enjoy your drink. Ordered a large coconut...","The store decorations are cute and this is a nice spot to chill friends. However, the White Peach Oolong Milk Tea I ordered didn't quite hit there mark. The...","CATFISH LEVEL: 4/5: Looks good, tastes okay, finished but wouldn't get again\n\nI'm a huge fan of the brown sugar bubble milk trend that's been happening, so...","I want to give 0 star but the system doesn't allow me to.\nMe : Can I get it with no ice\nStaff: yes \n( my drink with few pieces ice on top) \nMe : ( look at...","Really not much to say but that it's a half-way decent, mediocre Bubble Tea spot. They have some good options, but I test the regular black/green milk...","I was craving bubble tea the other day, and after the closing of other places closer to me, I came here. It's very consistent with other Vivi locations- the...","Service and quality is 5 stars! Definitely enjoy their taro and matcha tea. Although everything here is great, their macaroons were off. But everything is...","I really don't understand how\nPeople can dislike Bubble Tea now\nThere's so many good places\nAnd this one's an Oasis\nIn Chinatown Brooklyn called Macao\n\nAnd...","I've known about this place for a while but never came to try it. I came here with a few friends on a weekend night, and although I didn't order anything, I...","The place is small and when you are trying to look for the store, you might miss it if you are not looking at the sign. there's no table to sit so it's more...","This is a cosy and cute Asian restaurant that is located in Sunset Park. My friend and I came here on a Sunday for lunch and had some hot and spicy plate...","My friend and I were craving for popcorn chicken and decided to check this place out. \n\nThey're located on 5th Ave instead of 8th Ave so I guess Brooklyn...","Tried their Charcoal Milk Tea and Charcoal Coffee. I prefer the milk tea as it has a unique flavor, did not taste like the regular milk tea. As for the...","I came here for bubble tea after having lunch nearby.  This place seemed new so I thought I would check it out.  I ordered the large passion fruit green tea...","This place is cute I live two blocks away I decided to give it a try. I had there rose milk tea and honey milk tea . It was really good . Came in here with...","My boyfriend and I passed by Bao Bao Tea numerous times and finally decided to stop by for a quick snack. The decor was very cute and inviting. We tried the...","Cute little bakery steps away from the R train. Suitable for small groups as they have tables seating parties of two. I'd say maximum occupancy is about 8....","The word, 'Bread' in Bread and Joe doesn't convey the beauty of their panna manna from heaven. So scrumptious, it's nearly impossible to resist. The Joe is...","This review is for vegans and vegetarians. Bread and Joe is different from most coffee shops because they have bubble tea, Asian breads/pastries, as well as...","I discovered this place through WeWork. I love the food and I love the guys that work there. \n\nAND IT'S CHEAP. \n\nI can seriously have it every day.","I really thought poke was a fad, but the shops keep on opening.\n\nI stopped in when they first opened. The space is bright and clean, with a few tables for...","Came in after playing catch on a sunny day and it was a perfect amount of refreshing sustenance. This place has a bunch of little cute perks. I really love...","I really enjoyed the protein Berry smoothie I ordered, and it was delivered in 15/20min which was great. Good bang for the buck - I'll be ordering again.","First and foremost, cash only. Secondly, this place does not disappoint. The smoothies are so good!! Best ones I've had in the city. The prices are very...","Fantastic place for fresh smoothies. I've only been there twice during lunch break and I've really enjoyed the Cold Cure. If you're all about immunity and...","Vivi Bubble Tea shops are sprouting in other neighborhoods, but this particular Brooklyn Heights location continues to be my favorite!\nI love their teas...","This shop is cute and the staff is respectful. They have a variety of bubble tea to tickle your taste buds. I decided to try this restaurant out because it...","I L. O. V. E. THIS BUBBLE TEA!!!!!!!!!!! Well... maybe not that much. I always get the jasmine bubble milk tea but one thing that I love about this place is...","This was my first time there. I loved the Honey Milk Green Tea with Bubbles. I almost missed this place given that their sign is small. Luckily for me I eat...","Kung Fu Tea never disappointed me, including this one. I have been coming here for the afternoon lift for a quit sometime. I have tried a few different...","It doesn't matter how cold it gets and I'll still be craving boba / bubble tea / whatever else you call it. However, I should have opted to try the new Gong...","The drink was good! Ordered a black milk tea with bubbles. And the drink flavor was super on point. I can have that all day. \n\nTapiocas were perfection:...","I've been on a bubble tea kick lately, so I was excited to see a relatively new bubble tea place here and, of course, wanted to try it.\n\nUpon inquiring, it...","I've had Koi Thé in Asia a few times and it's always been pretty solid, so I was excited to see them bring it to the states with this location in Washington...","This cute new bubble tea spot called opened up on grand street thats also designed by wonder world space! So you already know you can get creative with your...","This place has everything you need at a bubble tea spot. Cute decor, well made drinks, and great location.  Very instagramable. \n\nI got the Tide Lemonade...","We happened to come across this cute new bubble tea shop after lunch on opening day, and they were having a 50% off all drinks special. The interior is very...","Must try: Brown Sugar Boba Milk with Cream Mousse!\n\nWhy: To me, it tasted like flan that you can sip! It was incredibly flavorful, rich and savory. The boba...","I have tried this in Hong Kong before and already knew what the hype is about, that's why I still want to get some now that they're in NY!\n\nWhen the store...","I went here twice on separate weekdays. The first time, there was no line, but the second time, there was a line. The wait was about less than 5 minutes in...","I stumbled upon this spot because my friends and I finished a long day of conference. It was one of the few spots in Chinatown that was open late at night....","I'm sorry but this place is overhyped! I don't understand how this place is getting so much 5 star reviews. Go for the experience but don't expect the drink...","Was very excited to try this place and it did not disappoint. I'm a huge bubble tea fan and feel like there's been a huge saturation of bbtea stores but Tea...","Cute, intimate place! I wish it was a bit bigger though, so be aware of the spacing. But the staff was very attentive and patient with their customers.\n\nI...","Cute little bubble tea shop near canal/centre st. I often go here cause it's close to the subway station. I've tried a variety of their drinks including...","Good milk tea in a cute little shop right on Canal Street! We got the Three Guys and the Peach Oolong Milk Tea, both at 70% sugar.\n\nThe Three Guys (milk tea...","What I most like about this place is the ordering process is extremely customizable and the guy making your drink lets you taste test it before giving you...","Decided to do a milk tea crawl today, this block is really good for Bubble Milk Tea. Teado had soooooo many choices of tea!! I felt like I was looking at a...","This place is probably my favorite tea shop in Chinatown, everything here is really authentic and unique, from the cutely decorated interior, to the vast...","Bubble bubble! Bubble tea! Quick on the go bubble tea in Chinatown!\n\nLocation: it is located in Chinatown and will satisfy your bubble tea craving! The...","Changed owner and they don't honor the yelp discount.\n\nThe chrysanthemum honey basil seed and aloe drink is good...though at the last minute, they told me...","Love the watermelon tea \nWas so refreshing thanks so much \nIt was my first time so so excited to see you soon","New York itself is a metropolis of bubble tea, and there is never a shortage. Boba has this insane cult following in the most urban and metropolitan cities...","I stumbled upon this place after getting dinner in Chinatown, and I'm so very glad I did. Their soft serve is incredible and I will now go out of my way for...","Simply amazing bubble tea with fresh ingredients. \n\nI stumbled across Bar Pa Tea after a long day shopping in SoHo. It was one of those moments where you're...","So I went quite out of my way\nTo try Boba here one fine day\nThe yum drink made me fatter\nBut getting flipped off was better\nSo I'll def return to Mee...","Hole in the wall store that sells bubble tea and small eats. This place is a hidden gem because their prices are hard to beat compared to other bubble tea...","I love going to Mee's! This is the place to get inexpensive teas and snacks. It is a hidden gem and is my go-to place to grab a bubble tea and a light snack...","I have had Gong Cha three times in my life. First time in Myeong-Dong, Korea and the rest of the times here. I had to come back! And, it is the best bubble...","Food [2/5] - I decided to be adventurous and try something new, so I got the brown sugar foam tea [3 more words] or whatever it was called. Notably, I got...","Bubble bubble! Bubble tea! Quick on the go bubble tea inside Fulton Center!\n\nLocation: it is located inside Fulton station and will satisfy your bubble tea...","Again, great drinks \n\nOf the two, get the mixed fruit, it's more refreshing and lighter than the watermelon cheese","Love to try all kinds of bubble as I am just a crazy huge bubble tea fan\n\nGot attracted by the poster of purple looking drink and decided to give a go. The...","I love Moge. \n\nTheir cheese topping is the best ever. Yes I said it. Cheese on watermelon. Get it.","Yay!!!!!!! My favorite chain opened near my work! Now I can grab bubble tea on my way home!","I went here and got an oolong milk tea with boba. The oolong milk tea was good, but the boba was unbelievably overcooked and mushy to the point where I...","Forever my favorite tea chain! I'm so happy to see one pop up in soho since I'm always in the area. This location is pretty small but the staff is extremely...","Such a nice and cute shop. I love how they use FRESH FRUIT for their teas, the staff were so nice, friendly and let me customize unlike major franchise...","The mightiest around. No lines or frills. Relatively affordable. There's a few tables, for like 6 or 7. They serve cream cheese teas, smoothies, and milk...","Love this place for fruit tea or any tea for that matter. The people who work there are super helpful and nice. They helped me figure out which tea I should...","This place is incredible.  Prices are reasonable and you actually get a nice portion that fills you up.  They have all these magical powders and things they...","Went here to quench my hot Saturday afternoon thirst with their carrot orange juice. I think they added in Apple so it was pulpy and Apple -y . Very weird....","I stopped by this place for some bubble tea, though they do seem to specialize more in smoothies, juices, and healthier drinks. \n\nIt was an average...","Their house-made tapioca is SO GOOD. The texture is different from that of the packaged pearls, in a fresh pasta vs dry pasta kind of way. They're...","Hello always is a cute new bubble tea spot by Washington Square Park. Their milk teas are made with actual loose tea leaves and tasted very authentic. They...","The golden oolong milk foam here was delicious! I would definitely come back here just for that. Cheese foam has been all the rage recently, but I'm not a...","Amazing service and food.  The BBQ skewers are so tasty and the ramen is on point.  The place is so homey and cozy and the food is SUPER fresh.  10/10 would...","Super high quality boba teas. Pricey but quality makes up for it.  Come during their Tuesday Apple Pay discount days!  \n\nHad their green milk tea with boba,...","Really really satisfied with Strawberry Matcha Latte, which the guy recommended to me. That drink is literally AMAZING. I can't imagine a person who is a...","I've never really had any major problems with the drinks at Boba Guys. Sure, they've forgotten to add bubbles in an order or two, or maybe messed up the...","I usually opt for my classic taro milk tea - tapioca Pearl's, 50% sugar , no ice when I get to stop at these places. I wanted to try something new and milk...","To be truly honest, the only reason I came to this place more than once was because my coworkers were craving boba / tea and because this is the closest...","This CoCo has not failed me yet! I love the lemon flavored drinks from here.\n\nI usually get the Lemon Dunk, but this time I tried the Lemon Aloe Vera with...","Love the cute concept that MomenTea is going for here! Nestled right by the 14th street 1 train subway entrance, Momentea serves both boba, sushi,...","Drink: 5/5\nI would highly recommend the boba / tea beverages here if you are just stopping by!! I got the matcha with red bean and it's perfect if you don't...","The drinks here are so delicious and unique!! I highly recommend coming by and trying out their extensive sweet drinks menu!\n\nI had a cheese tea with...","New favorite tea shop!! I tried the house special milk tea (no ice, 50% sugar) and I loved the taste! You can definitely taste the authentic tea. The...","Oatmeal and bubbles in milk tea? That definitely makes it a bit more unique in comparison to all the bubble tea shops that line 14th St!\nThe milk tea flavor...","My favorite milk tea shop in NYC! I've only tried their house milk tea and have been ordering the same thing at every visit because I like it so much. It...","I heard of Boba Guys so many times. I finally get to try it out! \n\nI love the fact you have an option to pick soy or oat milk instead of milk. Love that!...","My boba experience is pretty high. Where I'm from, there were definitely several terrific places, that also offered terrific prices. My favorite drink has...","Initially I didn't understand the hype around Boba Guys. Maybe 2? years ago I tried it for the first time and didn't think it was all that great. I believe...","So if you drink a little too much Vivi\nAs in, if you drink as much as Me-me\nYou'll say within a minute\n\"Where's the bathroom\", then be in it\nAs you...","Brace yourselves and teleport to Japan within seconds. This place gives you some serious Japanese vibes. Loved the interiors and a really friendly staff. It...","A bit dirty inside, but the workers are really nice. The drinks are also well made. They made a mistake on my order but fixed the situation fast.\n\nThey were...","Here's the thing: for all of you judging this place based upon its \"bubble tea\", you're missing something important.  I've been going to this place since...","I came in here to get a drink with my best friend since we were really thirsty. The gentlemen that was at the cash register was really rude and has crappy...","Although my top criterion when judging milk tea is whether or not the tea flavor is strong enough, ten ren's tea flavor was too strong and bitter for me...","I love cream puffs and the best ones are here at Alimama! I had the ube cream puff and it was the perfect amount of sweetness and flakiness.\n\nMy friend had...","Let's see if this works because I am running out of superlatives to describe Alimama. I have come to realize that for months I have been eating art that has...","Yesterday, (October 1) I was able to finally visit this place (after months of drooling over their posts on Instagram.. lol). They have a promo wherein you...","I have been meaning to check out this cafe and finally got a chance to stop by. Unfortunately, i wanted to try the soufflé pancakes that they were currently...","Thought this was just an art space/studio (which it is) but saw a cafe too offering boba in bottles so my friend and I stopped to check it out. \n\nWe got the...","HC+ was delicious! A refreshing honey lemon jasmine green tea :) \nWould come back to try their other drinks. \nThe interior is also very chic & modern-looking.","Ever since they've opened, The Alley has been my go-to spot because of both the quality and the convince (it's located very close to NYU and Cooper Union...","The only brown sugar bubble tea I've had is from Chen San Ding in Taiwan and it was incredibly good. This place is very underwhelming in comparison. The...","The Milk tea at The Alley is phenomenal! The creme brûlée is the winner in my opinion. The tea is not made with tea leaves but rather with milk and slow...","This is a small little shop off of one of the streets in Chinatown, New York. The staff here seems friendly but they need to smile a bit more and be more...","Vivi's is always a reliable spot for a quick boba tea. While it isn't a place that blows me away, the flavors are always good and they're fast with their...","Pretty standard Vivi but I am somewhat partial to Vivi's tapioca and their Taro milk tea with extra Lactaid.  This location is tiny with standing room only...","5/5 because \n\nThe drinks are pretty great, though taste just a tiny bit different than other Moge Te shops - maybe my imagination, still good though \n\nIt...","Service was not very friendly here. I initially ordered the dragonfruit tea but changed my mind when he rung it up and it cost $9. I don't know anyone in...","So I visited Moge Tee for the first time on Thursday in Virginia because my friend was raving about it. He specifically said, \"Get the cheese black grape...","Another boba spot.  I never tried boba from Coco's.  My Albanian friend and I were walking around deciding where to stop by for a refresher.  We said the...","Service:1/5 Taste:2/5\nThe staff who shakes the Boba undermined me \"Do you even know how to do math\" when the itemized receipt showed different amount than...","This is a small take-out location, walk in directly to the counter to place your order of one of a few dozen drink options. Menu is directly overhead the...","If there is a \"10 STAR\" review, I would give it to this place. I was out with a friend a few months ago chilling at WSP when she suddenly said, \"have you...","Very interesting place. \nI didn't know about this place, but my friend recommended here.\nLoved their BoBo tea! \nThis place can be very crowded, and the...","Overall, the place is nice and I don't need to wait for long because I've arrived at 4pm.\n\nHowever, there's too little  芋泥in 芋泥脏脏茶. It makes this drink...","TLDR: Great place to get real Taiwanese teas and bubble teas that you can customize to your liking! They even have ice jelly! Overall rating: A\n\n\nI love...","Came here to enjoy a bubble tea.\n\nStand by and wait to be acknowledged. Wait. Wait. Wait. Failure.\n\nGo over by the register. (maybe I was standing in the...","I got a brown sugar milk tea. I wanted to adjust the sugar and ice level because I find that sometimes bubble tea places can make it too sweet for my...","Their bubble tea is great just like at all of their other locations. Anytime I am in Union Square, I always try to stop by here for their sweet drinks. The...","Had to downgrade to a single star. I stopped by again for the salt pepper chicken hoping it would be better, and discovered it was raw when I was home....","If it were Lychee, it'd be my largest cat. But it's not, it's Vivi.\n\nThis is one of two Vivi locations which I came to and enjoyed a drink and then the...","A gem. \n\nThe Jasmine Honey Milk Tea and Signature Cold Brew will take your breath away.","It's a nice and quiet place that you can enjoy your tea. Good for hangout with friends, or on a date. Feel relax and chill. The tea taste good. Everything...","Sara is awesome. She made me feel super welcome and knew her teas, and was fun to talk to. The teas are pretty pricey, however, and the vibe definitely...","You know when you're on vacation and you may not eat a single vegetable besides fried potatoes? That's when it's great to start your day with a freshly...","4/5 because \nThe food isn't really good\nBut they do go above and beyond most others with this style shop, to the point where it's actually almost pretty...","So if you're feeling kinda spesh\nAnd you just had a mega gym sesh\nCome on down to Greenwich\nWhere lots of gay men itch\nTo eat Acai Bowls from Cool...","Kung Fu Tea has always been one of my favorite chains since living in nyc. And this one has amazing location, very close to NYU and Washington Square...","So if you have nothing to do\nAnd your partner won't give you a screw\nI know something better\nAnd very much wetter\nGet Lemon Black Tea from Kung Fu!\n\nWhat to...","One of the bubble tea places nearby bobst library, perfect for your afternoon study break for a small boost of caffeine and sugar.\nPrices are not affordable...","Excellent spot. I got the açaí bowl with peanut butter. It is very good. They gave plenty of fruits and a nice serving of peanut butter. Plus, the Highline...","Cute little shop!\n\nThey have so many different options on their menu! They have a 'Classic smoothies' list (w/o milk), a list for their 'Amazing drinks' w/...","Not very much smoothie in this bowl  I don't think it's worth $11. There are places that charge less that gives a lot more\n\nThis is a replacement bowl the...","Came here on the recommendation of a friend. They have something called a cold brew lemonade that I've never seen before. After some coaxing from a staff...","Did not disappoint!\n\nThe staff was super friendly. He let us sample multiple flavors and was very patient with my friend and I as we went back and forth on...","Cool unique tea and coffee shop. Adding nitrogen to their teas creates a smooth and creamy texture that I've only witnessed before with coffee. \n\nNitro...","Hudson Market has an excellent variety of hot food options for lunch. I was so impressed with their Bibim Bowl station! I ordered a rice bowl with rib eye....","Dear Hudson Market, I live near by and mainly come to buy snacks though I am hoping to try the juice bar soon.\n\nI am writing this to ask you to please carry...","We were looking for a place to grab a quick bite before getting aboard our cruise. This market had something for everyone. Organic, vegan, sushi, burgers,...","This is a real taxi driver's haven!...so you know it's gonna be tasty food!  It's kind of divy, but the food is delish!  Some dishes better than others but...","I decided to pop in here during my lunch break.  Big mistake.  The inside is structured as a takeout location and then it is partitioned into another area...","I often long for a FLAVORFUL breakfast--something with a little more liveliness and zest than a bagel (snooze) or oatmeal (double snooze). Since most of our...","I don't Yelp a lot but this place deserves it.\n\nI grew up in the San Francisco Bay Area where great Chinese food is plentiful. Moving to NYC was a huge...","M.Y. and I stopped in here after a long bike ride down the shore parkway to Coney island. While most of the eateries in the area are concentrated on...","I am amazed by the quality and quantity of this food. Very flavorful and not greasy or oily AT ALL. Not your average Chinese spot. They also have Vietnamese...","Now it's my favourite sushi cafe. Great Philadelphia, soup with seafood. Cozy atmosphere, Good wine)) I like that place is near to beach.","No frills sushi.\n\nThis is really a 3.5/5 Stars place. Unfortunately yelp does not have a half the star option.\n\nThis is a dine in review.\n\nStaff: Great,...","If you're looking for a some good affordable sushi this is the place to go! I've been a regular at this spot for the last 4 years and 1 new girlfriend later...","They're bubble tea is alright, but nothing special. As for appetizers, I am a huge fan of their pepper salt popcorn chicken and their fried tempura,...","I was randomly craving Thai Milk Tea, so I came here to satisfy that craving. I wasn't impressed. Everything about this place is average. There was nothing...","Not the friendliest of service but delicious bubble tea! Prime location, near the bus and bank and sushi across the street! Love coming here after sushi and...","Stopped by on an early weekend afternoon, ordered the banana crepe with vanilla and chocolate ice cream.  Only one other customer there so it came quickly....","We came here spontaneously because we wanted desserts and this was the closest dessert spot in the Bay Parkway area. \n\nWe ordered both crepes and drinks....","This is a really good place to stop and get some ice cream and bubble tea! The ice cream is delicious!","A decent bubble tea and snack place that locals visit. The customer service is average, and may get impatient. The interior is cute and bright, and there's...","Honestly, 80's Tea is not the first bubble tea shop that I would think to go to. However, their value sets are worth it! For the price of $10, you can get...","So I know that you all have ADD\nSo I'll tell you real quick bout the latest tea\nIt's hidden in the borough\nOf hipsters and sorrow\nAnd it goes by the odd...","This place checks all my yes's. Clean place, clean bathroom, and very spacious place to sit down and chill.\n\nTapioca was soft and chewy, and best of all the...","I really wanted to love this place. They came up on my yelp search a couple of times for bubble tea and I was drawn in by all the tea options on the menu...","What a refreshing new tea shop! Upon looking at their menu, I was initially overwhelmed by the amount of choices they have (indecisiveness gets the best of...","Service is excellent. Good music, good hooka, good vibe. Music loud enough to jam to but not too loud, so can talk to my friends with out struggling easily....","Reazon Cafe looks like a very promising new hookah lounge/restaurant in Brooklyn. Very spacious, friendly employees, fast service, and most importantly good...","This place is soooooo deceiving when you look it up online. All of these pictures is NOT at all how the place looks in person. I went there yesterday with a...","Love their buy 5 Portuguese tarts- get one free. Did that with hot milk tea and a set (4) of coconut glutinous rice cake encasing sugar and peanuts aka...","The food doesn't look freshly made, but after heating it up at home, the taste and texture was pretty good.  \n\nThe portugese egg tart surprised me how good...","Now I only tried this when they had just opened but their bubble tea tasted like chemicals.","The food comes out fast, it's not the highest quality but it's tasty! They have a lot of options to put on your burger and a meal with fries and soda is...","Very disappointed in food, how does house specials go from 7-8  to 11-$12 according to seamless and the food quality got worse. Last time I ordered and got...","I've fallen crazy in love with their chicken fingers. It's absolutely fried to perfection, a crispy crunchy texture with a golden brown touch. It can be...","Good, inexpensive American Chinese food establishment.  They are always willing to customize your order for you, even cooking something that is not even on...","I decided to order this on seamless , decided to take a bite out of the chicken and because the batter was so hard I couldn't even chew into it. So I...","Gross! Ordered delivery and the chicken wings looked like they were fried over and over again. It was way too dry. Fried wontons were gross too. Didn't like...","I got the green tea latte and added some\nRaw sugar to it and it was good for me. The other drink was the mango mojito and it didn't taste as good and to me...","This is a very mismanaged Cafe Bene. The service is super slow for even an iced coffee. The server (I think he's the manager) is scratching his head and...","Came by here on a Saturday afternoon during a HOT 100 degree day with my family. As other tellers mentioned, the AC here is a bit weak (-1 star). Overall,...","I don't really leave reviews unless something is extremely pleasantly surprising or truly awful. Luckily, this is the former. \n\nI expected your average...","This is a take out experience. Restaurant is very clean. Ordering easy and cashier guide you with patience. I ordered general tso's chicken, shrimp, mixed...","Yesterday was my second time in two consecutive weeks that I have visited Hala Xpress and let me tell you this place have not disappointed me yet. The place...","This is our fav local bakery. The prev reviews mentioned banh mi (viet sandwiches) but they changed owners so they no longer have that. Instead, they have...","Best croissants and ice coffee on the block. Also love the curry fish balls. Of course they are very inexpensive. This is my go to spot for ice coffee in...","Living in the area, this is a great option for a cheap breakfast!\n\nI come early on the weekends for a great breakfast. They have a wide variety of food from...","Go-to spot for authentic Malaysian food which is seriously hard to find.\n\nI'm here all the time for consistently delicious food. I have yet to be...","Ordered delivery from here. Wasnt that hungry so I ordered the roti canai and beef satay as light snacks. They have a $7 off coupon on grubhub so my order...","The service here is definitely better than a lot  authentic Chinese and Malaysian places I've been to. They're attentive and they actually refill your...","This little fruit stand  has been my favorite place to go in the last few months. I love love love the bubble tea selection Mango.  The price is totally...","I love this place and so happy it's in the neighborhood. I get my smoothies from but recently noticed they downgraded their sizes, which sucks considering...","Lots of great juice and bubble tea options, a variety of snacks and good prices on produce.","Preface: I drink a boba a day (except on cold days) so I feel I'm quite an expert lol. What a hidden gem! The only thing (I wish ;) is that this shop was...","We have been going to this Mr. Wish location for more than a year. The people working here are so nice, friendly, and accommodating. The drinks are...","Polite staff willing to work with me to get the drink just right, fresh ingredients, old favorites and innovative flavors. It's the best boba shop in the...","I'm broke, if I keep drinking Boba, I'll be BROKER\nI'm so addicted, thank god I'm not a SMOKER\nAnd not a Pepsi addict or a dumb Diet COKER\nAll I do is drink...","While I was waiting for my order, a guy approached the counter and it sounded like he was a regular there. The girl greeted him by name and even memorized...","So, this place had so many recommendations on Yelp that I truly had higher expectations when I visited this place. However, I was severely let down. There...","Though I usually like to check out local milk tea shops rather than the chain places, being from the San Francisco area I couldn't resist walking into Boba...","I've never seen so many options for bubble tea. \n\nI usually get the same bubble tea every time, the classic taro. They actually didn't have it, so they...","Started with the strawberry matcha latte and jasmine milk tea, will be back to try it all. Perfect boba, flavorful tea and quality ingredients. I usually...","This cute little cafe is surrounded by bustling bars; almost like an oasis of quiet in all the noise.\nI got the jasmine green tea with cheese selfie foam...","Less work and less expensive (but only just) than DIY, and for that reason alone, you should try it.\n\nDoris Invites U to one of the fanciest little shops in...","I love the tea and the decorations here so romantic\nPink pink pink \nHighly recommend their unique tea drink so fresh and good for throats. Get your own...","Jasmine Bubble Tea is on point. \nConvenient: order-ahead and skip the line. Your drink will be ready when you get there. \nTip: small place designed for...","Found this place on Yelp when looking for good bubble tea in NYC. Saw the great reviews and wanted to check it out.  \n\nLocation: They're just a few doors...","A cute little bubble tea shop with adorable decoration. I was out with a couple of friends and wanted a drink so I just ordered a rose tea and hopped off,...","First time trying Bubble Tea outside of my country (Norway). And wow. This place and its bubble tea blew me away! So refreshing and delicious. So many...","This area is bound to meet all your bubble tea needs (with GongCha and PaTea being right across the street). That being said, the major thing Vivi's has...","If it were Lychee, it'd be my largest cat. But it's not, it's Vivi.\n\nThis is one of two Vivi locations which I came to and enjoyed a drink and then the...","If you are the lock, I have the KEY-VI\nIf you're Anthony Kaedis, I am the FLEA-VI\nAnd unlike freedom, this isn't the FREE-VI\nSo try the mixed fruit drink...","Love this place! There's always tables available and they have outlets as well. They have a great variety of drinks. I love the red bean matcha tea.","The drinks and popcorn chicken are pretty good. For $5, they give you a lot of meat. It's enough to be a filling meal. The service is a bit slow though,...","I  that place \nClean neat quick delicious professional \nI get drinks there maybe every 3 or 3 days and it's always delicious","Wow the pearl milk tea here is sooo good. Pretty high quality, kind of has a brown sugar taste to it. I ordered half sugar and it was still a little too...","This is a great Gong Cha location! The service is fast and friendly, and the interior is clean. Been here a couple of times now, and it's been great each...","I decided to try the cheese foam i saw online, so i got one bubble milk tea with cheese foam.\n\nUnfortunately i was not a fan of the cheese foam, it tasted...","We came here because the bubble tea joint across the street ran out of bubbles, so we gave this place a try. What a bad idea it was. We ordered a HOT...","With so many incredible places for bubble tea in NYC and in the neighborhood where we live I tend to be very selective - this place missed the mark on...","Got the \"First Love\" drink from their signature choices. It was very refreshing, woke me up a little and has a citrus/sweet-tart taste to it. I got it warm...","Delicious bubble tea. They seem to be on the healthier side too given that they have goji berries. I ordered a heat wave for $5, which is passion fruit...","The most decent boba shop in midtown! \nFriendly service, clean and modern decor, plus fair price. Two thumbs up for trying to be environmentally conscious....","Coming to a Gong Cha close to Times Square, I didn't expect it to be as wonderful as it was. This Gong Cha is very small, probably only fitting 10 seated...","Got Pearl Milk Tea (it's black tea in case you are curious) with 30% sugar, less ice, less bubbles. Perfect, not too sweet, and delicious. \n\nGuy who served...","It's nice to have a Gong Cha location that is a good nearby alternative to the cramped, crowded one in Koreatown!\n\nI asked about the white pearls' texture...","Whoa !!! A Bubble Tea shop that also has Poke, Sushi Rolls , Desserts, Craft Coffee and Juice mix with Tea. And it's by the Port Authority Bus...","Try the fresh grated taro/purple yam milk tea! Cheese foam fresh fruit teas and brown sugar teas are also good, but overly sweet for me. Cute cups and great...","I'm going through sort of a revival with bubble tea. I used to drink it all the time back in college, when I got to the point of not being able to eat a...","The ambience is very nice and cute.\n\nIf you are ordering the taro milk tea I would tell you to only expect the pieces of taro and no added artificial...","Onezo just opened last week! It's located on 3rd and 13th. I was there around 3pm and the store wasn't busy. I ordered a onezo milk tea with 3 flavours of...","Finally waited till their grand opening!! I don't need to fly to California for these freshly-daily-handmade boba anymore. \n\nI am so excited to try their...","Came here for their grand opening.\nThey had BOGO promotion. But unfortunately there were only 4 drinks option.\n\nOne zo milk tea with boba: bubble was very...","Very small tea shop right in the middle of Korea town.  Just an order and go location.  Lines tends to be long.  I ordered the Lychee oolong tea for the...","Came in for a quick bubble tea run after some nearby shopping and the cashier was super efficient! I wanted to trade out certain toppings in one of their...","4/5 because \n\nThe drink is good, and consistent every time \nIt arrives reasonably quickly even with a line \nThe place is clean\nNo seating area, it's a to go...","First time coming here, I made conversation with the worker there since she was so nice. You felt welcome as usual and I had the strawberry explosion, It...","Chowbus gave me a coupon so I decided to try this new boba place! The strawberry with milk tea (from dirty milk series) didn't taste too artificial and it...","Pretty good for a place that just opened up. I ordered the 50% sugar and ice for the matcha boba milk tea. It was okay. Too much milk not enough matcha but...","Cool little place (very little)! Keep in mind it is cash only - I seldom carry cash, but read another Yelper's review about that so I had a head's up....","Very delicious smoothies and lots of options. I got this before I went to get my hair braided. Yummmmyyyyyyy. \nMenu posted below","I used to live by the Hawa in EV and was happy to find one not far from me in Brooklyn! \n\nI woke up this morning with a sore throat, and needed something...","so good soft serve ice cream!! only flavor is taro or tart but taro is all I want always anyways, got red bean topping (.75cents more) and well worth it....","I love boba drinks, especially during the summer! I recently moved close by and was really excited to try this bubble tea location. Unfortunately, it...","Yesterday morning around 11:30am I stopped by to get six drinks. There's only one worker who's doing bubble tea which is understandable because that's a...","I just about died when I walked down St. Marks and saw Yi Fang across the street. In a way, I hope no one finds out because the lines in the Flushing store...","I love this place!!! Sooo nice teas!!!!\nStaffs are making so fast!!!\nBeautiful shop!! Nice design!!!","Great customer service!\nAlways love their signature fruit tea.\nFor me I felt no sugar already sweet enough.\nAnd today was the last for soft opening...","Really cute bubble tea place in the heart of nyc right next to Columbia! The inside, menu, and cups are quite modernized and they also have a lot of...","My favorite boba tea  cafe in Uptown! Although pricey (A little less than $6 for a rather small tea with boba).\n\n**They have a $6 card minimum.\n\nMy favorite...","This place is great in terms of the location, especially if you're a Columbia student or employee. I like their honeydew, lavender, and rose flavors. The...","Pretty decent first experience. I asked to order a custom smoothie, he said \"sure\" I ordered mango, strawberry, and spinach. It took maybe 4 -6 minutes,...","If you like what juicy then come to this little Acai and smoothie shop for boba. But you might not like the taste, because juicy, the thing is, the Acai is...","Bubble tea from here is always yummy, and I like how as soon as you walk in they are playing cool music to get your morning going. The smoothies are...","I've come here way too often. I'm addicted!\n\nMy ideal order: Medium Brown Sugar Milk Tea + Milk Foam, less ice, 30% sugar\n\nLess ice, more drink!\n\nDrink up!","My bf and I were excited when we found Gongcha nearby--drinks came out fast; we were the only ones there so I expected nothing less. But why is the girl who...","I really like their toppings, especially grass jelly, white pearl and the classic pearl!!! They are really great and just like what I had in China. Their...","I've never seen or tried banana milk tea, but this was the place that had it so I ordered it! It was pretty good, it had a bold artificial banana flavor...","Tried Panda Bubble Tea a few times at this convenient location, each time I'm hopeful that the next experience will be better. So far I've ordered their...","In short, they couldn't manage to track the orders of 3 customers and had terrible customer service.\n\nCame here for bubble tea. They had terrible customer...","So America's been propaganda'd\nAnd my used car has just been Miranda'd\nBut all is not lost\nCause whatever the cost\nI'm taking you out now to get...","Never had an issue here. Cashier and etc are friendly and always helpful and willing to accommodate requests.  \nI typically just get a plain iced coffee or...","Their fruit tea is all with syrup. Honestly, I don't even remember exactly what tea I ordered, but I know it was a fruit green tea. I asked for half ice and...","Came to NYC for a quick trip and I needed my morning smoothie fix. Great tasting smoothies, chia pudding & oatmeal! They only use fresh fruit & veggies,...","We were walking around New York and wanted a cold and refreshing smoothie. There were SO many shops to choose from. This seemed like a great option though,...","When u are in a rush or just don't feel\nLike having anything too heavy a decent juice place like this can come in handy. \nFirst time I had the Tropicano...","My friend told me about this new milk tea place that had a chandelier and if it wasn't  that he sailed it's  next to \" Lady M \", I would not have found it....","I came during my lunch break as I'm a big fan of boba and the name caught my attention.  Luckily it wasn't busy when I went and the inside is adorable....","First time visit the place, knew from the reviews that this is not a traditional milk tea place. We ordered the imperial palace w/ aloe and the beverly with...","Amazing service & bubble tea. They helped me a lot when i didnt know what i wanted and had a bogo during the grand opening. Definitely recommend, would come...","Newest Vivi in the neighborhood! Situated right away from Coco!\nThe staff is very friendly and fast here. The staff always asks if I need a bag since I...","Deliriously happy to see a Vivi Bubble Tea spot open here near my office. I love this place. I went on opening day and it wasn't bad. Expected chaos but...","Good experience! Came here after work; will definitely be coming back. \n\nService is prompt and quality is pretty good; was happy with that. I got a passion...","The Lava Pearl Latté was sweet and creamy, but the boba was so tough in the middle.\n\nCoCo, you are a boba shop.  Please focus on good boba first.","My Go-To bubbletea place near work. \n\nWhenever I'm at work and I crave bubbletea, I would visit Coco. For the past two visits , I have ordered the lava...","I finally noticed they came out with their version of the brown sugar milk tea, #bless. It's creamier and a lot sweeter than any brown sugar milk tea I've...","I got the Vivi milk tea and my friend got the 3Js. They both tasted diluted. The milk tea and the syrup they used did not seem to mix well, as there is a...","Good bubble tea place in the city.Their fruit based bubble tea are unique. Highly recommend to try kumquat  and lemon tea. Their bubbles are better than...","We visited here after our picnic at Central Park. It was a hot morning and continued to be warm even after it started raining. So the drinks we got were...","I went to Coco for the first time in a while before going to Shakespeare in the Park and, I must say, they seem to have improved a lot from what I...","If I would give this place no star I will!!! We were to this store around 8pm and I know they close at 10pm. The lady with blond hair with HORRIBLE...","Came here on a Friday night around 8:30, and there was a 20 minute wait, which went by pretty quick! The seating in this place is ample, so don't be...","I needed some refuge from the crowd on a hectic Friday late afternoon - on a three day holiday weekend no less! - and stumbled into Grace Street.\n\nFirst, I...","Sweetness is my addiction I am fighting everyday of my life especially now, trying to lose weight before the holidays are in!\n\nSecond time coming here and I...","Wandered into this bakery at random, and we were so impressed. It is a small space (not a great place to study), but the baked goods were delicious! We...","CREAM PUFFS. BIG BIG CREAM PUFFS.\n\nMy favorite is the Matcha. I felt the Earl Gray & Black Sesame were too sweet. I came in during the week around 2pm and...","Instagram worthy? Of course. \nThey have cute little baked foods. Located near time square. The jasmine matcha latte I got was okay. Mostly jasmine with no...","The bagels were pretty decent, not too shabby but not mindblowing either. We ordered some breakfast bagels, and the bagels themselves were very fluffy but...","I've come here twice; both times have been great. I get iced coffees (La Colombe coffee) and avocado \"toast\"...everything bagel with avocado spread. It's...","Food was pretty good for what we got. Came here stumbling at ~845pm on a Thursday night when we were looking for some late night dinner. Restaurant had a...","The best fresh juices and smoothies! Super affordable and everyone is kind and helpful! This is a go to for sure!","Randomly found this spot while craving a cold fruity snack. Both my other half and I went with smoothies. There are a multitude of options so it took me a...","Ordered and paid for an acai bowl, and they refused to give it to me, saying they already had, even though they hadn't If you want a business to take your...","I promised to give them 5 star well here it is.My 5 stars not just simple promises they really make good bubble teas.I really loved Honey flavor. Small but...","TBaar, not to be confused with Justin BBaar.\n\nTBaar again was disappointing in terms of product and I'm not a big fan.\n\nThe grapefruit drink wasn't bad and...","I was surprised by all the high ratings and praises when it came to TBaar and am seriously wondering if I had gone to the same boba shop as everyone else...","+ highly recommend the matcha sesame tea \n+ bubbles are good - not too chewy\n+/- coconut milk tea was very coconuty, but I didn't prefer it","So if you're sick of pictures of me\nAnd the legs and high heels of Barbie\nThere's one antidote\nGet some balls in your throat\nGet Lemon Black at Kung Fu...","Speak about the best bubble tea on the block...Literally , so there are few bubble teas on ave U that I know of so far but Kung Fu Tea is the best I have...","Excellent, very tasty, nice variety to choose from.  Even have some popcorn chicken which is not bad.","the hours are wrong, they close at 9pm. \n\nfor bubble tea places, i usually go to kung fu tea & recently, TBaar around this area. first time trying it...","So if you drink a little too much Vivi\nAs in, if you drink as much as Me-me\nYou'll say within a minute\n\"Where's the bathroom\", then be in it\nAs you...","Love this great little spot! I'm pretty sure this is the first poké place I've seen in lower Brooklyn (one that is exclusively poké, not a sushi place with...","Tasty, effective, and a quick option for a bite. Tasty stuff, just wish more toppings were included with the bowl. That's just cause I love fresh crunch....","GREAT location, clean place good menu  choices.  \n I got the chicken poke bowl,  with 1 topping  for small Bowl  $15.45  I thin it was very good but\nI find...","First time coming here for dessert after dinner in the neighborhood and noticed there were 'Liege' waffles on the menu. I was in Belgium 2 months ago and...","I ordered raspberry froyo to go and came back to my office a few blocks away (literally 2) to eat it. From the first bite I could taste the froyo was...","How can you screw up a milkshake? I got there and in a second I knew I made a mistake. The place is very dark which gives it the appearance of it being...","This is probably the best Asian food in this area. It's definitely worth it. Food is great the staff is nice and delivery's are on point. The dining area is...","Was in the mood for some Chinese food, and decided to give Asian King a try at the suggestion of an acquaintance. We only tried Chinese food and no sushi...","We Yelped sushi restaurants in the area and Asian King got some great reviews. A short walk later brought us to this local restaurant for an early...","Their poke is sooo fresh. I feel like they have more\nOptions then some other locations within the area. I eat here multiple times a week because the price...","I order food for delivery.\nI wanted to get honeydew green tea, however they couldn't make it (it wasn't good at all neither)\nHowever when I received the...","I know they specialize in poke, but I was in the mood for shumai and a kani roll.  What can I say?  I'm a creature of habit.  The chefs and the young lady...","Cute and clean space with variety of delicious food. \nService with Very positive Energy \nStill hanging here","I have ordered food from this location for pickup along eaten in store last week with my mom. The family who works here is very nice and personable. They...","I seldom give 1 star reviews.. but there were multiple chunks of glass in my boyfriends thai fried rice... GLASS. Fortunately he wasn't injured and I hope...","I come here pretty often before work. I usually order the honey tozt (chicken, honey mustard with fries on the sandwich) and a hazelnut iced coffee. The...","I'm not satisfied with there food at all. I got a chicken quesadilla and it tasted tasteless. What they have as there \"What's Good\", isn't. I used to like...","This place is pretty good. I've tried their turkey pesto toast, California wrap, chicken salad and chicken quesadilla. The portions are pretty big. I...","Came to this restaurant for the past two years, i always ordered spring roll and beef noodle soup. And I am telling you this place have to be one of the...","+ Fried spring rolls\n+ Pork chop was well cooked but a little small\n+ Good service\n- Pho was below average","Hmmm... I have mixed feelings about this place. \n\nI went a few days back and I had ordered the curry chicken with egg noodle soup. \nThe soup did not arrive...","i like there cold beverage ice coffee which is $2 hot coffee $1 tasted good.there breads hot dog breads doesn't tasted good $1 but there dim sum is good. i...","They do dim sum every day! How could I not love this place?\n\nSo maybe it's not the best I've ever had, but it's solid and it's in South Brooklyn! \n\nTheir...","A bubble-tea shop in south Brooklyn? \"No way,\" thought I.\n\nYes way, apparently. And considering the lack of any other bubble-tea places along Avenue U as a...","Good service. Good sushi. My favorite spot in the sushi neighborhood so far. Buy 2 special rolls get one free, and buy one large sake get one free deals...","So Tenda started delivering to my job and I got really excited and ordered the 1 regular roll, 1 special roll lunch special and the volcano salad.  This...","Not sure how anyone doesn't like this place. Always fresh sushi, fantastic prices and buy 2 get one free special rolls during the week. Snowcrab roll is...","I ordered on grub hub, spicy tuna with crunch, bubble tea, and snow crab roll. Total of $15.83.\n\nFirst of all the crunch was an extra dollar and to have to...","since i try this restaurant，it becomes one of my recommend restaurants in 86th street. Food are so great, and the price are reasonable, the Hong Kong style...","I've been a regular patron since they opened WAAAAAY back (almost a decade) \n\nIt's been a staple in the neighborhood. It's a popular choice after working...","Gahhh. Been here twice and first experience was a couple years back and I remembered I thought the food was ok but this second visit won't have me coming...","I love this place. I've been going here for at least 15 years - back when it was split as a bagel store/deli and Chinese bakery. \n\nThe milk tea is the best...","I don't know why the reviews here are so bad... I've been here every time I have been to New York to quickly grab a milk tea. It's not the best but hits the...","A busy small bakery on 86th street. Came here because I was doing laundry around the area. \n\nThey have fresh made on the spot rice noodles. You can choose...","Omg I found THE BEST sushi place! This is it! I always went and ordered from Tenda on Sheepshead Bay Rd but this place is 100 times better! This place is...","Okay so I think I was unblocked because I can order from them again. \n\nThe sushi is okay, I mostly order for the bubble tea.","This place is fantastic! We were treated to Omiya sushi by family when visiting NY and absolutely loved everything. Maybe we were extra hungry but I...","I have been ordering from this restaurant for a awhile now and each time they get my order right and sushi rolls are extremely good. I used to drive 20 mins...","We used frequent chikurin very often but recently in the last year it went to shit.  The service is horrible.  We got there around 9.  The host (not Jeff....","Good food though kinda expensive for what it is especially their many appetizers. The sushi rolls are great and all are around $3. The one stand out thing...","Great Place! Visited 3rd time and always happy with their services. I just like to see more varieties of rolls on the menu.","The food was perfect. But delivery man is cheating!!!! I gave him $20 and asking $15 back. He is double checked my words. But I got only $10 back. \nI know...","The lady on the phone was super sweet and super helpful when I couldn't find what I was looking for. I definitely recommend this place out of all the sushi...","The customer service here was super speedy. They're always walking around to see if you need anything. The sushi was made very quick as well.","Our party of four came here 7pm on a Wednesday. The place was half full. We sat at a booth that was in a little niche in a wall, so we felt well secluded...","Very delicious！ Great place for groups  the staff are sweet and friendly I will come again","It's a small shop on flatbush and Nostrand. I was extremely excited when I first saw this them open because I'm am addicted to bubble tea ! I saw their...","Great smoothies and juices. I especially love the almond butter punch. YUM. They also give you a card that you can use to get free smoothies on the 8th...","I ordered a vegetable smoothie and they give me a mango/banana in return. \n\nAfter displaying confusion because this wasn't what I ordered, the cashier man...","New Kung Fu tea spot that is going to compete with Mr. Wish Bubble tea and steal its customers through the amazing customer service it offers. Yes, Kung Fu...","Normally, I wouldn't make a review for a such a large bubble tea franchise, but I felt like this location deserves some recognition.\n\nThe milk tea was just...","Soft open experience! They will open early august! For those who don't already know, Kung Fu Tea is a franchise of bubble tea, but they have loyal fans who...","Favorite chicken place. I don't usually eat meat but the meat is very light and yummy. My friend and I loved it but he'd rate it 4 stars because the boba...","Felt like I wasted food while tossing my money in the trash with it. Rice balls were not appetizing - rice was hard and was not sushi rice, the filling did...","This is a disgrace to Taiwanese food. I was so excited to try the popcorn chicken and Taiwanese sausage.  I usually go to chi-ken because they take credit...","They filmed Gong With The Wind and Gong In Sixty Seconds here. But not Gong Baby Gong. That was at a different GC location.\n\nThis is the GC location that is...","This Gong Cha is small and basically people come in to get the drinks and then leave. There's a small bench for people to sit on if they want to sit and...","4 stars for the drinks BUT!! \n1 star for the service\nWe went there on Sunday, July 7th. \nI then point at Milk form green tea on the menu in front of the...","Come here for the savory waffles! My fav is definitely the seaweed. I usually pop by when Prince Tea is too packed or for something quick. I say quick but...","I've been to Snow and Cream a decent amount of times and I have to say, this place has some really good poke! I've never had any problems with my order, and...","I have been coming here for a while now since its close to my house and they do delivery. However, lately, they have been getting my orders wrong!\n\nToday, I...","I come here about once a week and the drinks are very good. My favorite is definitely the lychee green tea. \n\nThere's only two sizes, a medium and a large....","This store deserves a 0 star because of their their rude service and scams. I got SCAMMED into buying a drink and downloading an app. \nI ordered a bubble...","Service is horrendous! It was a lot better a few years ago. The workers have NO knowledge about how the kung fu tea app works nor promotions. Well in this...","So if you think your life is now over\nAnd your gf won't let you disrobe her\nAnd you ask what I think\nJust come get a drink\nKung Fu's Lemon Black Tea with...","Kung Fu Tea is a solid place to grab a boba if you're in the area. It happens to be right around the corner from my apartment, so I'll stop in from time to...","So disappointed with this location. My friend ordered for take out 4 drinks, all of them are fine except my drink. It got spoiled when I got it. I called to...","shall i just review every moge tee ever? just moved to new york and have been here three times already.\nthe avocado fruit tea is DELICIOUS. a light avocado...","I am happy I found this place because I love bubble tea and who doesn't want a nice cool drink that tastes great!  I had no idea the place even existed till...","Pretty good tea with natural ingredients vs powdered which helps differentiate these from the other bubble tea spots.\n\nMatcha was not too sweet which is...","Looking to grab a quick bubble tea post workout? Or trying to satisfy your post dinner dessert craving? Visit the rabbit rabbit tea close to Flat...","Came here to try their brown sugar boba and some other tea flavors. Having lived in Taiwan, I've tried some really good and authentic brown sugar boba so I...","Gave it another shot, but after 10 minutes of waiting, I had to ask them to cancel my order because I was going to be late for class. Rather than try to...","Love this spot! The staff is friendly, ingredients are fresh, and the quality is great. I got the Glowing Skin Smoothie and added mango (avocado, mango,...","I need to stop coming to Jupioca's lol. Ordered regular bubble milk tea this time. Bubbles were soggy, the type that's been sitting probably all day. You...","Ay ay ay. This place gave me claustrophobia.\n\nThis place is the size of a cardboard box and smelled like old fruit, and more than 2 customers can't fit...","If you're Dr. Watson, it's the ELEMENTARY-VI\nIf you have 2 lovers, wanna make it THREE-VI?\nIf the bathroom's empty, I need to use the PEE-VI\nAnd if you need...","I got this for my lunch today through meal pal and I was blown away. The meat was delicious and cooked very well. The broth and noodles were fine and the...","It's a cheap and creative place to get some Taiwanese snacks and cute bubble teas ! My favorite has been their pop corn chicken, nigiri , teas and creative...","It's been 10 minutes, and I'm DUE\nFor another drink from Kung FU\nSo now I'm going to rap for YOU\nAnd if it really sucks, just BOO\n\nSo if you and your bf are...","This review is for their Yogurt boba/bubble tea drinks. I was really excited to try these because Yakult was my childhood drink!! I tried their Yogurt...","Ordered my regular, cocoa cream wow. I've had this drink from many KFTs. My drink came out without the brown sugar markings and looked a very light tan with...","Yes! Another bubble tea shop option in the up and coming LIC neighborhood! With not a lot of tea shops here, Yi Fang is definitely a winner. Located right...","I finally got to try the fruit tea! Because of the odd location and the time (I went around 1 pm on a weekday), the store was almost empty. I appreciate...","When I was in China I wanted to try out this place so badly. Unfortunately the menu was in Chinese so I couldn't order. But, I got a chance to order in here...","Great quality of tea, they put a lot of work into making sure everything is fresh and delicious. So far I've had the piña colada smoothie, wintermelon milk...","I was excited to see a new bubble tea store open up around this area. I always come here once a week around 11:00-11:30am since it was opened.\nI tried many...","Their Drinks are really 3 stars but I gave an extra star for the good quality customer service. Good spot for a late night stop with friends but not a ton...","Their teas are great. I love to have their apple oorong tea with bubbles inside. Also, their banana pudding is so delicious that I would eat them all....","My daughter was craving some pearl tea on our way to visit colleges nearby, and Yelp led us here.  We were here too early for the pearl tea (which was sad,...","A bit of a walk from my school but they have the best rose milk tea I ever had.\n\nBut they need outlets for people to charge their phone.","After hearing about how great this place is from my boo. Me and my friend decided it's time we really gotta try this out!\n\nThe line was pretty long, but it...","Service: Counter service\nCleanliness: Good\nQuantity: Good\nFood: Tingly& Spicy Cumin Lamb $12.95\n\nWow! I'm impressed! Perfect seasoning of cumin, ma la...","You should be required to sign a waiver before ordering the Very Spicy Dan Dan Mian. The heat level is not messing around, it'll burn your mouth and your...","Stopped by and had a great Dragon Poké bowl. Food was very fresh and the location had a nice atmosphere and good seating for the lunch rush. Their POS...","I have never heard of a Kung Fu Tea selling anything but bubble tea. Being the only bubble tea place around, we had to try it out! \n\nMy friend and I came in...","They recently opened up which may explain the kinks they need to work out. The biggest one is the ordering set up. They have a separate cashier if you're...","I've wandered past this juice/tea/smoothing/acai bowl place on my way to my local library. Decided today was the day I would try it. Feeling a bit heavy...","I've been living on the UES for almost seven years and the one thing we don't have is a bubble tea place (let alone a good bubble tea place.) I don't know...","I always place an online order for delivery. Comes super fast, fresh and never melted. My fav is Chunky Monkey acai bowl - sooo delicious !","It looks like they no longer serve the rolled up 10 degrees ice cream. They now serve food, bubble tea, and scoops of assorted ice cream. \n\nWe each enjoyed...","Don't come here! Especially for the sorbet. It's very crumbly and chaulky. They said the reason was cause there's no dairy. I know what a sorbet is that's...","More than once they've sheltered me from a storm I was ill-prepared for; it's just within mad-dash range of the west exit from the Vernon-Jackson...","I paid $15 for a tiny, stale-rice onigiri, a coffee with no sugar (after they asked me if I wanted sugar), and a mango fruit tea that tasted like my mom's...","Wandered into Tenny & Betsy while walking around the UES on a beautiful spring day. Several chain boba tea places (Vivi, Kung Fu) have sprung up on the UES,...","I really enjoyed this place! I discovered it after searching for onigiri on Seamless. I was bummed I was just outside of their delivery radius, but it was...","Good try on Chowbus!!! Chowbus is a delivery app and mellow tea is on there for fairly cheap delivery fee.\n\nWe got the matcha milk with cheese foam, hot, so...","Milk tea is good. We can choose the sugar and ice as we wanted.\n\nMango Fruit tea is not made of fresh mangoes, but of mango jams, not really my type....","Another bubble tea place.\n\nThis one is north of columbia, so that's something new. The location is very small here, so there isn't really any space to hang...","So if you drink a little too much Vivi\nAs in, if you drink as much as Me-me\nYou'll say within a minute\n\"Where's the bathroom\", then be in it\nAs you...","My family is a big fan of bubble tea, Vivi Bubble Tea is the one nearby so we gave it a try. It was the worst decision, the girl who took our orders gave us...","Stopped by here after dinner for a quick refreshing heat as it had been a hot sunny day and the place was quite popular as all the seats were occupied but...","The location is clean and service was extremely fast - as the cashier was handing me my change the tea was already ready on the counter for me.  The drink...","Came here after spending a few hours at the Met since it seemed to be the closest place. The staff were friendly and polite, but I was disappointed with my...","I came here this past weekend in hopes of a delicious drink to end a fun day at the Met. I came with a few friends and we all ordered our usual bubble tea...","The smoothies are pretty solid here. I got the açaí smoothie and it was delicious. Next time I already want to try the avocado smoothie. \n\nThe prices here...","I've come here a few times now, and each time, it was just \"sort of okay\". I got a bubble tea once, an iced coffee with tapioca pearls thrown in just for...","This bubble tea place was just average. They had a large selection of drinks, but the bubble tea I had wasn't anything special. The boba was also very...","Visiting from Los Angeles, got lost and found my way to Kung Fu tea. Jason and Katherine were so sweet and helped me find Central Park. Ordered the matcha...","So advice for the CEO\nYour methods aren't secret, you know\nStop screwing your stores\nLet them up off all fours\nAnd your profits and rep will soon grow\n\nNot...","I love Kung Fu Tea and the bubble tea I got here was yummy and service was fine. However, I work in the area and would come here a lot more often if this...","Salads are very good.  I really enjoy the fried chicken salad.  The rest of the menu is a bit overpriced for a quick lunch, but not bad prices for dinner....","This is a hella dope spot in East Harlem. My fav is the Teriyaki Chicken Sandwich with jalapenos ranch dipping sauce. Just about all their sandwiches are...","Ordered food via this app. 90 minutes later food never came, despite email saying food was on its way. Called restaurant and no one picked up. For me or for...","Disclaimer: Poke is my favorite food, and this restaurant is 2 blocks away from my house. I am SO enthusiastic about it. \n\nBut also, the Poke is good, the...","Brand new poke place in Washington Heights. Definitely a great addition. You can select from pre-set bowls or build your own. The ingredients to choose from...","Came here for the first time last week and I was pleased with both the service and the food. I work in the area and it was nice to see something different...","The boba here is delicious. YoSweets has to be one of my favorite boba place without a doubt. The staff is nice and get their job done and overall, the...","I am not impressed with this business. The floors and tables were all filthy. It was pretty busy but only one employee was working so I understand why the...","Mehhhh... my son really enjoyed the ice cream, but the Lady in the shop was very rude and condescending. As a fellow business owner in WAHI this is totally...","My favorite place for a quick bite or delivery when I am feeling lazy, orders are always correct and tasty!\nLove the bubble tea and my usual favorite...","This place has the potential to serve up really good food! The menu choice looks and sounds phenomenal. Unfortunately they need to work a lot on execution...","Let's not go crazy as this is a hole in the wall, take out spot. Despite this, Harmony has made itself a necessity in the neighborhood by providing fresh,...","ordered taro milk tea. made pretty quickly and it tasted like the milk after you eat cereal in it--in a good way obviously. Boba texture was pretty good. i...","I pretty much love every Kung Fu Tea, and I usually stick with my staples at a newly visited location, regular milk tea with boba 30% sugar. Today was no...","So excited that this location finally opened! I usually go to the downtown location one but was shopping at Primark today and realized it was finally...","I was very excited to find out that Kung Fu Tea opened in Kings Plaza. However, it was disappointing, as it took over 15 minutes to get my drink. I ordered...","This place is kinda FUNKY. Beware. Depending on the day of the week, the time, or the staff you have a 60% chance your order will be right. I ordered...","We decided to try this restaurant cause it's been around for years and I've never tried it. I am so sorry we did. \n\nBesides the food being 25 minutes late...","The food was horrible, and it took no effort to serve old shrimp and over cooked broccoli. What a mess!","Pros: Large space. Clean. Quick service. Good prices during lunch hours. Standard, but still delicious, well made sushi. Fresh ingredients (the avocados are...","I ordered delivery. I think the prices are really reasonable which is why I give them three stars. They have specials all day. I believe it's 3 rolls for...","They put pickled jalapeño in the sushi and it tastes fucking horrible. This establishment is terrible.","Came here for a quick snack before facial. They have bento box for lunch and dinner special and it comes with a side, rice with meat sauce, vege and a soup....","Decent place in the area for fries and burgers. It's dark and there's loud music. One wall is covered in post it notes, and high schoolers sometimes hang...","I ordered a popcorn chicken bento box and it seemed pretty average-- nothing special or unique about it. You should aim to get there before 4pm because that...","Fast service and large selection of drinks. Takeout only and cash only. They even have a bunch of juices on top of the regular drinks menu. The bubbles are...","Tried this place several times. I like the names of their drinks, but the drinks didn't taste authentic to me.","Dope bubble tea shop. Nothing out of the ordinary here but it's consistently good and would recommend if you're craving some bubble tea.","This is by far one of the best Yogurt places we have here in Parkslope, Brooklyn. The variety of yogurt flavors as well as the toppings make it all more...","Bubble teas are great and they have a variety of different flavors. They also have natural products for juicing. As well they health wellness is very good....","My girls only want their frozen yogurt from this place. The yogurt taste amazing & they have an assortment of different toppings to choose from. The...","I can't believe I haven't written a review for this place yet, but it's definitely one of my favorites in the area.\n\nLoves:\n+ Your girl needs to get hooked...","Came by Hanco's to order food to go and saw a sign which said that you can get 10% off if you order online so I decided to do that. Once I placed my order,...","I came here for lunch and asked for 2 orders of summer rolls to  go. I've made this same order a couple of times in the past, and both times they put all 4...","The poke bowl is soooooo good! I love that I can choose whatever I like to put in the bowl. The milk tea is also extremely good! I got the honeydew milk...","Ok people I am a happy camper.  My Poke bowl was freakin amazing.  My protein choices were eel and baby octopus fresh melting in my mouth.  It was...","Poke bowls what not to love. \nThis place has a good selection of proteins and a selection of toppings. Nice selection of drinks and desserts like shaved ice...","I really like this place - but not just only for the food.  The food is good, I always get the grilled pork banh mi and the mango juice after the climbing...","This post is only to rate the * Bubble Tea *\n\nI ordered three tea non milk based Bubble Teas, peach with green tea, pineapple with green tea and mango with...","Been here several times the food is fresh and clean totally yummy.  I had the  taco vegan fish dish not spicy.  I love sweet taste of carrots which...","Adorable tea spot right here in Crown Heights!\n\nI stopped in yesterday and got oolong peach bubble tea with hemp milk (nice touch). Girlfriend had the...","This place is delightful. My 12-month old child and I shared the special, and I chose the following: oolong lavender bubble tea, bamboo greens bun &...","I am so siked about this little tea shop! It just opened up and it seems so peaceful and zen. \nThey have a really nice little garden in the back. They have...","- Best Banh mi sandwich I've ever had (favorite is vegetarian chicken). Baguette is perfectly toasted, soft on the inside & crispy outside.\n- Best Bubble...","This place is a last resort, for when there are literally no other restaurants and you're desperately craving Vietnamese food or a bubble tea. \n\nI had the...","Food was gross, nothing was fresh. I came in for lunch today and I regret everything. \n\nIt should have been a dead giveaway that all the accolade stickers...","I wish I could share a picture of my ice cream like the others, but it didn't even last a second! \n\nLet's start out with the place itself.  The store looks...","My friend and I decided to check out Blossom Ice Cream around 8pm on a Tuesday.  We lucked out that we beat a mini crowd so we weren't pressured to pick...","Rolled ice cream but it doesn't stand out in any other way. The toppings added are excessive and overpower the ice cream so you can't even taste it.  I felt...","I came here with friends for a cupholder event and I would not have found out about this wonderful place if it wasn't for that!\n\nThe interior of this place...","This place is such a breath of fresh air - airy, bright and friendly staff.  \n\nThen there's the crepes: a good variety on the menu but if none of those call...","I would avoid. I found a long bone straight hair in my crepe. \n\nI was enjoying my crepe before that. But I certainly can not recommend this place now. \n\nMy...","Really impressed by the numerous (and I mean A LOT) topping options. One of them being kimchi. Kimchi! \n\nAhi tuna and salmon both fresh and delicious, and I...","Decent poke, but there are equally good or even better poke options in the FiDi, including another Poke Green just blocks away.\n\nWith the plethora of poke...","Would never stop by here again. EVER. \n\nRant:\nThe worse poke I've ever had.\n\nOrdered through the allset app\n\nWhen I received my bowl I got stuff that I DID...","Anyone who knows me knows that I love tea so when I saw this place on my way to eat with my sis I had to try it and the tea is so good, real tea and not...","I tried their ice cream and I think their ice cream needs much more improvement. It's not bad but it's not good. The flavor is just not there. It's too...","Not the best drinks and ice cream but the workers were really nice!\n\nI ordered the Rose Black Milk Tea but it didn't taste like rose. The ice cream also...","3.5 rounded up. \n\nThe place was close to where my parents were staying when visiting me so I took my cousins here. I got the brown sugar milk tea and it was...","LOVED THE ROSE MILK TEA! So nice and not terribly sweet! Since it is on my way to the NQRW train from Chinatown, I will be stopping here every chance I get....","There are so many bubble tea places in this area of the city, I really blew it by giving this place my business. The tea was poorly prepared and tasted...","This place is beautiful, I like the design and concept of the decor just the way it is in Taiwan. Like many of the Taiwanese mainstream bubble tea brands,...","Honestly, pretty disappointed. I think every boba shop specializes in certain drinks, and may not be perfectly consistent when making boba, so I don't want...","It's rather ordinary, It's not that good but maybe it's because we order the fruit tea and this store excelles in bubble tea?\n\nAfter all, it's very...","Great bubble tea. \nTrying rose milk tea this time! \nWith red bean and tapioca and Half sugar.  I like it.","The staff is nice. \n\nThe drinks are kind of bland. The teas are not very strong. \n\nWhat surprised me the most was their mango slush contained milk...only...","Doesn't impress me.  Nothing extraordinary from the ordinary.  Excessive fruit embedded for fruit tea.  I requested fresh fruit tea with ice and grass jelly...","Heard about this place because of their alcoholic bubble tea, and I'm so happy to see an establishment like this here in NYC/on the East Coast! \nI had...","Meh nothing special in terms of drink. Got a jasmine milk tea bubble and it tasted like plain milk. And this was without ice! \nDecor is very pretty but...","Friendly staff!! The alcoholic bubble tea was pretty good. I got the peanut loaded freak and my friend got the majestic butterfly. Can't wait to come back...","Very tasty! The bubble tea is made to perfection and the rice balls are delicious.  I try to go there every other week. Staff is very polite. The service is...","I came to Yaya Tea after JapanFes. The decorations were nice and modern, and there was no seating when we first entered, but it eventually cleared up a bit....","**cash only**\n\nGood boba, small and chewy.  Also sells onigiri as their second specialty. Chicken teriyaki wasn't bad.","Great place for tea. I bin here a couple of times and it's always great. I usually get the green tea with cheese foam with 70-50% Suger, depending on how I...","Came here with a group of friends on the spot. No prior expectations on the store. \n\n\nI got the passion fruit watermelon tea, which wasn't on the menu but...","I came back to Mi tea recently and well...\n\nIt's still pretty much the same place. I specifically wanted to come here in order to try the cheese foam. It's...","I was pretty skeptical of this place at first since I've never hear of M Tea before in my life. I did it know what was good or if this was a well known...","Wandered in to get a fruit tea after a hot hot day with M.Y.. She got the four seasons bubble tea and I got the Grapefruit boom smoothie. \n\nTo start, they...","Ok so I came on recommendation of a friend who said this is the new boba joint to check out and that it's amazing. Omg, that's a bold BOLD statement to...","This is one of the best Gong Cha situated in New York's Chinatown.\nTheir staff are welcoming and very efficient.\nThe quality of their drinks are always high...","My first time drinking Gong Cha believe it or not!!!\n\nBaby girl got the strawberry milk slush.\n\nHusband got the mango milk slush.\n\nI got the NEW dirty brown...","tl;dr In terms of flavor, a classic milk tea from Gong Cha is the closest I can find in New York to what you'd get in Taiwan. There's a lot of competition...","Great place for a laidback lunch with a group. Lots of options that are good and relatively affordable. I particularly liked the snow ice dessert--it was...","I want to give this place a 5-star rating, but I can't. We tried ordering from the rotisserie chicken and Mexican food places on 3-separate occasions, and...","- On the expensive side; $15 for chicken tenders is a lot\n- Chicken tenders were tasty, but not $15 tasty...And we didn't even get fries\n- Don't forget to...","Came here on a Sunday early evening and got ourselves a large bubble milk tea. There was no line so we were served right away. The place is small and clean....","I ordered a black milk tea with aloe jelly.\nThe tea was weak, and tasted like sweetened milk water. \nThe aloe bits were huge and had a funny taste. I've had...","Better than every single Boba place in SOHO\nMakes a lot of Boba stores just vanish like a DODO\nMore popular in NYC than f**king POKEMON GO\nCome and get a...","Pros: I always come get my favorite bubble tea drinks, the Taro and Chai Milk Teas, and the tasty avocados toast. Food is always great and I love how many...","If I could give 0 stars, I would. But the food is actually good & the coffee is poppin. So why the poor review? On a rainy Friday afternoon, I walk in to do...","3.5 stars\n\nWas in the neighborhood pretty early and looking for a place to have a quick drink. This place showed up on Yelp. When we arrived, we were...","- Got to try their new bubble tea slush. It was quite interesting!\n- They have a few tables and chairs but expect to take your drink to go \n- Sometimes you...","This place is okay for boba but it's definitely not my go to in NYC. Service was quick but not the friendliest. FYI there's also no bathroom here.\n\nMy...","My friend and I first came across this place because of their buy 1 get 1 promotion, which included a mango green tea (I ordered no sugar) and a regular...","Celebrated Teapsy's 3rd Birthday with the following-\nRose Cheesecake⁣\nPeach Hibiscus Tea ⁣\nLavender Rose Milk Tea⁣\n⁣","I was pretty disappointed here in terms of the flavor of my drink.\n\nI tried the lavender rose milk tea and I don't know why but i just couldn't taste those...","If you want non-powder high quality bubble tea then you've come to the right place. I watch them make my Sakura Milk Tea with bubbles and there was...","Seriously the best rose milk tea anywhere. Better than Prince Tea House in Flushing, better than any other place that offers rose milk tea. I love it...","4/5 because \n\nThe milk tea is really good, not only that, pretty unique tasting\n\nNow, it's not amazing, it actually tasted a lot like Hershey's strawberry...","HighMonster™ here, you know it's your lucky day!!! Let me get straight to the point, HM gave it mad chances, each time leaving disappointed!!! (And sleepier...","Loads of selection, friendly staff, clean restrooms, pleasant to come with friends. I ordered ginger boba tea because it's healthy, but there's also other...","I can't believe this place existed even before I moved to Astoria...anyways, the place is chill and quite spacious (and with wifi), which makes it a nice...","First time at this Vivi Bubble Tea location and I have to say I was not impressed. Four of us walked in looking for bubble tea, and we order around $20...","I went here for the first time because I walk pass everyday to take my daughter to dummer camp. I ordered the steak and cheese quesadilla supreme. It was...","So I been back a couple of times for bubble tea. I always get bubbles or tapioca for my milk tea. Unfortunately sometimes they are undercooked which spoils...","The chicken, whether it be for tacos or chicken teriyaki, is always delicious. Portion sizes are very good and leave you full. My only complaint is that I...","Love the sushi from this place! I always ordered on uber eats and or via phone! One day I decided to walk up the block see this place I have been endlessly...","Eating their zombie chicken and dryer fried rice made me throw up.  Why did I do it to myself!!?","Decent food but omg! One of the employees had her screaming kid there with her making it a very uncomfortable dining experience. The sushi was good and...","Food was great. Congee was worth it. They didn't have bubbles but I ordered bubble tea later that night and the bubbles were hard but the tea was pretty...","Get the fresh made steamed noodles with beef, pork, or dried shrimp, or you can even add an egg if you like. They have light tasty croissants, not like the...","The food here is beautiful. The buns are made to perfection and the price is super cheap! Would definitely recommend trying!","Great place for quality ramen and bao buns! I would recommend coming here with a date or small group.\n\nThe setting is very intimate, all the walls are lined...","I love ramen, so  I try to visit them all. This place was one of them. This place is definitely not memorable, I enjoyed their chicken wings more than the...","Ramen was excellent!\nWe will be back for it ))\nHowever we weren't impressed with buns , I would say money waste ... sorry \nBut everything else is great ,...","Stang Thai opened up in my neighborhood right around a year ago and I have been a regular ever since! The staff is  super knowledgeable about the...","Great food but HORRIBLE SERVICE ESPECIALLY IF YOU'RE ORDERING TO PICK UP. When I placed my order to pick up, I was told to come in 15 minutes. When I...","fantastic food.  idk why so many negative reviews \nthings to get\nkhosi chicken\nbasil fried rice \nvegetable sauteed dish","It's been awhile since I moved from Brooklyn but honestly guys , I can't find any place that can compare to this one. The owner makes THE BEST acai bowls...","I purchased a small smoothie for $6. Not bad at all! I tried the spinach & kale smoothie with mango & pineapples. It was delicious! The place is a bit small...","Definitely will recommend this spot!!! My sister recommended here because she constantly comes here. I was in the area and decided to try it. It was the...","I love Banh Mi Place! I come here all the time. The service is consistently quick and gets you in and out. It's a small place mostly for takeout with three...","I come here for a quick lunch every so often and get the same thing every time: spicy grilled pork bahn mi. It's simple and has everything you're looking...","PURCHASED: Banh Mi ($6.75, see photo) + Beef Pho ($9.75, see photo) \nTOTAL: less than $15\n\nPROS:\n+ Pho: It was okay. THe price is ridiculous. Go to Houston,...","I checked out East Wind today and am so happy that it exists!!!!! Very fun, cute vibe. All the food I tried was outstanding. I shared Juicy Pork Dumplings,...","Cute mom and pop shop, definitely overinflated reviews \n\nMost certainly not the best dumplings. Food was okay. \n\nWhat we got: potstickers, pork dumplings,...","Great new addition to Smith Street. All of the 4 types of dumplings are tasty! That said, I stick mostly to the dumplings (desserts supposed to be great but...","Banhmigos! A pun on bahn mi and amigos but there's nothing Mexican about the food. A quick lunch stop or delivery destination that's stolen my taste buds....","I've ever only gotten takeout from here, but the experience has been an acceptable one.\n\nThe first time I got your traditional toasted banh mi with picked...","Sigh... it's 2019 and yet here we are.\n\nWhen I ordered my food and got my change she put it on the counter. Everyone else that ordered - that wasn't as dark...","Dragged a group of friends that included a boba skeptic here. We loved the sleek all-white decor, the Pratt art exhibit, and, most importantly, the drinks....","Lovely little bubble tea shop with a good variety of flavors and toppings to choose from. You'll probably run into a Pratt student here, we're all very...","Very important to note--\nThey only accept cash or Venmo for the time being. If they've since updated and now accept card, my apologies!","Friendly shop, friendly service, I would definitely recommend the egg waffles and takoyaki, the egg waffles was really crunchy and not too sweet, just same...","It's good bubble tea!!! Looked like a recently opened spot. Strong A/C, important for the hot summer days. And has ~3 tiny tables with like ~8 chairs total...","nice place to go, and it's really close to Pratt\nLove the rice balls and coconut milk tea\nWaffle is also really good","Very Clean!! Excellent and helpful staff.  My new go to place. Just Yummy!","I love a now and again açaí bowl -- especially on the first 70degree day of the season. Since I had yet to try my neighborhood Jupioca, I decided to give it...","Worker was flossing and coughing in the middle of the place. See video! She wasn't directly making my drink but it's inappropriate in general and possibly...","I've been going to Henry's occasionally for some time, and they always have a good Vietnamese sandwich for me. This time, I got the Grilled Pork Banh and a...","Henry's is one of my go-to lunch spots in the neighborhood. I love the beef pho and the grilled chicken ban-mi spicy. If you are looking for an appetizer,...","Henry's has been my \"Go To\" for quick, delicious and reasonably priced Ban Mi and Rice Dishes. Amazing service served by super nice people! \nLove these...","This place is really really good omg. I was on my way traveling to New England and had to make a bit stop to grab some friends in Brooklyn. Of course they...","I hate giving bad reviews but we were very disappointed with the food and bubble tea. I want to assume that maybe it was just late and that their onigiri...","This place is next door to Smashburger, which is my to go place! Decided to give this new place a try yesterday since I was craving something aside from a...","This place is really nice. You can either unwind here, getting, for example, a beverage and lounging at a table in the front or back, or you can get wound...","Really cute cafe with a huge selection of board games!! Kept the kids entertained and away from their phones :)\n\nGood drinks too! Loved the Assam lychee tea...","Open late and in an easy to get to area, this cafe was really needed for everyone who would like to go out at night but prefers tea/coffee to alcohol. They...","Top notch Asian food and coffee in Clinton Hill. Simple and stylish decor. Excellent coffee. Try the lemongrass chicken dumplings and the noodles are...","I'm a little late in posting but here it goes. So after having a few tacos around the corner with friends, I was in the mood for some dessert and the...","Wow... from the appearance of this place you would think they would invest some time and effort on the quality and taste of their food but what a mistake I...","I've been searching for comparable Thai food in Brooklyn given I miss my favorite Harlem spot. I actually thought this was a restaurant I had once years ago...","I would have never noticed this place to be a Thai restaurant or even a restaurant at all for that matter had I not discovered it via Yelp and I pass it...","Come here for lunch while attending a training class. Was clueless as to \"what I wanted for lunch\". Almost missed this spot, because there wasn't a bright...","Look at all these fries you guys, perfect Boba companion! Hipster Joint AF! I loved it. \n\nWake Up Matcha\nDirty Boba Milk \n\n Cajun Fries \nTaro Sweet Potato...","Boba AND fries? Who can resist?!? \nGot the dragonfruit and strawberry puree drink with some passionfruit popping bubbles and lemon pepper fries. The fries...","Came here pretty excited cause I love bubble tea and love fries -- who doesn't right??\n\nPlace looks pretty nice and clean. They've got a neon sign for the...","B ,\nM\nWss swax X\n.s\n....s.s.ss\n.s.sX. s. Sdcc..ss..s.s.s..s.s ....\ns\nS\nS\nS6\n\nVvvbS\nS\ns\nS\nSao\nss\n\nS\nS\nS\ns.s\nEwssesz","A month ago, I had no idea what onigiri was, and now I can't go a week without one. This is a tasty little rice ball similar to hand rolls filled with a...","Being in Cobble Hill these days can be a bit depressing when you see all the empty storefronts on Smith and Court. Businesses seem to be closing left and...","Tried 2 drinks so far (Green Tea Lychee & Mint Lemonade Tea). Both were good. Not overly sweet. Right amount of tea. \n\nAlso, I love that they put...","I didn't think I needed nitro bubble tea in my life, but now I know it can be delicious. And the owner was very enthusiastic to share his creations. The...","This is a relatively new business in the area that opened only a few weeks ago. I went during the soft open and had a mango slush and lychee green tea, both...","The Wei is amazing and more people need to go. Period. It's probably one of the best fast casual \"make your own bowl\" places out there and their portions...","When I first ate here, I thought that it is the Chipotle of chinese food. Similar idea of ordering. I liked the Wei because it was conveniently located...","I actually liked The Wei but idk Im not to hype of about this place anymore. Its good fast food  thats very flavorful. They do have a make your own bowl...","Best bubble tea ever. Period. Best bubble tea in New York. My side gig is trying bubble tea places so believe that","I came here since I was craving bubble tea.  The place is a bit hard to find since it's in a mini mall.  I've been to many Coco Tea locations in Manhattan...","Definitely a great place to come and chill out as well as beat the summer heat! When we came in, we noticed there were only about 5 seats in Coco - but most...","omg so good. excellent service too. sometimes acai smoothies can taste almost bland but this one was tart & sweet. i loved it so much. will come back again.","I had an amazing Acai bowl from here. It was so fresh and filling. The shop is so tiny with no seating, but totally worth visiting. I got the peanut butter...","The coffee is OK but the guys are not the most sympathetic. However it seems to be a pretty cool smoothie place.","I would highly recommend Kitsby to all my friends! The cream puffs were amazing, not too sweet. I have the cream puff sampler, forbidden fruit, and the...","Finally got to try these unique, delicious desserts that were a perfect combo and reflection of my Asian American identity. I was so interested in trying...","I've been really excited to try this place out, having read all the great reviews. However, I honestly don't know what went wrong today. The whole...","I asked one of the many server girls that I love, here, on a date. But then I found out how old she is, or isn't, I should say. So we had to cancel. So it's...","Stopped by at this location for the first time this year to give it another try. I ordered the Rose hip milk tea and my boyfriend ordered the winter melon...","It seems a little unprepared when a boba store runs out of boba before 2 pm! I was also not a big fan of the customer service. Some of the workers seemed...","Amazing boba!!! Lady is super nice and accepts Venmo. Also cute neighborhood:) will be back","Cute little spot with a lot of different bubble tea options than what I'm used to. It's like milk tea with tapioca pearls is the last thing you'd want to...","Came here while waiting for a seat a restaurant nearby! There was only one person working in the store and he was responsible for taking orders and making...","Hey listen up as I flow like OriNOCO\nIf you got 3 wives you better move to PROVO\nIf your wife interferes then you better call her YOKO\nIf you're Pikachu,...","Coco is one of my favorite bubble tea shops in the US. That being said, even though we were in a rush, we passed this location on the way to Xin Wong BBQ...","Stopped in and saw they had a selection of lemon drinks. Tried the lemon green tea. It was good, but probably wouldn't get it again. Seemed like they used...","I came in for a hot tea and man is it good. Honey green tea made like expresso or something like it. Cute place.","First off, their Yelp says they close at 9:30 but we walked by at 9:45 they were still open and said they close at 10? \n\nIt was the end of the night so they...","The boba here is decent. I mean, it's a franchise store so it can't be that bad. \n\nHowever, the service here is bad. I walked in and greeted the cashier,...","Absolutely the best - smoothies. juices, bowls, whatever you get!! All fresh fruit   Haven't had anything that wasn't great but Also the service is awesome...","Went here with a friend to grab an acai bowl on a Friday morning. The place is very small, but there wasn't too much of a crowd there.\n\nIt took about 10...","This place serves really good smoothies and bubble teas. I like the option where u can even make your own smoothie. The place is small but well designed and...","I had the peach matisse here and it was so delicious! Perfect for a hot summer day. \n\nDrink: not too sweet, not too sour. Honestly just right with a mixture...","Bookmarked this place for the longest time after seeing ads on Instagram and when I finally got to try their drinks, I was disappointed. \n\n+ drinks were...","Small but lovely art-themed spot for tea. The cups are beautiful! I wonder if they could make re-useable ones for customers who want theirs to stay. \n\nI...","First came here maybe a year ago after reading so many positive Yelp reviews. I lived in the area so I decided to try it out. I'm from California so I am...","Greatest smoothies ever! I always get the Kale Shopper without pineapple & some healthy, cooling fixings. The açaí bowls always look so beautiful but I...","So if someone just cooked your goose\nAnd then slipped on, then tightened your noose\nI'll help you get away\nAnd then later today\nWe'll get Acai from Vitality...","New Orleans just rebuilt the Levee\nAnd on PoGo I evolved an Eevee\nBut when I'm in Manhattan\nAnd I want to get fattened\nI get Brown Sugar Milk Tea at...","Kinda dirty. $7 credit card minimum. I ordered a rice ball with my drink to meet the minimum and they didn't even start making it until 10 minutes after I...","I'm not a big fan of bubble tea or sugary drinks but I needed some cold drinks to quench the thirst. \n\nVivi is a chain which can be seen in many places....","This is a new hole in the wall tea place next to Baruch connected to a small Chinese restaurant. The door is a bit difficult to use also. I got a rose...","Low quality for typical $5+ drink. I got the peach slush drink thinking there will be actual fruit and/or tea of some sort. I watch the worker make the...","This hole in the wall (literally), makes a nice smooth rose ice tea with lychee jelly. Also much more affordable than the other bubble tea spots in the...","Apparently I've forgotten to check in a bunch because I should be the duchess for the amount of times I come here. I love Kung Fu Tea! I've done the rounds...","Love this place since they decided to combine with TKK chicken. This Kung Fu Tea is pretty close to my work so I come here pretty frequently to grab a...","This is not your normal Kung Fu Tea location.\n\n- They share space with another restaurant \n- There's happy hour\n- There's plenty of seating\n- If you're ever...","There aren't a lot of bubble tea places in the midtown area but I'm happy there's a Gong Cha here. I usually go into the store to order a regular black milk...","Service is fine and deserves all 3 stars. I'm giving nil to the flavor of my drink so this review is based solely on my hot taro milk tea. The problem with...","Variety: Absolutely every flavor you can imagine. Overwhelmed, and I didn't even care. I had no idea what all of the different items on the menu were, and...","Note: The first half of this review focuses on an issue I had with GrubHub, but if you continue reading, you'll find it is totally relevant to my review of...","Note this place is just to pick up drinks. I thought there might be some sitting room, but alas there was not. My friend ordered a head of time on ritual so...","It's a hole in the wall but they do have very good selection of milk tea, milk shake and fruit tea. The fruit tea are made from fresh fruit and they cut the...","A pretty decent pop up stand if you're looking for a quick snack at a premium price. I got 2 baos, both peking duck baos which happened to be a seasonal...","Wanted to enjoy bao by kaya more but was a bit disappointed! I went with the combo 1 for dinner on a weeknight in urban space. Chose the duck and pork bao...","We came here once a week. It has the best choices of food selection in the food hall in my opinion. The food is most of the time decent. And I have to say...","I love KFT, especially the Lemon Black Tea. So much so that I often start rapping while sipping. I call it Rasping, or Srirapcha.\n\nLike Britney and Tinache,...","This Kung Fu Tea spot is not the best but definitely not the worst. It's located in Gallery 32 so it's expected to be crowded and chaotic most of the time,...","This is by far the busiest Kung Fu Tea I've been to but it's also one of my favorites. Despite the long line to order, they make the drinks quickly and the...","Cute spot to hangout with some friends. The service was great and patient when we were ordering. \n\nI ordered the Rose Bubble Tea. You can really taste the...","Had this saved in my bookmarks and I was finally in the area so decided to check it out.\n\nGot a spicy tuna onigiri and black sesame soft serve. They...","CATFISH LEVEL: 2/5: Looks good, tastes great\n\nCame here to try it since it's such a convenient location at Bryant Park. I got the matcha and sesame ice...","I love my earl grey tea.  It was more expensive than the average tea spot, but I understand the reason.  Each cup of tea is made fresh.  You can tell by the...","I did not like their signature taro milk unfortunately. I was really excited to come here with family but the texture was so gritty, and it felt like I was...","Before the bubble tea craze spreaded all over the borough, Tea and Milk was practically the only boba game in Astoria. And still today, they remain one of...","This place is great for some poke to go. Came here many times when it first opened and was hooked for a while! You can also order in advance and pick up at...","I eat a lot of poke. A LOT. To the point that my blood probably contains more mercury than red blood cells (which might explain my shiny silver Tin Man...","Ordered bubble tea, I can't tell if I'm drinking $6 syrup or bubble milk tea. Is there even milk and tea in it? \nI don't know if it's my mistake or I just...","With new bubble tea shops that are supposedly \"hyped in Asia\" opening every other week, it's hard to find a place that hasn't been overhyped and won't cost...","I don't usually like boba that much but I love Shiny Tea!! Their drinks and ingredients always taste fresh. I love how their tapioca pearls are soft and...","This hidden treasure of bubble tea is a great gem for the UWS (sorely lacking in some good boba). \n\nIt's a grab and go shop - perfect for a good weather...","Great quality gourmet style Asian cuisine no msg if you need to be concerned with your health or diet this is an excellent place to order your food. The...","The dumplings here were DELICIOUS I specifically got fried pork dumplings and I loved them. Probably one of the best dumplings i've had in a good while. The...","It's good Chinese food from the hood. Nothing out of the ordinary but still very filling. Nothing off the list really stands out from all the other Chinese...","Love everything .. have different things to choose from . Everything is awesome can't complain","I'm absolutely in love with banh mi sandwiches! Lol. It's kinda becoming an addiction at this point which is so bad. They're so good tho! Omg! \n\nI ventured...","I ordered the Shrimp Rolls with Vermicelli and the Short Rib Salad. The Shrimp rolls were good and tasted fresh. The peanut sauce that accompanied it wasn't...","The grilled pork banh mi here is nothing short of delectable. The pork is so flavorful and flavor is further brought out by the pickled vegetables, all on...","I got the almond bubble milk tea and it tasted delicious! I'm never disappointed when I go here.","Ordered delivery from here. I have to say this restaurant gets very specific about how much ice/sugar you would like in your drink. Customizable, cool-...","Limited boba joints here in Times square but this place hits right the spot for your boba cravings. We came 30 minutes before closing expecting it to close...","This place is amazing and SO reasonably priced. I love that the crepes are a little thicker and softer. That's my personal preference but it also makes a...","Horrible customer service!!! That's the first thing I surely noticed beside the blah decor. Upon entering the young man at the register didn't greet nor did...","I remember the first time i came into the place & tried a Crepe for the first time! I got a s'mores crepe that comes with Coffee Ice cream flavor & it was...","The customer service is great, and the food is actually good. Literally the only place to get kosher pho, and it was honestly pretty authentic...","First time ordering from this place. I was super hungry and have heard great things! Received confirmation that my card was charged and the order would...","The concept of Pho-Men is genius! I am obsessed so with this place - the ramen is actually insanely delicious. My go to order is always the garlic goma...","Great place to go a experience the wonderful ice cream rolls. And it's open late night when you in the crave late","Food allergy warning!\n\nI've gone with my family a few times here with no problem. I decided to grab a smoothie before heading to work, and I will never be...","All items are great, smoothies, ice cream, teas and coffee.  Right by the train, so many great fresh options. Truly worth going to for a refresh.","It's about time I give some love to my favorite local cafe! I come here a few times a week to get work done in their spacious shop. Their draft lattes are...","This review was for their special Kamayan dinner. \n\nIf you weren't here, you surely surely missed out. I cannot tell you how much food was served - as far...","The Buren is a coffee shop by day and a bar by night. It has fancy cold brew and pastries, craft beer and cocktails, and a bench swing by the window. It is...","I came here a while ago. The owner is very friendly. They have a good selection of food as well as bubble tea (different flavors like blueberry/cantaloupe)....","I ordered Veggie Pho, seaweed salad, veggie pancakes and bahn mi on Seamless. The driver messed up our order so it went to someone else's house first. The...","I came in her expecting one thing, but my expectations were misled. Wth!!\n\nI was excited to see more asian restaurants popping up in Bushwick so I thought...","Great bahn mi.\n\nI ordered the cold cut bahn mi.\n\nThe bread was soft on the inside but just crusty enough on the outside.\n\nInside the sandwich were a ton of...","You can totally miss this place is you're not looking for it. No awning, barely a store sign. Maybe a total of 6 seats inside, 2 small tables and 2 bar...","Nam Nam is a pretty unassuming small restaurant on the side of the street but damn these banh mis are so delicious. I came here after a suggestion from my...","Tucked away in a super residential part of Williamsburg. Drop by between 11am and 4pm if you want to experience the most amazing Japanese snacks you've ever...","A true hidden gem. They just hit their one year anniversary and I wish them many more years of success! If you are in the neighborhood, and want a snack to...","Ohhhh I  this little tiny shop of gourmet Japanese food and little trinkets. Ukiko is very very sweet and the Match was perfect. If you live near this place...","Good place. \nBest poke. Best ice cream\nIf you come to this place. You won't regret","Wow.   Fresh poke and Friendliest people. \nMust try their bubble Thai ice tea.    Great find !\nThe Rolled ice cream \"out of this world\" watching them make...","Love this place!\n\nThe poke was amazing! I made my own bowl and the staff member was happy to point me in the right direction. Here is my recipe :)\n\nBase -...","Found new bubble tea place in my neighborhood. \n\nCheese cream on top of fresh fruit based drink is pretty good! \n\nI had black grape with lychee jelly and...","A casual asian cafe spot for those who would like a quiet atmosphere! What I love about Astoria is nothing seems to be too crowded no matter how big or...","I would give 3.5 stars but I can't.\nWe walked in and the girl at the counter wasn't particularly friendly or anything. \nI said I wanted a lot of boba but...","I came across this awesome place as I was walking by a very hot day. I tried the peach tea which was very refreshing and tasty.They have a really cool...","I usually would come here when I was working in the neighborhood.  The drinks and snacks are really good here. I usually would get the jasmine green tea or...","I was happy to see that a familiar bubble tea chain made their way to Astoria, but the consistency of the drinks made at this Vivi location doesn't align...","Today was my first time trying a Acai Bowl. I got the Almond Butter Acai Bowl which came out to $11.42 including tax. It came with bananas, strawberries, a...","Waiting around in the area on a Friday evening, stopped by here as there was no line to order. Bright spot with some seating inside if you wish to...","The staff here is very friendly! Very fast service and clean store. When they weren't helping customers they were cleaning the back. \n\nIt's 100% juice with...","I came here once last year. I loved the place.\nQuiet peaceful. Everything looks clean, minimalist and cute. Great place to come and have a nice peaceful...","Came here today while doing my rounds in Astoria, very much enjoyed the stop-off. The cafe was in a quieter part of Astoria, first impressions when I walked...","Really nice and clean Cafe! They have fast WiFi and a lovely back patio area. The person at the counter was really polite and made some great...","I HAD AN AMAZING EXPERIENCE HERE.\n\nI hosted my sister's bridal shower here today! It was a party of 17 people and we basically booked out the back half of...","When I went w a friend on a friday night, the place was like a ghost town. Not sure why it was empty but anyhow that has no relevance in describing the food...","This is a FABULOUS neighborhood spot. The setting is open, bright and comfortable, the food is delicious and the tea selection is as good as Fortnum and...","You won't find a lot of places in New York that will give you this much sushi for a low price. 3 rolls are $10.80 (you get to choose from an extensive...","This place was great! The only thing I didn't like was there were only 2 tables. Weird, I left a review of this but I think it might have been taken down by...","This place is such a bargain! \n\nIt's basic sushi and sashimi, 3 rolls for $10 ~ you can't beat that and, it's good too! I can usually get two meals out of...","Ordered from here last night as I was looking for Chinese food spots in UES. I went with chicken and broccoli and brown rice. Chicken and Broccoli was...","This is based on one order---and entree---but all the years I've been going to theater on 42nd Street, I've never tried Ollie's, and based on this meal I'm...","I wanted some quick and tasty Chinese food that would be consistent with their other locations but I thought the food was ok. \n\nThe 3 roasted meat combo was...","What I enjoy about Emack and Bolio's is the insane amount of flavors to choose from. They don't appear overly exotic which makes me more inclined to try...","Yummy \nIce cream is good \nThey have a great cone selections \nYou could make it as creative as you want \nYou can have it in a shake form \n\nIt's a little shop...","Been here twice. Let's just say this icecream is poppin. Talking about rare & unusual flavors & combos.. Love it. Even though it hasn't failed me or my...","I love Prince Tea House! I usually go to their Flushing location but tried out this location a few months ago.\n\nI got the Honey Toast and Green Tea crepe...","Had a pretty bad experience. Waited to be seated which is fine, but we were still waiting 15 minutes after several tables were cleared. We knew this because...","This was a cute little cafe. that is so pretty when you enter. The ambiance was very fresh and clean. There were plants everywhere, in cute matching pots....","Good quality fish rolls for an incredibly cheap price! I  had a salmon combo box which includes 1 maki roll, 1 spciy salmon roll and 4 sushi or sashimi. The...","Quality grade sushi, and with generous portions. The only downside to this affordably tasty establishment is that there are only 2 tables. I say pack these...","I love Sashimi Express II! Unlike the other Sashimi Ramen Express (which is closer to the original Sashimi Express location), this shop maintained their...","Dropped by here for a quick lunch after an appointment at Mt Sinai a block away. They have a lunch special everyday from 11:30-4 that's an absolute steal...","Love this place. Offers dishes you don't typically see at most Thai restaurants. The Seafood Hor Mhok is my favorite. Tons of big chunks of assorted fresh...","Pretty decent Thai on the UES.  I have only gotten delivery but the food is solid and the prices are very reasonable - most entrees are around $10-14 MAX....","Great experience! Met up with a good friend of mine at this local Upper East Side joint and had both a great meal. \nWe ordered  both the summer roll and the...","Fact: this place is always hustlin' and bustlin'. I've been here for both lunch and dinner on weekdays and weekends and it's always busy! That's a good...","A total staple. I go maybe twice to three times per week. Die hard favorites in order of preference include the bo luc lac, bun xao with pork belly, Thai...","First time trying Makana and i have to say i was pleasantly surprised. I got the BBQ Chicken Plate and it was delicious. I could've done without the canned...","JUMA, A man with a beautiful African accent, just saved this from being a 1 star review! He really delivered on the customer service when others were...","Update: I'm really disappointed with the quality drop Iv seen here over the last few months. \nI ordered 3 meals essentially tonight.\nLate lunch of two bbq...","I tried bubble tea here before...I don't recall the flavor but it was a purple drink with popping bubbles. I prefer the bubbles that don't pop.. But it was...","A really small slice of modern has popped up right here in Soundview!!! Ok......so maybe it's not all that 'modern'- but it is different for the...","I love the bubble tea and a great chicken & waffle place. It's a clean place, the workers a friendly. It's a bit small but most people don't sit to eat anyway","Love this place! Have ordered takeout from here multiple times and I almost always get the beef with stir fry veggies and medium spiciness and then change...","Got delivery from here and we did want to try the handpulled noodles, even against their advice, and the noodled clumped together. But that was our fault...","As I write this .. purely based on the fact that we drove 35 minutes accross town to try this place to walk up to find them closing down over 1.5 hours...","Wow I wish I would've known about this place earlier it's very good. It's really hard to find good homemade food from diners in the Bronx. \nI Just to let ya...","I like this place very mellow place to have breakfast ,the only thing it gets pack to be patient for your service they only have one waiter but very cool...","Perry's! Interesting little gem in the heart of..... uh, the South Bronx. Well, the gentrification train is pulling in chock full of white people and as...","Makana has become my go to place in the heights. I love their Ahi Tuna poke bowl. Highly recommend it! Check out their tacos. They are sooo good. Great...","This is one of my go-to take out places. Delivery is always on time and even earlier than estimated. They have a great lunch deal that runs until 3 pm every...","I was ecstatic to find a restaurant serving great Hawaiian food in Washington Heights, but was disappointed by the quality here. Chicken Katsu was super dry...","Adorable cafe! I happened to find this cafe due to it being right around the corner from my gym. What a little gem! It's so cozy and cute in here. I can't...","Finding myself in Washington Heights due to a necessary errand, I visited Caffe Bene since the weather was blustery, snowy and cold.  A hot beverage came to...","I walk in to great service, and order myself a chai tea latte. This place reminded me of a Starbucks/Paris Baugette in one. They have an are where you can...","FOOD: Decent Thai food with good spice and flavor. Meat to noodle ratio was balanced with not over empowering sauce flavor. Drinks were definitely strong at...","Definitely not my favorite Thai place in the area. Their prices are higher than surrounding Thai places for the same dishes, especially the lunch specials....","The place looks ok, they definitely tried to make it look modern and have interesting decor but it is unkept and the restrooms look like they are from a...","I can only review the juice bar since I literally JUST found this little neighborhood gem by chance during a walk/run with my daughter the other day. We...","Ok not all that ordered passion fruit green tea with jelly wasnt as good as ku fu tea","The food was a little pricey but it was very good, I'd order again, it's not easy getting quality Chinese food uptown in the heights . Perhaps I'll pick it...","Yuck absolutely awful\nMango bubble tea served straight from a box with soggy bubbles and a huge ice cube\nThe vegan \"meats\" taste horrific and does not...","I've only ordered from here once, but I wasn't disappointed at all. I placed my order later on a rainy Friday night and planned on it taking a while to be...","Nice local place. Great bubble tea. The people who work there are very nice, always prompt, friendly and courteous. My daughter and I were in this evening...","I rarely review restaurants, either bad or good.\nMy \"order\" showed up over an hour late. It was missing ingredients in the order along with 2 large...","Out of the soup I ordered. Completely unapologetic. Took an hour and 30 minutes for them to deliver me entirely the wrong order. I called and they were...","This place is amazing. Order a bowl it's so good. Matter fact order anything. You will love it","If you're a bubble tea addict like I am, you will appreciate Mr. Green. There is still room for improvement in the taste and quality departments, for bubble...","The place is amazing. I got taro bubble tea medium and it was freaking expensive for some reason​. Medium size bubble tea is​ usually $4 and some cents but...","Great Korean Fried Chicken! Skin is crisped perfectly, good batter, all of the 3 sauces are perfect, wings' size is large.\n \nI believe the Family deal is...","Very quick delivery and reasonable prices. We ordered:\n\nChicken sandwich with fries\nHoney Soy Chicken Tenders\nPlain Drumsticks\n\nThe honey soy tenders were...","Friendly and quick service.\nWings were the best especially the spicy one.\nThe sweet honey soy wings was a tad too sweet to my taste. (My own opinion)\nBut...","I'm soooo happy that another bubble tea place opened in Forest Hills. I was getting tired of Kung Fu Tea and I honestly like the bbt at Mi Tea so much...","My daughter and I stopped by this place to try out their teas. I had the cheese foam peach tea and she had the black milk bubble tea. We also ordered a...","I pass by this location on my way to the subway. If you're not looking to the right you might miss it. When you walk in there is a seating area to the left...","Great quaint atmosphere. Its the perfect little place to sit and have tea, coffee or my favorite, fried ice cream (when its in season)! They also have the...","Whether you're from Alaska or Alabama\nWhether you're a cop or just got out the slammer\nWhether you like Arnie or you're a Jean Claude Van Dammer\nThe best...","A comfortable, all around solid coffee shop, but the name may hide the fact that actually serve some food such as Pho, Bahn Mi and dumplings along with the...","This froyo spot is the Tardis of dessert places.  Why?  Because not only can you get great frozen yogurt, with fresh toppings as opposed to the usual stuff...","I get their poké bowls all the time. They're fast about it and the food is always fresh and delicious. The staff are also super friendly. The fruit...","This is the best place to get frozen yogurt. It is super clean and organized, making it perfect for a treat on a hot day. They have tons of flavors, all...","This location has a limited menu as opposed to their other location in Jackson heights but still good. Prices are slightly cheaper than their sister...","We walked in 1 hour to closing and it was pretty full. We waited for about 15 minutes before taking our order. We watched as different people ordered...","Crepes are great. But service was awful. I ordered boba milk tea and he gave me without boba. I asked him that I ordered with boba and he said \"what? We...","I liked this place so much I went three times this week. It's a chain from Taiwan. I wanted to try their red bean but it's being shipped from taiwan so I'll...","Not the most conveniently located, but came here to try the oolong black milk tea with pudding and tapioca.\nIt blows my mind that bubble tea used to be...","I finally made it to Chun Yang... but before I made the visit, I asked them on Instagram what was their most popular drink. They responded the honey lemon...","Tiger SUGAR! - Waited in line for a while (and after getting tricked by the copycat Tiger TEA) but it is definitely worth the wait. \n\nGet the signature...","As always, the drink is amazing! Chewy boba and pearls with a creamy and toasty brown sugar flavour -- best way to end the day. I came back to New York City...","The hype is REAL! Okay well not really for the amount of time you have to spend waiting on line but it's defiantly tasty. I just find it kind of surprising...","Got some of the OG dumps with edamame and also some of the Japanese fried chicken.\n\nIt's pretty good. The dumps aren't like how momma makes em in which case...","The staff here are so friendly and provide such quick service! It's a great place to grab a variety of dumplings that you wouldn't normally find in typical...","Came here based on the solid reviews. We had dumplings as well as two ramen orders.  I can honestly say this was the worst ramen i've had in all of NY. Type...","These prices for these thin ass watered down pretzels are terrible dusting powder on them does not make it fucking taste better ...so I'm from Pennsylvania...","The Pretzel Twister is a great addition to the ever growing Myrtle Avenue! A gem for sure since there isn't a store like it in the immediate area.\n\nCame...",". \nGreat pretzels and a great price. The place is very clean and everything is made fresh right in front of you.","We love this place! Seriously one of the best deals in the neighborhood. Scratches every sushi-craving you have. Dining in is a cute experience in the super...","My new go-to sushi spot when I'm working from home!\nJust moved into this area and was looking for a good sushi place. Definitely found the one. Generous...","This is my go to spot. Food is awesome, well priced and service is exceptional. Get the spring rolls with tempura sweet potato sushi","Great hidden gem of a place. Although it's right on the corner of a busy intersection the place always seems rather low key. As all the menu and posters...","I was working in the area this past Thursday. I stopped by and ordered scallion pancakes, chicken dumplings and a large honeydew milk tea. The dumplings...","So happy I stumbled upon Fansway Teriyaki Kitchen. My partner and I were walking to a different restaurant one day and we've passed by this place so much we...","Unique Chinese bakery offering all kinds of fresh, sweet and savory baked goods that is purely eye candy Every time you walk in, fresh smell of butter and a...","A welcome addition to the busy 61st Street's cluster of businesses near the subway. Over the years Woodside has largely been Irish and Korean, but the...","They're at a convenient spot , right next to the train station . If I am not rushing to catch my train , I tend to stop here to buy breakfast. They have...","Wow Avenue Coffee House. Great impression! \nMy friend ordered White Mustache. At the first, i was wondering why they call it \"white mustache\" and you will...","My hunt for the best bagels in Sunnyside in the post-Dave's era (tho even that wasn't the best I've had in NY) continues:\n\nSo most people are probably not...","A lovely place in Sunnyside. Quiet, clean, good location with peaceful view by the window, and a rich menu of beverages. I liked the sweetened ice coffee...","This is the most amazing momo and chow mein I've probably ever had in the United States. We usually drive in from far at least once a month. Their boba tea...","The best momo in NY. I have tried different momo's all around NY and this one is the best. The jhol momo is simply amazing. The sauce is very tasty too. The...","When your Nepali friends tell you this is the best place for momos in the country- sit up and LISTEN! Super fresh and delicious momos. We ate to the point...","This is a small and great to go place to eat and drink tea and the Yogurt orange is very great","They have the best Slush and  Bubble Tea  in NY !\nWe come here all the way from Astoria just to get our bubble tea fix !","Great service, great drinks of al variety. An outstanding variety of ingredients for a small store. They are very fast as well. There's always something...","Wonderful cafe in Woodside with excellent coffee and croissants. \n\nBut wait there's more! They also have strong wifi, friendly staff members, and good...","Cute cafe with peaceful vibe. It's well lit and the decor gives you a sense of peace and happiness. The latte was good. Customer service friendly. The cafe...","I came here the other day with my family. And it's a cute little cafe nestled in woodside. The workers were extremely friendly and very kind. The place...","I'm cuckoo for Coco Milk Tea. Until I tried Coco I had always produced my own milk, and that was working out for me. Then my life changed. And my underwear...","Used to be good, now the prices have soared and the sizes made smaller. It seems like they've made their cups more narrow, so it's as tall as a large but...","If you absolutely must bubble tea, do Coco.\n\nCoco is fast.  They are dam fast.  But just because they are fast, doesn't mean they are great.  The drinks...","My favorite thing here is the banana and chocolate boba.  I think the best thing about the boba here is that they have various flavors and the balls are...","I would rate Tea Cup Cafe four and a half stars. \n\nI ordered the fish tom yum. This soup is the Thai version of a Japanese ramen or a Vietnamese pho. The...","I love this place so much! Yummy food for a fair price and the toast they sell is to die for!! It is an absolute must try. \n\nThe location is also super...","Some acquaintances had tagged this place on Instagram and it was down the street from Jollibee, so we decided to check it out. We were in for such a treat....","My husband and I came here for their halo halo dessert, but also delighted in getting a free mini cupcake by checking in on Yelp. The halo halo dessert...","I had high expectations but was very disappointed. \n\nIt doesnt have an AC, so it is hot inside the store. The decor is simple which is not bad, but you can...","A taste of Taiwan in Flushing - I've tried both Tiger and Yi Fang and they're comparable.\n\nService is fast and the ingredients are fresh. The milk they use...","I tried the brown sugar oolong latte tea and I had to throw it out. I love bubble tea and all types of teas but this was terrible. Something about it was...","I have been going here every single time I visit Flushing. I have NOT tried Tiger Sugar which is their newest competitor for the brown sugar pearl milk tea....","I got the berry party with no sugar but it was still way too sweet, which had nothing to do with the lychee jelly I got. I recommend reducing the sweetner...","Came here on a rainy night to get my bubble tea fix. After staring at the menu for a while I decided on the hojicha drink which I've never tried before.\nI...","Cute little bubble tea place in Jackson Heights. Server was nice and got our drinks made fast. Ordered the passion fruit and mango slush while my daughter...","Come to mama, my sweet delicious crepes! Yogurt La Crepe is a one stop shop from the salad bar, to the froyo, to the crepes. SO GOOD!\n\nI had the Nutella...","Review update: \n\nLiterally just left here as write this. This is the 3rd time I've been here in the last week and a half and barley any of the machines...","This is the best frozen yougurt place i had ever been to!\ntheir taro and cake battar flavour was amazing.They have most topping i nver seen to any yogurt...","This is such a cute cafe! It's kind of a hidden gem because it's a couple mins away from the subway. \nThe interior is so cute with the rose wall! Can take...","The place is very beautiful and definitely a great  environment to come back to for chit chats or even some studying. \n\nI have only tried two of their...","The ambiance is beautiful here! It's a spacious spot. I feel like it would be great for studying, working, or hanging out with friends. It's a very cutesy...","Möge tee is definitely my best favorite boba shop after comparing other two brown sugar store. \nI used to drink it without shaking, so you can taste...","Glad to update that Moge Tee is my new favorite tea shop in lower Manhattan! I've come back again and again the past few months because their cheese foam is...","We got two drinks - purple yam and a normal bubble tea.\nBoth are delicious! The only thing was we couldn't adjust the sweetness of the purple yam milk drink...","Best place.. it's clean wonderful staff and delicious stuff.. moderate price woth best quality.. highly recommended","This place taste like pure wonders best fresh icecream I've ever had . They also have bubble tea too, great as a cold simmer drink and this place is super cheap","I've been here many times.  The last time I took my family we saw roaches walking all over the toppings and killed a few on the floor while we were just...","Tsaôcaa (朝茶), a new arrival to Downtown Flushing, is yet another bubble tea place. Tsaôcaa's differentiation seems to be the shop itself. The shop is...","Found this new store opened in the block, decided to give it a try. The store decor is quite nice. However, the soul of the store turned out to be a...","Let me start off by saying yes, I got the likes from Instagram (38+) and was able to get this drink free. \n\nThe place is really spacious I think for a boba...","This local restaurant really surprised me. The service was amazing, our waiter was super friendly. He explained the menu and made really good suggestions....","Maybe I had an off dish, but the pork and the quiche was a bit sour, tasted like the meat was old.  I know the taste, if you leave marinated meat in the...","We were in the area and looking for a quick lunch knowing we would be having a big dinner that night. Looked on Yelp and discovered Com Tam Ninh Kieu. It...","Great Chinese food. Higher quality product for a cheaper price. Picture panda Express if they had higher quality meat. If you are headed to the brox zoo...","I've been passing this place for a little over two years now. I've always seen people coming out with their bubble teas. I've peaked inside and see people...","Food was okay... the rice feels kinda old. Idky.. it might be the way that is being cooked or they are using left over rice.. Bourbon chicken tasted good .....","The natural juices and the bubble tea are really good from this location. I normally get regular bubble tea or mango smoothie. It hits!!!\n\nI've never had...","Service: \n\nokay, this is in CP, I guess you can't expect amazing service, but if I'm paying 15 for a lunch box, at least try to be helpful.  Tip: you can...","8090 started in a Food Stall in Flushings Food Court. They now have a store front on College Point Blvd. Interior looks pretty clean and interesting signs...","I decided to try this place out. I ordered the Genral Tso Chicken with Pork Fried rice and also the cheese wontons. The Genral Tso chicken was amazing and...","Chinese food here is so so. The sushi could be better but it better than what you find around here. Delivery was long and there was a hair in my California roll","Many options from this restaurant! I ordered the shrimp and broccoli in garlic sauce and it was very flavorful. The shrimp were fresh and actually pretty...","My daughter and I had a shake this morning.  OMG. It was delicious. Had just the right portion of everything.  I'm not big on shakes but I'm a fan...","I really like the place because it was close to where I live but they aren't to friendly and the wait is very long. The wait between customers is crazy....","Small nicely decorated juice spot, a good clean display of real fruits and vegetables. I shared my meal a chicken pesto panini that came with a bottle of...","$15 dollar for a small portion basil fried rice that has white rice that are not fried... I mean, if you're gonna charge a high price, at least balance it...","We ate here before and were underwhelmed but decided to try it again. We ordered through Grubhub and got $7 off or else it would've been just under $50 for...","I ordered the drunken noodles it was ok, but my friend ordered the basil fish. The smell was purely disgusting. It smelled like old bad fish.. and not...","First time here and wasn't expecting much of the store base on the menu because the stuff seems pretty generic like any other Hong Kong cafe. But good lord,...","This is my second time back at Jin Jin. The first time was just by chance and the second time was planned. This is by no mean a fancy place to get dinner or...","Reasonably priced quality Chinese food on 18th ave.  This place Year's ago was a local diner anyone remember? I had an egg roll and some dumplings and...","Compared to other restaurants that serve Chinese food and sushi, Ma Sake isn't that bad for the price and quality.\n\nIn the past, I had problems with the...","Ordered: Philly roll, Spicy Tuna Roll, Veg Pad Thai \n\nSushi was mediocre with everything having too much salt (but was super cheap so I guess you get what...","Tried them many years ago and was very disappointed, ordered delivery today and it was beyond \"the worst thing I have ever tried in my life\"! If you wanna...","Usually always my go to for Sushi birthday dinner celebrations in Brooklyn.\n\nRecently, we went on a Sunday around 7PM for a dinner for 4 people. You don't...","Although Tenzan is not my go-to when I think of sushi or Japanese food, it was quite decent the last couple of times I ate here. \n\nFirst of all, this place...","We each had lunch special rolls: cali roll with healthy slabs of avocado, salmon avocado, yellow tail, spicy salmon, and avo eel x 2. \n\nService was decent...","Probably the worst banh mi I've ever had. Why did it have lettuce and tomatoes on it???","My boyfriend and I eat Vietnamese often enough to have a set standard on how it should look and taste. This place is a disgrace. We're pretty new to the...","I had ordered from this place recently and this place sure went down hill. Havent had it in awhile so i gave it a try again and boy i regret it. BIG...","This is our go to AYCE hot-pot sushi place. \n\nService: 5/5\nAmazing service. They always refill our drinks and quick to come get our orders and take away our...","I like this AYCE hot pot-sushi place. The foods are not of the best quality, but it's fresh and not bad. I prefer their hot pot more than their sushi. I...","Not the best all you can eat shabu shabu/sushi place, but not bad in comparison to others around the Brooklyn area. They have a limited selection but their...","My daughter and I came here for Father's Day - great choice - 4 seats so most is take out but we grabbed a stool and had some good sushi - they were very...","Ordered delivery. Got there right on time with no issues in how it was packaged. \n\nThe side salad contained surprisingly crisp, good quality greens. Came...","If my experience is typical of what you might expect, this restaurant is a terrible place to order food from. When the food finally turned up after an hour...","Yummy smoothies!! they're pretty cheap but have fresh and interesting ingredients. got a smoothie with coconut milk and moringa","So we called to order a salad. We're vegetarians and they bring us salads with chicken. We called again , they send us a new salad and it was with...","The fruit here tastes spoiled but yet the smoothies taste so fresh and it's sad for me to say that the fruit literally has no taste the pineapples are soggy...","I love this place their prices are decent and the foid is good i always order from them","Stale food that's been sitting along time with prices going up 1.10 out of the blue. Used to be worth it when you didn't want to wait for green lake but...","The food is great if your starving \nTaste like crap w. Soy sauce.\nThey bait and switch when you order on grub hub\nThey charge and then call for items that...","Been coming here since they've opened and the staff has always been incredibly warm and personable. They've never made a mistake with our orders and the...","This is a really good sushi restaurant. The space is really nice and the staff is accommodating. \n\nWe had:\n\n- Assorted sushi and sashimi - very good and...","Awesome food. Laid back and modern atmosphere. White chairs that make me feel like I'm chilling with the Richest, yeah I would give more than 5 stars if I...","Everything I've tried here is amazing, the California Salad is a must try. Their sushi rolls have just the right amount of rice and everything else.","Ordered take out through GrubHub. They are located within a shopping complex with a parking lot. Order was prepared faster than time listed for pick-up...","Kawaii is a nice small neighborhood restaurant. The employees are also very nice and accommodating. I have not tried their sushi dishes but I love their...","My favorite banh mi place; the vegetarian pork medium spicy is my most ordered.\nIt's a bit of trip from home but worthwhile.","Below average pho. Came here on Labor Day, 8 pm on a Monday. Had the beef pho which costs $10.75 per bowl. I also took a combo banh mi (which costs $8.25)...","Unfortunately this is the best Bahn Mi I have found in my area otherwise I would definitely stop going here. I don't think they care at all if you ever come...","One of the most memorable meals I've had to date was at Fob Brooklyn. It was a beautiful day and a group of us wanted to enjoy a kamayan feast in Fob's...","Food was alright. Never would've guessed it was Filipino food.\n\nThe service was pleasant and the halo halo above average. But the overall atmosphere was...","Came by for brunch on a warm, beautiful Saturday just before the end of summer. It was the perfect day to sit and eat outside @ FOB's homey, cozy backyard....","My girlfriends and I had a bubble tea craving. We ordered the wow! Milk tea with boba & pudding milk tea. We loved our drinks as the drinks tasted fresh,...","Better than sex (unless your partner is DELISH)\nBetter than spooning (and running with the DISH)\nBetter than arranged marriages (too TRADISH)\nBetter than...","Our Local Bubble tea place. Located near the to the Kew Gardens LIRR station you can't miss it . On a summer day you can grab a very refreshing passion...","We can start with a rap.\n\nLemon Black Tea's what I'll give to YOU\nIt has a lot to LIVE UP TO\nBut I know you'll share my POINT OF VIEW\nLike the 90's web...","This is a pretty decent and convenient place to grab a bubble tea while on Austin Street. No loyalty program, but they do accept cards - including American...","Definitely not that best bubble tea I've had. I got the mango green tea with mango jelly and I thought it was just meh. Even at regular sweetness it still...","Ordered the grilled chicken combo platter. Food came out pretty quickly and was good deal in terms of price and quality","Great service, prompt and good prices, the people at the phone are very corteous.\nGreat salads and combos, food is fresh I love this place","I went here after coming from Flushing and seeing tons of bubble tea places. I wasn't enthusiastic about paying the high costs I saw at the trendier bubble...","There may be a number of bubble tea chain spots throughout the borough, but one of the only options in Queens Center is Tbaar, a New York based bubble tea...","I had never heard of this bubble tea chain until stumbling upon it recently. Apparently it is a NYC based one with several locations in the NYC area. This...","The bubble tea is OK. Reasonably priced but the tapioca isn't good. Depending on the number of workers it could take a really long time to get your drink....","My 2nd time here... on my first visit, I asked the chef if she could customize some dishes that's not on the menu; she was more than delighted. Her cooking...","This café is a tiny space of about four tables with fun, quirky décor.  There's a definite relaxed, casual vibe here. On the walls are lots of reclaimed...","I am incredibly impressed with this cafe that serves the most amazing Thai food in a location that is tucked inside a neighborhood in Queens. I had to...","This is a hidden gem place that doesn't get as much recognition that it should! The customer service and food is a 10/10 ! Not only do they serve...","If you are going fr Indian food in Brooklyn \nTruly this is on of the best.\nNever do they gripe about tips\nThe food selection is great.\nAtmosphere is nice....","Nice variety collections of fried chicken \nMany new flavors I never tried yet\nThere are many afternoon snacks & dinner dishes for you","Close by to work and my favorite place to get some bubble tea.\n\nFavorite has to be the popcorn chicken (garlic flavor is pretty bomb) but I think they make...","I liked the grapefruit green tea with lychee (half sugar half ice), but they seem to have a really really bad fruit fly problem.. So I'm not sure I'd get it...","Excellent neighborhood spot which is tucked away just off Fresh Pond Road. The sandwiches they make are actually presented really beautifully on the plate...","Delicious and filling. Reasonably priced breakfast and brunch joint! \nWould definitely recommend it! Would definitely go again. \nThe smoothies are not super...","Love this place and I wish I came here earlier in my trip. This cafe has a lot to offer. They have egg waffle desserts as well as sandwiches that can be...","I ordered the teriyaki chicken for my lunch, chicken breast with teriyaki sauce was tasty. Also the Bubble tea was good,too. I highly recommend this little...","I don't often find new comfort food spots to love. I have my tried and trues and it takes some really good food to be added to the list. Enter Pot Pot...","It's so refreshing on a hot summer day! Great service! Best bubble tea in Glendale, NY","Food is amazing! Customer service is awesome!\n\n4 stars and not 5 just because of the atmosphere itself..restaurant needs some work. Looks very cluttered and...","Was in town visiting my bff and there aren't many vegan delivery options in Bushwick so we ordered from here. I ordered the sautéed broccoli and nuggets....","They make #Freshjuices 5/5 \n#Appetizers \n#veganroastduck 5/5 texture is exactly the same as \n#currypuff: 5/5 \n#vegtablewaton: 5/5 \n#Entree...","I adore this place! Wish I came here earlier. I decided to finally stop by when my toddler expressed her hunger. I knew about this place from Yelp and had a...","Stumbled across this small lovely market while in the area. Absolutely love everything about it! First thing I noticed is that they decorated the space so...","Cutest little shop with the nicest shop lady! Stopped by here yesterday to cool off from the heat and got an iced coffee. They have a comfortable seating...","Make sure to check into this location before ordering! They offer 10% off your order. Unfortunately i checked in afterwards & couldn't apply my 10%...","A little mixed about this place. I only went there for a smoothie because there's no other juice places in the neighborhood. Only three fruits to choose...","Le moment is basically a neighborhood chill place with food and bubble tea (and slush and others). \n\nI am glad they are open until late, for we were looking...","Came in on a hot Sunday looking for something fresh. The place is right by the park and the owners were extra courteous and nice. The owner was nice enough...","This location is really convenient and super accessible from the M and R train. It boasts some seating as compared to the other branches in queens. \n\nWe got...","I feel the snacks are way too spicy, because I asked mild spicy.  I feel they have false advertising for fried tempuras,  because they have a picture of mix...","I havent been to kungfu tea in a long time and I wont be back for sure! I shouldve been warned when the store was empty when I entered\n\nCame into redeem my...","Crazy addicted to milk tea and I've gone to countless all around in the city and in queens. This little spot is the best bubble tea spot ever. Quality...","I have been to other locations of this chain and this one boasts the same good quality. This one is an open air stall upstairs near the Starbucks. For...","Been a fan of the classic milk tea for the longest time and didn't venture beyond my frequent order besides the occasional thai milk tea or fruit tea...but...","Ahhhhhh!  Look out for the shopping carts!  \n\nThe quality of Gong Cha drinks are better compared to most mainstream Bubble Tea joints.  The hot or cold...","Since I live across the street from this, it's super easy and convenient for me to get bubble tea from here.\n\nThe shop itself is very small. There are only...","It blows my mind the medium is $4.50 and the large is $5.15. Granted the L is a couple inches taller. \n\n9 times out of 10 I get the 3 jewels (boba, custard...","Love coming to this place when I'm in the area. The riceballs and tea are always great, would recommend for anyone who needs a quick bite to eat as the...","This was my first time at Yaya and it was pretty good.\n\nOrder:\n- The Hulk regular sweetness, no ice, with mango stars (4/5)\n\nPros:\n- A lot of drinks to...","Cute lil spot. I came over to pick up some rice balls for my mom mostly. I used to go to the one in J.H. but this one is more convenient. \nRice balls are...","I love crepes and this place got me hooked. I got the sweet mojollia crepe which was strawberry, banana, kiwi, Nutella, chocolate syrup, and cookies cream...","Stopped in on a whim and it was alright. \n\nThe Nuts Praty was good and satisfied my sugar craving - I ordered it without Nutella! I would recommend this...","This is a dessert place owned by Asians- hence the bubble tea, matcha ice cream, thai tea ice cream, and Vietnamese coffee ice cream (to name a few)...","The HK style milk tea is on point! It's one of my guilty pleasures & I always grab one to go. Eventually I will make it to eating their food one day. I'm...","Just ordered takeout from this place. I got the French toast and signature pork over rice. \n\nThe French toast tasted too eggy, which mostly came from the...","Neat little spot to get your HK cafe fix! I had the baked pork with tomato sauce over fried rice and it was delicious! Also had the borscht soup and it was...","While trying the food at the new Hong Kong Food Court we decided to also try a couple of drinks from TBaar. I know that TBaar has other locations in Queens...","Finally gave in to the advertising mats they put in around the food court and tried some stuff from here. Got the mango & orange smoothie and a mango mille...","My drinks expense has significantly gone up since this location opened up in the area. I like that the teas are brewed and it shows in the taste. Staff is...","Al2paca TMD.  Located in the new HK food court in Elmhurst.  A new bubble tea place, also known as Tease Me Dear...which is the letters 'TMD' after the name...","I was in the Jackson Heights part of Queens and wanting a quick bite I stopped by Double Rainbow bakery.\n\nOpting for something savory I ordered the \"Big...","As with all Asian bakeries, the bread is great. \nMy mom got a chocolate fruit cake for my sister's Bday which was only $13. I didnt like it. It didn't taste...","Spent a month working in Elmhurst and this place was where I had breakfast almost every day.  They're open by 6am, which worked perfectly for my 7am start...","Been coming here for the last three years and I love it. Their prices are fair and the cup sizes are good too. Only thing I noticed changing is the onigiri...","Food: 2/5\nOrdered a shaved ice with jelly, pudding, red bean and tapioca as toppings. The ice tasted liked tea. Interesting flavor but the toppings were...","Anda is a Taiwanese cafe that specializes in bubble tea with snacks. We came during lunch time, which was a big mistake. The place was a mess. The whole...","This is one of the cutest newer additions to Woodside. I would have to travel to Flushing to get pastries and now having this down the street is a true...","walked past this place on a grocery run and had to stop in and take a look at the asian breads they offered.\ngreat prices on everything, they've even got a...","Street parking is a must here, this place is located at a easy enough to find parking area so its all good, but also they are right next to the train...","Taro Milk Tea(on left) & Winter melon tea.\nThis is my first time trying winter melon tea, & got my pure attention. It has a amazing flavor of taro milk...","I love Kung Fu Tea. So glad they opened one closer to me. The line can get long. Your number should be on top right of receipt. Pay attention so you don't...","Grand Opening.\n\n\n\n\nI just got a taro milk tea.\n\n\n\nPart of the  Elmhurst HK Food Court.","Shikoku- shrimp and beef teriayaki  $8... honestly this was very bland and had very little teriyaki flavor. Try something else!\n\nKinkhao Thai street food- 2...","Not sure if we didn't order the right things but..everything we got was average at best and the prices weren't much cheaper than manhattan/bk so...\n\nWe...","This food court rivals the very best of Flushing. I'm serious.\n\nThere are so many options here - from all types of Chinese, Thai, Filipino, Japanese,...","I haven't had Quickly in a while. Ever since their Manhattan location on Grand Street closed down many years ago, I've been paying $5+ for my bubble teas. I...","This boba spot has been here for years! They have a wide variety of drinks with some unique flavors. They also have a student discount. The bubble tea is...","Some Boba shops make their milk tea THICKLY\nSome make their fruit drinks sweet and SICKLY\nSome get their tea from PIGGLY WIGGLY\nBut you'll find good Boba...","Walked past this store so many time, and on one really hot summer day I finally walked in.\n\nI ordered the \"teas me dear \" tea, it was good, nothing special....","Absolutely a waste of my good money. Was walking by on way to another popular tea place. Got side tracked by the clean decor and decided to try. Order a...","Really strong tea for the milk teas (haven't tried the fruity teas), and 50% sugar is just perfect!\n\nCaution: don't get the mini boba/bubbles, which is just...","Tiger Tea is new, with a soft opening and a grand opening on 7/28-7/29/2019 where you can get a buy one, get one free this weekend/Monday.\n\nThe tea there...","Trademark issue here. Tiger TEA seems to intend to reap the benefits of Tiger SUGAR's name. A strong likelihood of causing customer confusion, where Tiger...","If they had negative stars this place would be the highest I can give.  First is my bad thinking this is Tiger Sugar.  I never had Tiger Sugar before...","This place may not be as good as tiger, but it sure does satisfied my bubble tea craving. \n\nTheir location is the best, located in the corner of main and...","Yuck！What the!!!!!! fly!!!!!\nin the coco drink!!! \nNo time go back to refund\ndisgusting!!!!!","If you want a tea that is watery, tasteless and with almost non existent pudding then order the taro tea with pudding. \n\nA total waste of money and it's...","This is the cutest cafe. Very clean and their service was really good.Their employees are friendly.\nThey also have good bubble tea and dessert！My girlfriend...","Visited Sweet Cats Cafe for dessert on a Thursday. It's small and the decor is definitely meant for Instagram, with an ivy wall and angel wing...","Such a cute place!  The interior design is very girly.  The pink color theme, wall of roses, another wall with angel wings and cats on the walls are the...","I've only ordered delivery from here but I love this place! Great prices/deals. EXTREMELY fast delivery. Polite delivery people. The sushi is always fresh...","I ordered from Uber eats and delivery was more than the ETA. However, they did call and say they were running late. To see there menu you can check them out...","One of my favorite places to eat! Close by & convenient\nThey are always friendly when i go inside. Can get a little pricey though depending on what you...","Great AYCE sushi spot. Salmon tartar is one of the best I've ever had. All of the rolls I have ever ordered were always fresh and delicious. Worth the price...","This used to be my favorite spot, until I was insulted by asking me to choose 2 menus. Here's the situation. I came in with my wife, and another couple. My...","This place is only worth it if you're doing the all you can eat sushi buffet. We went on a Sunday and the sushi tasted fresh, the appetizers were good, and...","Love this spot for Tex mex food and sushi  it is a bit pricey but you have to pay for what you want. Made fresh and delicious they do deliver. I enjoy the...","Best place to eat . Love their tacos , California rolls , and their pork fried rice with rib tips delicious .","People are saying this place is good and I'm trying to figure out why  ! I got a chicken taco and it was so dry !!!!!! And their sushi smelled a bit too and...","We have been ordering delivery from Sakana every other week since it's opening! The sushi is consistently fresh and delicious, and dining in is great too....","We have lived in New Rochelle for 5 years now and have been waiting for a good sushi place to come in our area. This place has very fresh sushi - quality is...","I LOVE this Japanese restaurant! The waitresses are attentive ,nice and friendly! This is the only Japanese restaurant I ever go to. My favorite are the...","I've eaten here for lunch twice over the last 2 days while visiting the hospital nearby for work.  Their lunch special is unbeatable.  For what I've paid...","When you call yourself a dumpling  place, you have an opportunity to wow patrons with other types of food as well, no?!?! I don't know, maybe you stay...","Dumpling + Noodle is a very good convenient place.  I've been there many times and have had some tasty meals.  I particularly like the shrimp cakes--nice...","It was ok mixed greens were wilted and dry in container \nPlace is clean \nStaff accommodating and friendly \nPrices are affordable","I ordered on Seamless. No delivery after 1.5 hours so I called. No answer the first few times. Then I did get an answer. \"Investigated\" and called me back...","As much as I want to like a health-focused place like this in the Bronx (since there aren't very many) I can NEVER seem to get service at this place. This...","Man I love Cafe East. This place kept me sane throughout my rough college years. A well-timed banana berry smoothie or tray of salmon nigiri snuck into...","Mold. In. The. Grapes. \nThey proceeded to \"inspect\" the other grapes by flipping the containers over but refused to remove them from sale. This is a public...","Recently renovated, Cafe East now serves more people with more space. The bubble tea and smoothies are on point as always, and the addition of new pastries,...","I absolutely LOVE this store! \n\nIt's in a convenient location for me and I pass by it every day. Also, the fish is always super fresh, as well as the...","Surprisingly much more impressive than the one in Hartsdale. More space, more choices and a much more appealing food court - like crazy awesome. \n\nThe food...","Two years running I have been going to H Mart with my family on my birthday.  I'm an exciting guy, I know.  Ha!  \n\nWe put the 4 year old in the cart and go...","What are you waiting for? If you need your Philippine food fix and you're up in Westchester, GET IN YOUR CAR and go there already. And if you're not, jump...","It's good food!  They are freshly made each time.  I like their fried branzino.  Not greasy and it's crisp.  Ask for more of their homemade special seasoned...","We came on a holiday so we called ahead and they let us know they close at 8:45pm. We arrived a little after 8 and saw the seats already up on the tables....","Egg bacon and cheese on a bagel notoriously bad.\nHow hard is to make that?\nBubble tea too\nEverything else is just fine, great service","My husband & I ordered from here a few days ago so ive been wairing to post this review. First things first. Food was good BUT I will NOT be ordering again....","2 stars for lack of communicating. I was calling the store to get a update on my orders and no one picked up! Delivery came a little after estimated wait...","My friend has lived above here for 2 years but just had my first meal here and it was very good. The pork dumplings were very tasty, as was the chicken w/...","I like that they have fans going, it has a good breeze in there. The menu is over done with both Chinese and Japanese cuisine and then some Thai dishes...","Even with the name change, (now Ke Lai Le) excellent fresh food, we order a few times a month. Always fast, always pleasant, always flavorful.","Yummy place for Thai food. I found it to be pretty authentic. They have an extensive menu to choose from. It's not your typical \"American\" Thai food with...","I have had a lot of Thai food these past few years (mostly because it is a popular lunch choice amongst my colleagues) and this place has some of the best...","Very Brooklyn Thai vibe to this little cute restaurant- if that's a thing. We've actually ordered delivery from here a ton of times. It made sense for us to...","I got the sublime(green) and \"green\"monster(pink).\nThe sunlime is good with lots of green vegetables, sour but not sweet. \"Green \"monster is not green color...","This place has the best cassava ball in town. The aroma of fresh food hits you in the face as you walk through the door and there is always something...","Don't get the doubles here. The smoothies are good and the cassava are okay . I will give this place 2 star. Restrooms are also very unclean","I stopped in here during being stranded for hurricane Irma. I wanted some good Chinese food and popped in here. My usual go to is General Tso's Tofu which...","I saw this place from the outside as I was dining accross the street and came backs to try it.\n To my disappointment, it was a local takeout place with a...","I've order there 3 times through Postmates and every order is correct, on time and absolutely the best sushi in Queens thus far!!!!!!!","Went here last Sunday (04/28/19). After going to the Brooklyn botanic garden for the cherry blossom event they had going on, we were really hungry and was...","Is this a new place in the same spot as an old place that served the exact same menu?\nStopped in for the lunch special.  Went with the any 3 rolls for...","Was a bit hesitant given the yelp rating, but hunger, exhaustion and the presence of other patrons, lured my group in. We were all rather happy with our...","This place is sort of a double hidden gem-- it has an unassuming, faded marquee, nestled among the generic eateries and small businesses across the street...","In love with the spicy wontons!! I was craving it for the last 2 days but it was a bit of a travel to get wontons... and Uber would've been about $20 one...","Went here after a trip on the LIRR train that is nearby! Was looking for bubble tea and found this location on yelp.\n\nYou order at the front and there is a...","Poor customer service and mediocre hookah. The pizza was the most redeeming factor. Not a fan otherwise.","Order 4 items from this restaurant. Fried calamari 8.50, pepperoni pizza, jerk chicken fried rice, and philly steak deluxe.  Calamari portion is unrealistic...","This place is trash. They waited for me to order my hookah to then tell me half of the menu was unavailable to order from. Only thing they had to offer was...","I've ordered from here numerous times and the one time I called and asked if they take visa they hung up on me remind you it say it on there menu but I...","Always order lunch from them. The staff is friendly,  my food is always fresh, hot and tasty.. if I decide to do delivery they always come super fast","Ordered from here over the summer for delivery. My shrimp w/ broccoli and white rice was decent. My husband said his sushi for the price we paid was way too...","Long live the king! The white fish pieces were superb. I recommend the bubble tea. I also had the miso soup. The service is super friendly. My girlfriend...","Ordered from Uber eats. \nThe spicy tuna maki was unbearable. It's the first time I threw out rolls. \n\nJust everything about our order was sub par. \nWill...","Food: 1.5/5\nFound this new restaurant so I decided to give it a try. Their menu seemed decent. They have sushi bowls, dons, a la carte, bubble tea etc. I...","Food was delicious!! New spot for quick bite to eat.. Very friendly staff! \nThey have variety dumplings- i will be returning to try the complete...","We finally got to try this venue, today, and we are extremely happy we did. \n\nThe venue itself is bright, colorfully decorated, and clean. The staff is very...","3.5 stars really. \nWe were walking down Metropolitan Avenue looking for a place for lunch and happened upon this dumpling place. They had an interesting...","This review is only for the vegan Banh Mi Sandwich with Woodear mushroom, shiitake mushroom, carrots, jicama & vermicelli. That is a very excellent...","I came in to pick up dinner and ordered online ahead of time. The online ordering was so easy and convenient. Great option. Got the lemongrass chicken rice...","My husband and I were disappointed at the food here. We only gave it two stars because the pate bahn mi was the only delicious thing we had which we would...","Never though I'd like crepes but I love it. This place makes them great. Refreshing!  Easy to eat!  Gluten free!  One of my favorite deserts.  I tried the...","I love this place. So yummy. I went twice. The 1st time I got the Caramel Fuji apple crepe. It was amazing. So I came back with my brother and his family....","Nothing special just a thin dough and all you can taste is the strawberries and banana together. Does not have any unique taste.","This place have been open since jan. 2019 but I didnt realize it till today, since I didnt see a business sign. This place is runned by a couple and we had...","This is my favorite bubble tea in bayside. Coco is a little overrated and not consistent with what they serve you. What makes me want to keep coming back to...","Momo ashi cafe?? I remembered when it was just a little stall in Roosevelt ave in flushing! \nAnyways, the place is super spacious with lots of seating. It's...","My girlfriend and I went to Queens to visit our other girlfriend after she had her second, very cute, little chubba-wumba babes. While we were there she...","I just picked up a cheese rose oolong tea and a cheese peach oolong tea and love them both. I ordered 70% sugar for both drinks and felt that it was the...","Surprisingly this place is pretty good.  Initially wanted to head to coco or kung fu tea but those places were extremely packed on a Saturday night.  Mi Tea...","Late post, came here last month (July 21) and had some good drinks! We got 3 drinks: white peach slush, watermelon and passion fruit tea and a strawberry...","It's located inside a fresh produce store right next to the stairs to the LIRR station.   I wouldn't think about going in until recommended by a friend....","This quaint little place is located in the supermarket looking store right next to the Bayside LIRR. My boyfriend and I happened to stumble upon this place...","Taste Of 3 is a newly opened bubble tea/ drink shop. It is located inside a deli/ small supermarket so you could possibly miss it ( like I did- 3 times...","Consistently one of the best bubble tea shops in this area!\n\nThe drinks are always on point, and can be customized in a variety of ways like the percentage...","I came to this Kung Fu Tea last year around summer time with friends since we were in the area nearby.\n\nIt was one of the few bubble tea shops in the area....","So my friend suggested this place for bubble tea and so my niece is a bubble tea lover and I figured that she would be the perfect candidate For this place....","If you are looking for rolled ice cream while you are at Forest Hills stadium, whether it be for a day out, or right before a show you have been waiting for...","Meh... The frozen ice cream was good but I don't think it needs all those toppings. Considering the fact that they wanted to charge the same price with and...","I love this placed and frequented their original branch before I moved!  I hope they decide to stay permanently!! Great flavors, well priced, delicious and...","That light up menu is brighter than my future, good vibes, very low-key place. And relatively good hookah for the price. Been a regular there for some time...","Okay people so it's been a few months pass by and this is how you tell the difference between a business owner who's just in it too say they have a business...","Came here for some dinner and hookah with my fiance and were later met by our friends. Food was pretty good. We ordered our usual chicken tikka masala which...","A newly renovated space that took over what used to be a local sandwich spot. It's clean and spacious with pretty modern touches- a place I'd like to sit in...","Great new edition to the neighborhood! The buns are freshly baked on the premises. This location is convenient if you're aching for your morning coffee or a...","The first time we came here we saw the women at the glass pastries cabinet frantically trying to catch a enormous black fly jumping from one bun to another...","I have been to the mall many times but had never seen this place. The first time I went there, the staff that took my order was very polite. It was a very...","Went to the mall today and stopped by for a large grapefruit green tea ($6+ with tax). The two girls that worked there were super rude, and they were...","0 STARS !!!!! Ordered a jasmine green tea with milk foam which I said MILK FOAM 3 TIMES !!!!! When I got my order there was no milk foam......I asked the...","The ingredients used are good quality compared to most Chinese bakeries. Example: egg tarts. While most Chinese bakeries (and dim sum places) offer egg...","This is the second try at the bakery. Ordered a tiramisu cut cake and a double almond steam milk custard and a milk tea. The tiramisu has a rather 'stiff'...","In a Chinese bakery desert the lone one stands out. Cool to have one of these in the neighborhood when I'm craving a pork bun or a hot dog bun. This spot is...","they have USB outlets at every booth! enough reason to stop by if you need some juice.\n\nwalked in on a saturday around noon and the place wasn't too...","Wow wow wow.\nI can not recommend the kiwi juice with bubbles enough. It's a different twist to an already iconic\nStyle of drink. For most boba shops they...","Their cheese topping is great and the perfect balance of sweet and salty, but that's all the praise they will get.\n\nI ordered the peach oolong w/ cheese cap...","The cake so great, I like the green tea cake. Very soft and not too sweet.\nThe shop looks great and clean, all people all very nice.\nWill come back and...","This time we got the rose milk tea which was abt $9 & came in a cute teapot accompanied by 2 teacups. The tea was slightly sweet, milky, fragrant & just...","My favorite here is the potted milk tea. It might look real good for the gram but its really just an added bonus to how good it tastes. I always get the...","This place just opened 3 days ago and I just had to come in and try it when I saw thai creamery and the buy one get one advertisement was definitely the...","Excellent customer service. They go above and beyond for their customers.  I had an order that looked wrong, they sent me another drink free of charge.  The...","The Açaí Bowls are super watery and has very little taste. The most satisfying part was the toppings. And when I told one of the staffers. She told its been...","We were glad to attend their friends and family private events before their soft opening on 9/23. The location is very close to Main St. Located next to...","Dessert was good.  BUT UNFORTUNATELY they ran out of taroball before closing time and ontop of that they had mad seatings but chose not to seat anyone....","I literally never write reviews but I really had to this time because the service is so bad here. I would give it 0 starts if I could. I don't know how the...","Yelp says you open at 12pm, the poster on your front door says you open at 12pm. I literally wasted 15 min from my lunch break walking here. It's way past...","I got an almond bubble tea. The bubbles weren't the freshest I've ever had, but they definitely were soft, not hard. I have no complaints.","Odd hours. Opens at 1pm.\n\nI was there on Sunday and ordered two drinks. Almond milk tea with bubbles and lychee punch with nata jelly. The person working...","This location is a bit busier than the Kung Fu Tea on Kissena but the service is much better, friendlier, more efficient and drinks have consistently tasted...","Favorite bubble tea place! \nI have tried almost all their flavors and I can say they're all amazing! My tops are: pasión fruit green tea, winter melon tea,...","This place is my OG Kung Fu Tea spot (even though it wasn't the original one in Flushing). They always nail their bubble teas and are always rather fast....","Better service than Flushing location, and more room to sit. \n\nI mainly come to Coco because it's conveniently in the Bayside area and it has a good amout...","PRO TIP: default sugar percentage is 100% so always ask for 50% or 30% otherwise it is wayyyy too sweet!\n\nservice was prompt but the hot milk tea with boba...","I came to Coco's on Earth Day, when they had 50% off any medium or large drink if you bring in your own mug. When we went in and asked about the promotion,...","This review is strictly for the white rabbit milk tea. \nMy boyfriend and I got the medium-sized original white rabbit milk tea to share. The line wasn't...","Decided to try out this place because of their white rabbit drink. It was pretty bad and didn't taste like the white rabbit candy at all. Maybe it was...","Every day is a tough day for With Sugar and Tea. On a daily basis they watch the lines swell for next door Tiger Sugar (#1) all while playing second fiddle...","Drink: Flavors were good. They had tastings available the day I came by.\nPrice: Expensive on a few things. Never thought I'd be paying over $5 for bubble...","The rose milk tea was good but tasted more like a regular milk tea than rose. The taro milk tea was creamy and the handmade brown sugar bubbles with it were...","My partner and I visited this store today to film some of Onetea's drinks. We were both quite curious to try Onetea, since we noticed it popped up on our...","Looking for boba that actually has tea flavor?! This is the spot. Today, I got a Jasmine Milk Tea and it's refreshing with the right mix of smooth milk and...","I ordered the 913 Ginseng Oolong tea. I asked the guy to exclude ice and bubba. He then proceed to ask me if I wanted ice. Sir I just... sigh. No ice...","This is one of my favorite places to get bubble tea for the fruity flavors. First off, this location, specifically, has a very zen feeling inside the shop,...","The drinks here are great and there are a decent amount of tables if you want to do some school work on the weekend. \n\nThe only downside is that you have to...","I have been here for quite few times for few hours.  I have noticed few things since my last review of the place. I don't know if anyone would noticed them...","Probably the least flavorful bubble tea place I've ever been to:( I generally don't write negative reviews, but I'm hopeful that this review will either...","Who wants to Vivi forever? Well we kinda do.\n\nWe are big fans of all kinds of boba chains and some have really good products and some of them are less...","Since I was mailing packages at the post office nearby, I stopped by ViVi to try their famous, beautiful Blue Galaxy drink. The employees were nice, and...","One of my fav drink at Vivi is the passion fruit green tea, no sugar. This branch makes it really good. Quick service.","Mochi waffles here are SOOOOO good! I love the matcha red bean one the most. Not going to lie and say this little shop is clean or that sanitary, but who...","One of my favorite bubble tea/snack places on main st. They have a great 2 for $7 large fruit tea offer which comes with a lot of toppings. Every time I...","Two for whatever, either way it's gonna be cheap and it's gonna taste good. Momo ashi is a little stall tucked away on the busy main street and they are...","Our server was Andrew, spoke Mandarin and English and had helpful coworkers who also waited on our table. Quick efficient clean and reasonable priced, this...","TLDR: First NYC location of a Sichuan hotpot chain. Very long waits but fair prices. Lots of amenities during you wait. Service is above and beyond.\n\nI...","Ok, this place likes up to the hype. I'm a fan now.  You order everything through the ipad. Everything is a la carte. I like that it has a running total at...","I have tried this place several times including in person visit and phone order. The customer service attitude is cold. It's in a dingy small basement level...","I was craving mochi SO MUCH today and found this place on yelp. These mochi they sell are the real, fresh-cream based ones, do not think of the chewy and...","I was craving for something fruity so as I was scrolling on Yelp, I found this place. It does seem like it has been open for only a short while, it was very...","Wow best macaroom ive ever had, and it was raspberry lychee. The coffee was super bitter just how i like it, woke up the demons inside of me. \n\nThe...","There's been a lot of Coffee Monsters that have been opening up and it was surprising to see this one open so closely to a residential area compared to the...","I'm so happy this place opened up literally just a few blocks from my house! I can't say much for their other location, but this location has been solid the...","So many bubble teas, so many choices, so many configurations. When someone says they like a place I think it is also important to find out the drink they...","Jeff got passion fruit green tea was refreshing\n\nI got the winter melon drink\n\nTotal around $10","So I am a huge fan of #BubbleTea and always looking for a spot that can make the best. I travel extensively due to working with International Relations and...","This rating is based off of the atmosphere in the food court!  The service at happy lemon is typical, good, not bad, not spectacular.  The 5 star rating is...","We came in at around 9:39 pm and the place was listed to close at 10 pm. We asked the cashier if they took card and they said they only take cash. I left my...","Happy Lemon is located in the food court of Queens Crossing. The drinks cost a little bit more than I am used to but they offer some unique and interesting...","For offering a gigantic cup of a variety of bubble tea drinks for a similar price ($5-6) of a normal sized cup at a competing shop, I give it 5 stars!\n\nI...","I go here for the purple rice rose milk bubble tea with zero percent sugar. I am hooked on this and you cannot find purple rice bubble tea anywhere!!!! You...","My new bubble tea place. I'm not a bubble person but I LOVE the bubbles here it's so soft, chewy, not too sweet and warm. I will definitely add it to all my...","Bubble tea! Yessss‼ and rolled ice cream too?! Make sure you check out the menu on the counter since there are MANY more options for bubble tea and ice...","My kids love this place!  We come by for a quick treat!  Yummy bubble tea!  Fun Ice cream rolls that taste delicious!!  Definitely recommend!.","Place is definitely worth it .. the shop is nice and clean and service is excellent.. since I found out about this place i been going more frequently.....","The red and yellow capsicum as well as the purple cabbage were a surprise, but the ingredients were prepared separately and it was delicious. Generous...","Hole in the wall with delicious Korean food-highly recommend it! Friendly staff, quick service.","Korean food is done properly, the staff is friendly and helpful and the atmosphere is clean and relaxed.","I have always loved their food, good quality however, I dont appreciate the server telling my family how much we should tip him. In my opinion, its tacky.","How does any one go here I'd line to know , the owner for worker whom ever she is in the front is the rudest person ever !!! They're all rude there , and...","Insane spaghetti flavor amazing rice greasy but juicy eggroll. Chicken wings? Eh there's better but it's still presentable. Very clean resturant to eat in....","Excellent restaurant. i brought my wife and three kids here after a day at the bronx zoo. parking isn't the greatest. we luckily found a spot right across...","I picked up my order and noticed the restaurant was hot on a very humid Sunday afternoon. There was either no AC or it was broken. \n\nI ordered vegetable...","I love Thai food. I evaluate every restaurant based on their pad Thai and veggie spring rolls. I have to say the level of culinary arts at this restaurant...","Wow. I love this place. The BBQ short ribs remind me of Korean short ribs--so good. What was even better was the loaded tater tots with pulled pork (I...","Don't order from here!!!! \n\nI placed a lunch order and two hours later still had no food. I called the restaurant to see what happened and they told me it...","First off, like all the other reviews, my biggest issue with this restaurant was the price. Over $15 for a small bowl and a tiny sauce cup size of macaroni...","Pretty authentic Chinese food. \n-I especially love the beef inside the spicy beef noodles.\n-\"spicy\" is not really spicy, so it's very friendly...","First time for us and we were more than satisfied , we took the suggestion from yelp .\nThe food was very good but I would like to have a bigger selection.\nEnjoy","This restaurant was an absolute gem to find in Harlem! My friends and I found it on yelp because we were in the mood for asian cuisine and just soup...","If I could give zero stars I would! The pizza has no flavor. I ordered \"crab sticks\" they gave them to me cold. I brought them back to the lady and she...","Awful overpriced wrap. Smelled and tasted rancid. Dirty inside. I will not be going back.","Came here for pizza but why is the pizza flat on the counter and not on a tray. Not sanitary really up set won't come back. \nSign states new...","We usually order chicken and broccoli, very basic. It's decent, broccoli is fresh and chicken isn't over cooked. Sometimes it comes out salty but balances...","Lunch special here does NOT include a choice of soup or-soda.  You get only the entree and choice of rice.  I ordered curry chicken with onions.  I received...","This restaurant has been here for as long as I can remember, and I've been here 35 years, so I guess they are doing something right.\nI went there for the...","Took my students here on their last day at the hospital. The service was very fast. Reasonable prices with descent food. Lunch special is a good deal. My...","If you are craving Thai food near Mt. Sinai this is an easy access for that pad thai!\n\nLocation: It is located few blocks from Mt. Sinai. The restaurant is...","A little hole in the wall near Mount Sinai UES, and now the restaurant's name is covered with a scaffolding, making it even harder to find. \n\nI've...","Nice Spot For Some Good Food With Fair Prices And Some Good Bubble Tea (Not Too Many Places With Good Boba In E. Harlem). I Had the Super Special Which...","Was excited about this place based on the reviews but I'm not sure it's for me. I've tried 3 or 4 Mexican dishes here. Meat quality is poor. Food is very...","I heard so much about their steak super fajitas and was excited to try it! \nI came home to see what I received from to-go and was very disappointed. \nI'm...","I order from here all of the time! First of all, the spicy snow crab rolls are amazing. The boss/owner knows me and my order well. He's a nice guy and the...","I had an hankering for rolls today. And I remembered where I can find the best cheapest and freshest quality fast food Japanese in Spanish Harlem. This spot...","Cheap sushi. \n\nFast delivery. \n\nCheap sushi. \n\nSo glad I live near this place. \n \nOh did I mention. \n\nCheap sushi! \n\nLove this place.","Really can't go wrong here. Got the pork shoulder bahn mi, which was about 1.5x the size of any other sandwich you'd get elsewhere in the city and very...","I too love Saiguette. My go to is the grilled beef bun (vermicelli) \nMy mom always eats hers w two sides of peanut sauce. Which they never charge us extra...","I've been craving banh mi sandwiches and am so glad I found this place on Yelp! Literally a 7 minute walk, so decided to call in for pick up. The kind lady...","The sushi here is delicious, I personally really love the crispy chicken roll since i'm not a fan of having any sort of seafood in my sushi. The pizza here...","Their Chicken Fajita ($6 or $7) is too sweet. Keep sweetness for dessert only please.\n\nThe Turkey breakfast sandwich ($4) is good except it's too salty cuz...","I am extremely disappointed with the 24-inch half pepperoni half broccoli pizza pie I received this evening. First of all the order took over 30 mins to...","This little place is a gem. Their take out hibachi is just as good as what you would get at the restaurant. It comes with a lot of food and I love that you...","We love the hibachi bowls at this place. Unlike other non-hibachi restaurants, their \"hibachi fried rice\" actually tastes like the real thing. \n\nCustomer...","4 for the food \n3 for the rest\nGot the chance to try the crepe - the dinners and the bubble tea!!! \n\nthe 3-\nVery small space.  We were going to eat there...","I'm officially addicted. I've always been a fan of tea parlors and these bubble tea joints but what sets them apart are the variety of flavor options. Gong...","New much needed bubble tea spot in Little Neck! Yippee!  It's always feels so good when a new bubble tea spot opens, good to have back ups! Stopped by  20...","Gong Cha- There's nothing that gets me more excited than when your favorite guilty pleasure is coming to knock on your door instead of you having to hunt it...","A small spot with a few tables and chairs inside. I had ordered the Chocolate bubble tea and the Florida sushi roll (spicy tuna, avocado, sriracha) \n\nThe...","I really wanted to like Bubble Hut. Such a cute name, such great bubble tea! But overall it just wasn't worth it. Prices are too high, food is just okay,...","Discovered this cozy spot while searching for bubble tea online. It's located in a small strip mall in a residential area. Upon entering, noticed this place...","The marinated salmon and tuna, the black rice, the sushi rice, the homemade ginger dress, the huge bowl full of poke, the outdoor seating for you and your...","Came here to try out a new poke place. Owner is super nice and friendly. As for their poke bowls, we had 2 custom bowls. I personally like the black rice....","I always eat the ramens. Chicken is my fav but i tried the tofu noodles and seafood and it was amazing. If you like spicy go for the oil sauce. It's got a...","Competition in NY is vicious\nBut I found the Boba most delicious\nSo friendly and cute\nAnd the best ever fruit\nMr. Wish fulfils all of your wishes\n\nWhat to...","My absolute FAVORITE bubble tea spot!!\n\nThis is the only place I will ever go to in great neck to get my bubble tea fix. I'll start off by saying that I'm...","Honestly the best Bubble Tea I have tried near NY, a lot of choices, the tea are very tasty, the pearl not chemical at all. I loved it! \nThe personal Is...","Drinks are good. I normally get their bubble milk tea which I often crave cause it's so good. I got their tiramisu latte w bubbles once- it was good but had...","I came here to order the brown sugar latte with tapioca which they advertise on their big window. They even have a sign posted right by the cashier. When I...","I'll be the first to say I'm a huge bubble tea fan. I regularly go out of my way to CoCo to get my fix of a large Taro Bubble Tea, but I decided to give...","Came here after a relaxing massage with Pogibear. Was feeling parched so decided to check it out since they have vegan options. They had watermelon and...","I bet it's so good. It looks so good. People say it's so good, but I've never been there. That's because every time I try to go it's fuckig closed. Ignore...","I love this place! I'm not sure why it took me 4 years to visit but dang! This place is right on a corner next to many shops. I love this place! I have...","I give Pink Forest 4-stars for coffee/drinks and maybe 3 stars for the food, which is passable but not very good. \n\nAs a coffee/study spot though, it's...","Just a regular coffee place \nWouldn't go again as is not close to me. However for locals would be a nice place to be a regular as I guess is worth it. \nThey...","I've just discovered the joy of the Pink Forest.\n\nI work from home and my husband has been on me to get out of the apartment and work from my laptop because...","I really truly enjoy the dumplings here! I tried the chicken and chive and the shrimp pan fried dumplings and they were around $2.75 for 4 medium size...","Decent dumplings and cute new hole-in-the-wall. I think their hot oil wontons are the best. The veggie with the mushroom is more flavorful than the meat...","With the pan fried dumpling, I liked the wrapper - not chewy or hard and filled enough with pork and chives. Noodles had a good bite to them; are used for...","I would rate this place 4 stars instead of 5 stars because of the Original Bubble Tea being too sweet. I was drinking around 4 Bubble Teas to try to get 1...","\"gourmet bakery & deli\" didn't know microwaving all your foods instead of using a grill was gourmet. Ordered a chicken sandwich and heat the microwave go...","Would give it zero stars if Yelp made it possible.  Horrible customer service and I smelled BO in there.  Waiting for 5 mins to try their bubble tea but...","This is my favorite healthy food joint in the area. The staff is friendly and helpful! And most importantly the food is AWESOME","Stairway to Strawberry   salad amazing. Love it \nMy boyfriend got it for me already twice. I can make two meals out of it. Stays fresh for a few days if you...","The salads here are so DELICIOUS. When I walked in, the staff was friendly and helpful which was awesome. The rice pudding with cinnamon is to die for!","Unclear why people were unhappy with the food. My neighborhood sushi place. I have been ordering from this place for about 3 years and on consistent basis...","I've been ordering from them for years. Never had a problem until today. I ordered a salmon combo with brown rice - $12.95.  The meal did not taste right....","Small restaurant that can seat about 20 people. I was the only one dining in around 2pm on a Tuesday. The service was quick, greeted as soon as I entered....","I think their tea is really good! I'm glad that there's finally a place in Parsons that has some good bubble tea. I tried the Taro and Thai bubble tea so...","Had the fried rice with garlic chicken lunch special today. Had the hunan and sechuan chicken in the past. Fried rice was good. Chicken tasted bland both...","3.5 stars \nI have never had chop suey before and wasn't even sure what it was. Had to google it. It's basically a variety of veggies cooked with your choice...","Got a takeout salmon poké bowl and it was really yummy. A little steep in price but the people are friendly and the service was fast. I would order the poké...","The Tom Yum has 2 pieces of shrimp and barely any chicken and wasn't very good! The green curry was runny without any of the usually thing in it and it was...","I have never been so upset by a delivery experience. Not only was the order 20 minutes late but the food was bad (literally old fish and veggies) and the...","Reordered a past breakfast order. After waiting over 2 hours for delivery, I called and the man that answered said they never got the order. I was puzzled...","Just went here for lunch, was looking for a Mexican place and saw they had burritos. I was a bit hesitant to order as I noticed the ingredients sitting out...","This is probably the worst establishment as far as service is concerned.  This has to be the 5th or 6th time I've ordered from here and at least 4 times...","I like this place. I came to try it out since it's close to my house. The inside is very nice and our waiter was super friendly! It's empty on a Friday...","I met my college friends here last Friday and two of us ordered pad Thai. My friend ordered pork and shrimp pad Thai. I ordered chicken and pork. The food...","Good family size restaurant. Service is slow but only because they have one server on sundays. The Thai iced tea can use a lot more Thai tea. It was too...","Love it ! Gimme more Gladiator and mango sticky rice with an amazing oyster brewed stout","I will never order food again from Hado Sushi restaurant in Briarwood, queens. Via Seamless.\nDelivery is incompetent and a scam.\nI never received my order....","Maki Lunch Special: \nEel & Avocado, Spicy Salmon, & Spicy Yellow Tail with Miso Soup.\n\nUnderwhelming and weird \n\nDisappointed the Salmon and Yellow Tail...","You don't see a lot of traditional HK breakfast/Lunch spot in NYC. I am from HongKong myself and it takes me back to my childhood. The vibe, the breakfast...","There's an arrangement in this cafe that after 5 pm each day (except Thurs), someone uses the premise to sell Cantonese wonton noodle.  The wontons are...","2day I pick up food & beverage \nfrom this store..no complain..\nfood is just okay..\nThe wait wasn't long..","How much bubble tea is too much? If you answered, it's never too much when talking about boba then you must love boba as much as I do. With that being said...","A new place in the neighborhood is always nice. My wife and I came here about 2 months ago, and ordered the moo drink, which was most milk, some brown...","A new-ish neighborhood establishment located a couple of blocks away from where I live, the name always makes me think of \"Panda Cafe\" and they have a super...","Cosy little place serving Hong Kong style snacks. Food came hot & fast.  The restaurant is very clean and orderly, deserved of the \"A\" rating.  I would...","**3.5 stars**\nStar Cafe is tiny! It took a long time to figure out the menu because it's posted on the walls all over the place. I am not sure if the paper...","If you blink you'll miss this little food cafe located on  the north side of the the LIE service close to Utopia Parkway.\nMy GF noticed it one rainy day...","There is attentive and efficient service. \nThey have a clean, friendly, atmosphere. \nThere are Delicious desserts and drinks. \n\nOnly qualm is that the seats...","BAD BAD VERY BAD SERIVE AND POOR ATTITUDE. (Only the bus boi in black was nice) \n\n1) no attentiveness \n2) the menu says bubble milk tea hot/cold (i ask for...","This is a cute place for a date or to catch up with a friend... or when you are craving some delicious dessert! \n\nI found this place on yelp when I was...","Fay Da is a staple Chinese bakery that has all of the typical Chinese breads, pastries, and drinks. Cash-Only and self-serve with tongs! \n\nI've come here...","Conveniently placed just outside the 71st-Forest Hills Station, this location has good service and is a great place to come to if you're looking for a quick...","Great spot for bubble tea and their pastries are always fresh. I love their pork buns. Their little cheesecakes, mousse cakes (I tried strawberry and...","The bottle of the drink is convenient. Able to drink without using plastic straw. More better than regular bubble tea place. Reduce plastic. The matcha...","Got the mango fruit tea and cherry blossom soda. The tea was actually really good. But the service was pretty bad. First, it took two people to take my...","And I don't know when, why, or how\nBut I need a Boba right now\nSo if we're close to Flushing\nThen we should be rushing\nFor a Lemon Black Tea from Macao!\n\nI...","This Gong Cha is located in the New World Mall food court. I had the lemon wintermelon with basil seed drink which is in their top 10. I mistakenly thought...","Tea was ok, but the bubbles were only partially cooked, the inside was grainy. They do no ice and 50% sugar, though, so that's nice. The speed was ok; they...","It's hidden inside an interesting shopping mall in the food court. Staff are friendly and I just miss their bubble tea, one of my favorite tea shops! Tried...","This is one of the best bubble tea places I've been to in NYC. Fresh fruit, fresh tea. You can really taste the tea, and that's one of my favorite things...","Good honey green tea with bubbles! My fav! ;)\n\nThe mango smoothie with REAL mangos is AMAZING! The husband loves! :)\n\nThe strawberry smoothie is what the...","Was in downtown flushing around 1AM. Everything else was closed except for this and CoCo. I decided to give Tbaar a try. Ordered the brown sugar milk tea...","This place is bloody amazing. I have always been a fan of Vivi but I always had to travel far from my house to grab my favorite Strawberry Yakult Boba and...","Tried the milk tea, taro milk tea, and salt and pepper popcorn chicken. All mediocre at best. The bubbles aren't the best quality. Popcorn chicken was...","Solely rating the popcorn chicken at this particular location.\n\nI stopped by to try their popcorn chicken and saw that they had a bogo half off deal so I...","I stop by one day before work to get a bubble tea. I got the Earl Grey, Taste really good!","Newly opened dessert and smoothies place on Bowne! Came here around 5pm and the girl said they were already out of all the desserts. They also sell...","I have heard people hyping up Gong Cha for their bbtea and finally got the chance to try it with some friends and honestly - it's good but I think it's...","Their service is ok, not so good no too bad. But the cup design for milk form tea not make any sense. And taste is soso. Not worse $5.xx for it.\n\n1. The cup...","Gong Cha is one of my favorite bubble tea spots. \n\nThe employees are friendly and usually really quick and efficient with my drinks even when it's busy. \n\nI...","I legit love this place. It used to be called something else when I was in college. I hadn't been to flushing in yeeeeeaaarrrrrrsssss and when I told my...","I loveeee me some dim sum and I just adore this place.  It has a nice relaxing vibe to it, and the ambiance just makes one feel very chilled, and calm.  A...","I had some of the best food at 39 Kings Cafe 利苑食坊!\nI promise you!\n\nI tried their curry beef soup, Korean style ribs and dim sum steamed dumplings. \nMan I...","Saw this place on bus and look at what fellow yelpers said. Went in today and saw variety of buns and pastries and some people were eating savory food. I...","I really like Sweets Bakery. It's probably one of my favorite Chinese bakeries in the Flushing area. It's located in a small strip mall at the intersection...","Disgusting service. Sometimes they pretend they don't speak English lol. They charge 50cents for a cup of tap water. You can find better service at other...","First time here, I got the Taro Milk tea. I first noticed the tea was a bit more expensive. Like other areas charge around four dollars something for a...","Five stars for the strawberry matcha iced drink! Also Gong Cha never lets me down with their quality.  The service was also good and in step here at this...","Close to home and accepts credit cards! They also have loyalty card stamps. After 5 you get 50% off and after 10 it's free. \n\nThe workers are always nice...","Great place that is well lit and quiet. Ordered the fresh avocado smoothie and it was delicious and refreshing. We also had the mango coconut smoothie which...","Awesome concept. Play mahjong while eating some desserts. They could use another mahjong set and table so more then one table would play.\n\nThe crepe cakes...","Purple Yam crepe cake!  A generous large slice of purple sweetness.  It looked quite pretty, but lacked a strong flavor of ube.  Tasted more like regular...","I came different times for dinner, overall the food are authentic and delicious.  I like their grandma braised pork belly, carp and tofu casserole, eggplant...","Went in here on a Thursday evening, wanting to try this place out.  The free order of soup dumplings and pumpkin cake is what attracted my family here.  Our...","It's pretty good value similar to that much larger restaurant in bayside which serves similar cuisine, similar pricing but yet with nicer decor.\n\nOver $20...","I have actually always had a great experience at this place. They make a very good homg Kong and Taiwanese style sweet bun. \n\nI also just got a cake here...","Work nearby so I was eyeing this bakery and finally went in....not what I was expecting. Everything is lil pricey and not a lot of options.","Their quality has improved a lot.  So does the price, of course.:))).  \" Come with the territory....\"  you can also find their bakery at Super Fei Long...","Consistently one of our go-to restaurants! We like coming here for the soup dumplings because you don't have to deal with the craziness of Flushing or...","Not bad. Not the best, but not the worst. \n\nIf you're looking for soup dumplings and your basic Asian dishes, without having to sit in traffic and make your...","I've been house hunting in the area and, during a break, decided to stop by here with my wife and agent. I didn't expect much cause it seemed like a regular...","Just ordered the 3 spicy roll combo. Been trying to figure out the best sushi spot in the area and they all have their perks and haven't had a bad...","Worse sushi place I have even ordered. The sushi has no taste. Things does taste fresh. There is lettuce in rolls. Not very fresh lettuce too. Also chuck...","The green apple green tea is pretty good. It too sweet at 1st but the aftertaste is bitter. I wuda gotten no sugar had I known it'd be so sweet. \n\nI'm not a...","More like 3.5 stars. For a kosher salad bar it's pretty decent with a large selection of ingredients. However, it's pricy. A Santorini salad without any...","Their food is an insult to anyone with taste buds. \nSoggy salad, dressing that tastes like battery acid. Also 10 bucks for a salad with 3 veggie toppings?...","We tried. We are an office and gave them a decent amount of business but their staff is rude and the orders are usually wrong. This time when I called about...","3 years later, still enjoying the hookah here! It's probably the best spot on Steinway for quality hookah. My favorite flavors to smoke here are Aphrodite +...","I have to say at first I was a tad bit annoyed we walked in at about 11:00pm on Saturday night with my husband . No one had taken our order nor even...","Nice flavors of hookahs and hospitality, I would definitely going recommend once to visit. Music was good also we were lucky to witness Brazilian belle...","It's okay. I've ordered for pick-up and delivery so I can't comment on eat-in. Prices are very good. Sushi tastes bland for the most part but what can you...","Mainland haoles really known how to ruin poke. \nThe spam musubi here is good but they fall apart too easily. \nThe Haupia pudding here doesn't have any...","This is a great place to eat Hawaiian food in East Harlem. I had their garlic shrimp which reminded me of the ones I had in Oahu north shore. Excellent in...","I went here for one reason only:  bubble tea.  They make their bubble tea slushy, but it still came out tasty and for a decent price.  The person working...","This is an all you can eat sushi and seafood buffet. I found the pricing to be very convenient. The tax and tip are included, as are soft drinks and bubble...","A place with American, Japanese, Chinese food\n\nThey also have few chefs make the food in front of u. \n\nLove their bubble tea and desert.\n\nNot all the places...","Service makes the establishment. It makes or breaks your dinner or lunch experience at a place. \n\nI've been here countless of times and not once have I had...","I recently came back here a few times after at least a 10 year hiatus. I use to go here all the time when I lived closer. Since then I've moved, along with...","Delivery was quick, but the curry puffs were really greasy, chicken in pad Kee mao was rubbery, and the sauce for the noodles was ALL chili oil. Yes, I...","Food was subpar and didn't taste that great. Both the green curry and salad dressing (lunch specials) were WAY too sweet. The curry was also super watery...","I have been to Teinei Ya many times and loved their food.  This is a review of the sushi bar that is inside Teineiya.  It is still a well kept secret as...","I'll admit it, I'm one big weabo.\nI love everything that's Japanese.\nThe sushi chef here is 100% Japanese and the sushi he prepared was deliciousssssss!...","This is a real sushi place, I highly recommend communicating with the sushi chef about the omakase. Had it with a couple of friends and really enjoyed it....","They have a good selection of pho, noodles and Chinese dishes.  Drinks beyond the typical tea is available. Vietnamese coffee a must type!   Boba drinks...","I've tried so hard to like this place because I really love the food but their service is unbelievably poor. \n\nThis first time I ordered the woman got the...","Not recommended. Literally a lipstick mark on one of the tea cup, incorrect number of plates and utensils, food came super slow, we had worst Thai ice tea...","Delicious breakfast bagel sandwiches. The store is clean and prices a bit above average but aligns with the economy in the area.","Simple and easy. I got a bagel with cream cheese for about $2.25. It was a bagel, and it had cream cheese. Hard to mess that up! I saw lots of options for...","Honestly, this place does not even deserve one star. The first time I visited the deli, I was met by a very unfriendly woman who did not seem very...","You see the reviews and you know the vibes. This sandwich is no joke and I eat a lot - I saved it for breakfast/lunch the next day before heading into...","A friendly staff greeted me and helped me navigate the menu. According to him, there are only three specials sandwiches: American, Italian, and the bomb. I...","Listen. I live, on a good driving day, at least 25 miles away from Sal, Kris, & Charlie's. Still, I haul ass out to Astoria several times a year for one...","The best Mexican food hands down! Absolutely love it, they are fast, friendly, and the quality is on point! This place is a little hidden gem.","Ya know.... I really enjoy the food here but their customer service is a 0.  I smile... Say thank you etc only to be met with a blank stare. Really?  Am I...","Chinese tacos are not really my thing.\n\nMaybe it's my imagination, but I taste peanut oil on everything.","Always great when eating in. I've tired delivery and it was not good.\n\nThe burger is always great. Recently tried to chicken burger it was amazing. Some...","I come here a lot as they have great service and bottomless brunch but their kitchen is not smart. \n\nI asked for a croquette- madame with challah bread and...","Came here for brunch the other day. I got the loaded breakfast skillet, which was actually quite delicious. Imagine some home fries, in a type of chili,...","Hands down THE best sushi in Astoria and honestly one of the best that I've had thus far. I have been coming here for yearsssss and always look forward to...","Pretty sure this is the only sushi place in my neighborhood as I can't remember getting from anywhere else In the past 7 years. \n\nLunch special Is priced...","Came with family, party of 9. They missed one of the salads so we spent 5minutes arguing with the waitress on how many soups/salads should have been served....","Came in to get a yogurt.  The place was a bit dated but clean.  The man who gave me my yogurt was nice but said I could not use my credit card.  $10 minimum...","Went in for the first time today for a smoothie after getting my nails done next door. (I got the berry smoothie with yogurt) Delicious, reasonably priced...","do not order taro bubble tea from here very disgusting the bubbles in the tea is very hard not soft like its been sitting out all day and the taro flavor is...","Who said mall Chinese couldn't be the best!  I was just coming to get my nails done, but I noticed I was a bit too hungry to wait get my pizza from the Ave...","You get a large amount of food for $6.99. The bubble tea was really good. I chose mango there was 2 sizes. $4.99 and $6.99. I picked the large. In a nice...","I will never EVER eat at this location again. I rarely frequent Green Acres mall but I visited yesterday and was hungry so I decided to try the food court....","Really nice place! Pretty relaxing and great lighting. Also the fact that it's venom.","Amazing service best service I've ever had at any hookah lounge I'm definitely coming back here to try many more flavors","This is a extremely well hookah lounge. The staff is very cool and understanding! Hookah is packed nicely and lasts longer than needed. I highly recommend...","My favorite place to get my crepe fixing from. I think it's relatively cheap for the portion you get. \n\nMy go to is the strawberry banana Nutella crepe....","I've been coming here with friends for years since high school. The place is a bit pricy and the 'special combos' aren't discounted at all but the crepes...","I used to live in France so I really really wanted to love this place especially because I miss crepes so much and I live close by so I would love to eat...","This is my go to delivery or pick up spot in the hood now. The food has that legit HK flavor and style. We always get the beef pan fried noodle and the salt...","This place is a hidden gem. They don't skimp on the tea and they don't put too much ice in it. And they're good with the bobba portions too. Other bubble...","Only went there once for a mango milk bubble tea. But it was very good. Loved the designs on the cup as well. I saved and and still use it. I havent tried...","Decided to order food from here based on reviews found on Grubhub and Doordash. Don't know why they don't get much love on here but I'm here to give...","Absolutely love this place. I order from here (through seamless) all the time. Food is exceptionally good and reasonably priced. Loads of food options to...","Love our local poke spot, my husband and I (and our kids) love this place.  No, we've never dined here, usually take out or delivery is our preference, but...","This is a really cute cafe across the street from SJU that sells bubble tea, açai bowls, poke bowls and smoothies.  The interior is really aesthetically...","Zero stars if I could. Ordered delivery and my poke bowl came with no fish at all. Is this a sick joke?!","The lamb chops and rice is amazing \nChicken tacos are A1 they have a little kick but still are good \n\nI'd like to thank my boy sam for recommending...","Let me begin by saying, I had three horrible experiences with this place. I gave it the benefit of the doubt but after my last visit... forget it about it....","Came in here around 9pm on a Tuesday night in July. Place is nicely decorated, clean and spacious. The music kept switching from American/Latino to...","Had the Peking pork chops, beef eggplant and Young chow fried rice tonight. The eggplant beef was wonderful. Thank you for separating the sauce and chops-...","With a name like Tasty & Co I'm ready for some lip smacking and finger licking good food! Right by the Subway for Rego Park and with a nice selection of...","Take out food is so delicious! But I had massive headache right after I ate a meal. I think it's too much MGS. Also their Chinese bun is not tasty and so...","Red mango is the perfect place to visit for a guilt free (well less at least) treat! They recently came out with a graham cracker flavor and it is amazing!!...","I am usually happy with them Sometimes the yogurt is watery but so convenient Sometimes I walk to it So refreshing. Could be a little creamier though","This was my third time coming to the store because of the convenient location. Yet, it's also the third time, leaving empty handed. Assuming anyone works in...","I personally find this cafe so much better than Coco Fresh on Horace Harding Expy for many reasons. Even though some of the prices have went up, they are...","BEST EGG WAFFLE EVER. We got the black sesame egg waffle - when we first broke a piece off, it was really crispy, warm, and fluffy inside - best comfort...","4-4.5 stars, I stopped in after grocery shopping next door, figured I'd grab dinner so I didn't have to cook. Hee hee. Don't judge.  It took a bit of time...","Simon, the owner of this place for decades and the hardest working man on 73rd Avenue, always there often with his wife, are heroes to neighborhood kids and...","No AC. \n\nCandy, ice cream, and dessert. \n\nOnly one person behind the counter. Can get busy with lotto players. You may have to wait. \n\n\nThey have mochi....","They have a variety of sweets, ice creams, and beverages. The owner and his family are always welcoming and are such hard workers. I always go in for a hong...","I frequent this place ever since they opened up months ago! I mean, a bubble tea place opening up near Queens College? What more could a student like me...","Why don't you guys play music? There's always a guy standing next to the trash can staring at the customer - -","Came back again after a short while to just order a tea, and it was great. The owner was there and he was so nice and polite. I came back the next day to...","For weeks on end I've been dying to step foot inside Iris Tea & Bakery; there's a peculiarity about placing a typical Chinese bakery outside the frenetic...","Went to Iris today after passing this place by so many times.\n\nHeads up this area is not easy to park in. Luckily there was a spot open when I came in. I...","I ordered milk tea it was awesome bad. is the first and only milk tea I dislike. It was lukewarm and I\nfeel now very uncomfortable on my stomach like after...","I've been visiting this Koryodang since they've opened, and I think this is one of the places where I would give an A for effort.\n\nThe bakery is tiny and...","Nice comfy small bakery/cafe. There are breakfast specials but I know I shouldn't have any. So I asked for a sandwich to be modified into a more calorie...","The owner kept accusing my friends of juuling and kept interrupting us in the middle of our conversation to stop doing something we weren't even doing. The...","If you're like me and you need to drink like 3 coffees everyday so you don't become a grumpy monster then this place is for you! \n\nTheir monster sized iced...","This is my 3rd time coming to this location for shaved ice and the employees there tell me their machine for shaved ice is closed. The store closes at...","Not to be confused with the Cookie Monster (which is blue) and the Cocky Monster (which is arrogant), or for that matter, the C**k Monster, which I won't go...","I absolutely love this place. I always stop by whenever I'm near the area or working close by on Saturdays. It's so cozy inside & their drinks, especially...","Drinks: Coffee is good and they have a variety of generic and Korean drinks available.\nFood: They run out of most baked goods and even the ice cream (green...","Solid cafe to get work done! I know this spot has been around and for some reason it was my first time coming to study. I ordered the iced cafe latte and...","Love their fried crab with rice noodle.    It's a love of eggs in their and the rice cake soak with the flavor from crabs and the gravy.  The vegetable bun...","Food is not good at all. Steamed dumpling is too salty. Complained to the staff. The staff just ignored us. So rude!!","This is a little local joint that recently opened in the area. It's refreshing to see a Taiwanese/Shanghainese establishment in the area, as opposed to the...","Stopped by after having lunch a few stores down. Located in the same strip mall as yi fang, flushing ice cream factory, etc. They have seating upstairs as...","If you are driving then you should park in the JMart parking garage which is next to nature republic. I do not like other people driving my car so I always...","Nice people working here. The pancakes take a while to make and the system for making these needs some improvement. I saw a bunch of high school kids leave...","Had a wonderful experience there. The staff is very kind. They have caffeinated or decaffeinated bubble tea in many flavors including grapefruit, mango,...","Entre is a small fast food restaurant in Great Neck. It has a limited menu, but what they have is tasty and will most likely satisfy your needs. The service...","Terrible delivery service, over an hour for two wraps and a bubble tea? What is this? When called to inquire about the order person answering sounded like...","If I can give zero stars I would. First of, we went in to get bubble tea and there were two sizes that were listed. We decided to get the small one to try....","A tiny uninviting space, where the staff was only marginally better. I came in at 10 a.m. on a Saturday... the few seats the place has or occupied with...","Horrible service. I wanted to try their bagels, there was no one in the front of the store to help me. When I called to the guy in the back who was on his...","Awesome açaí bowl and I love their bang bang chicken sandwich. \nIt's a nice, clean and friendly place. You can also eat outside. \nNext time I want to try...","They now have brown sugar bubba which is also very good. This is going to be my new bubble tea place. They use real milk instead of milk powder.","I used to love this place , I mean I eat here atleast twice a week . I had my breakfast delivered to me one day and it was so gross and I sent an update to...","This place was really fast at making my drink. They did have 4 people working which is probably why. The workers there weren't nice but they weren't mean...","Very bad attitude. I wish I can give 0 stars. I am loyal customer to Gong cha but definitely wont come back to this location anymore. This is not the first...","A lot of great options to choose from. My tea was good with just the right amount of boba. \nBut...Slow service. Had like 5 girls \"working\" but we're really...","For dessert lovers like me \nAbsolutely worth it to go at least once. \nI ordered a milkshake it was thick and delicious. \nThey also have any kind of sweets....","Pros:\n+ Amazing variety of treats\n+ It's like being in Willy Wonka's chocolate factory\n+ Selfie station\n+ Over the top desserts - plenty to share\n+ Bring...","Yes yes yes!! This place was a random find, something i assumed would be underwhelming and bland as most things on the island are, but i was so wrong. \n\nThe...","Best ice cream I ever had.  The waffle and pancakes are fluffy and delicious too!  They actually make the bacon to order which is a plus.  The orange juice...","Quick visit today with my brother and father to get me some peach ice cream - absolutely delicious, refreshing and not overly sweet - this flavor hits the...","If you're looking for a great scoop of ice cream with a side of nostalgia this is the place for you. This isn't trendy, hip or modern, but it's not suppose...","Visit Date: April 10, 2014\n\nCame here on my dinner break. I stopped in a few weeks before this visit and although I could have sworn I wrote a review I...","Disappointing.  This place was a fresh face to chinese food in the 5 towns when they opened several yrs ago. Sadly that has changed over time. I just...","They must nuke the soup can't have it for at least 45minutes and you could taste the plastic container.....boneless ribs deep fried then placed in wok it's...","Visited NY from Cali and was looking for good hookah. Prior to heading to this place, I had checked out about 6 other spots and they were subpar compared to...","There are many hookah spots in NYC and it can be hard picking the best spot especially if you don't have the time to try them out. My friends are always on...","I'm always on a hunt for actual good hookah places so it's a must to explore different hookah spots whenever I go to NYC! I usually go to another hookah...","I'm so happy to have a smoothie shop so close by. The prices are not bad but when you buy a smoothie everyday to replace a meal it ends up adding up. The...","This place is underrated!! Their milk tea is amazing and their smoothies as well. They're cash only but they have a stamp reward card (free drink after...","A regular bubble tea place. I haven't heard of this place before, don't think it's a chain. I ordered an original bubble tea with herbal jelly. Large size...","Great cafe.\n\nI have been looking for a mom and pop shop like this for awhile. Often times, other shops are too gentrified and way overpriced, but this...","This place is a good cafe for Taiwanese, Cantonese, HK-style dishes.\nPrices are good and service is quick. They open very early for breakfast food.\nMy...","Food is pretty decent, bathroom and the whole place isn't clean and they don't take cash. They definitely need to renovate if they wanna keep going. Their...","JoJu is a NY favorite of ours. We went twice in one weekend and ordered the same thing both times. \n\nHIGHLY recommend the bulgogi banh mi with the green...","I have been wanting to come here forever and finally made it out on a Friday night! It was pretty empty but the crowds started coming in an hour prior to...","This is actually pretty good. Portions are good, with really delicious options here. To be very honest, I am not a Super big fan of any food related to...","All of the food here is absolutely delicious! Everything taste fresh and the dishes are so creative. The drinks are also yummy...can't find what they have...","Update: I used to order here very frequently and have been meaning to update my review because of a disappointing experience I had with them recently.\n\nI...","I've always loved going to this boba place and usually get their milk teas. This time, I got the fruit flavored drink (blueberry pomegranate) with popping...","This bakery makes AMAZING custom cakes! I recently had a cake made for my daughter's birthday. She picked it from the selection they had in an album at the...","This place is a small dainty bakery that has a cute interior and cute desserts!! I went two here two times before, once when they opened and again about a...","This place opened up a week ago. This location hasn't been anything in about 5 years and I was excited that a cute little cafe opened up nearby. The store...","Came here on date night a few weeks ago. I really enjoyed my time here I was for some reason under the impression that it was just a ramen spot but I was...","Ordered the tempura set. I think it was like 20 buck. Not bad i guess. But tbh the menu is overall kinda pricey. The food are Pretty good but kinda blend...","We used to come here pretty often. Definitely one of our go-to's when we are around Bayside. Great restaurant all around. However, I've noticed the quality...","Tried it when it first opened ( a couple years ago?) and didn't like it.  Now I was told food has improved. So we gave it a try again.  Ordered takeouts x 3...","This small shop serves plenty of Hong Kong style foods for cheap prices. The food is just alright but it's quick and easy, making it a casual breakfast or...","Order food, eat food, leave in a timely manner so that you can free up some seats for the next diners. \n\nDecent place to get some quick cheap HK style...","I've been living in Bayside for 6 years now, so I was familiar with this grocery store's mediocrity before they got taken over by new management. Oh, what a...","I sometimes shop here for groceries if I am in desperate need of something that they carry, but usually I do not because of how high their prices are in...","I really want to like this place since it's so close my job and it would've have been a great place to pick up healthy snacks. The times I've gotten a box...","I'm confused on why this place has such bad reviews (maybe the owner changed or the business got better) because I personally like this cafe a lot and has...","Recommendation: Sweet Garlic Bread. It comes in a sliced baguette style, it's a salty, sweet goodness! You can also put it in the mini oven for few minutes....","Really wanted to get shaved ice with friends so we came here and ordered 3 different kinds. First of all, we were all surprised with how expensive it was. I...","I'd highly recommend their fish sandwiches from here! They're often displayed on a tray up front and it's usually the first thing you'd see upon walking in...","Really solid tasting Pineapple buns with a flavorful and nicely crumbly streusel on top.\n\nThe dough has a nice texture with a slight buttery flavor too.\n\n\nI...","My all time favorite is the fried fish sandwich. They go like hot cakes for everyone loves them. Big piece of breaded fried fish sits on crunchy romaine...","Love love this place! As a Korean American, the food is amazing and I appreciate how there is korean food in this town. I usually go to manhattan or queens...","Always a fun place to get dinner. Ramen is to die for and there are so many options and so much variety on the menu. Music is always poppin","I went back for lunch with a friend and there's been a huge improvement since my last visit. They must have gotten a new chef because food was well cooked,...","This place is great! Authentic Japanese snacks & sushi is always on point! Spring rolls and potato croquet so yummy!","Authentic grocery store that serves up sushi specials. Choose from the already (freshly) made items in the display or grab a menu and have the chef prepare...","They charge you a fee if you use a credit card. What is this, 1987 Yokohama? Foh. \nSeems like they could care less about service. No, thanks","So if you think your life is now over\nAnd your gf won't let you disrobe her\nAnd you ask what I think\nJust come get a drink\nKung Fu's Lemon Black Tea with...","Delicious bubble tea, which is a tough thing to find on Long Island.  The service here in my experience has always been very quick, attentive, and friendly....","Love Kung Fu Tea in general but this one is located inside Broadway Mall. Small shop in the center after you walk in but definitely quick service and my...","Each dish was tasty, and served with friendly and warm waiters. Special requests such as not too spicy for my toddler, but spicy for my husband, were...","Thai Table was so good. The plan was for me meet up with my best friend and enjoy a great meal together. I don't normally dine in RVC but a great Groupon...","Came last night for dinner with two other people. We got the chicken and shrimp dumplings, chive pancakes and Thai spring rolls to share. For my main course...","Love their food. They have 2 menus. One has daily dinner special which is perfect portion for me. Check my pictures I posted for the Asian menu. No...","So ironically this place might serve the worlds worst, and i do mean worst, Chinese food, but they have the best chicken nuggets and bubble tea. \n\nNow when...","I think this is one of my favorite places for Asian food takeout. I love that they have daily deals and they have a lot of options under lunch special. I...","In my opinion, this is the best chinese buffet in Queens. My parents love buffets for some reason and I found out they been coming here for years with their...","I just went this place with the family for weekend lunch to celebrate the Mother's Day.\nParking was easy and free cause this place is located at the corner...","So at this place my personal experience has been ok. My family and I has came here a few times before for lunch buffet. Which is $14.99 plus tax it comes to...","My go-to when I'm craving Mexican food! Can't beat their prices, especially for the amount of food you get.\n\nI've started doing keto but found that you can...","There are no Latinos cooking it.  Just Asians. The food lacked flavor.  A box of Goya Mexican Rice would have more flavor than this.  The rice was dry. The...","I'm not basing this review off it being an authentic place, because I knew it wasn't when I ordered. It's takeout food. And it's pretty decent for the price...","Cannot understand why this restaurant has 3 stars reviews. I just had dinner here, super impressed and satisfied, giving 5 stars. Food is very tasty, well...","Ordered pickup over the phone. Didn't realize until after I picked up my order and got home that they got one of my rolls wrong. How does a kani roll end up...","I'd probably give this place more like 3 1/2 stars if I could. I've eaten here quite a few times and never had an issue. I always get the kani salad,...","Amazing, hot pizza and great service!\n\nI would definitely order from here again. The pizza was hot and fresh. And super yummy. \n\nI was hungry and ordered...","My go-to pizza place! It's nearby St. John's, and lots of college students who frequent the place swear on it as the best pizza in the area. There's a bunch...","This is one of the greatest pizza places I have been to! They have so many different slices to try and I always come after my classes since it is close to...","My friend wanted to celebrate her birthday dinner close-by to our houses so we found this place on Yelp and it had pretty good ratings so we decided to...","Food: 4/5\nThis is one of my favorite spots for hot pot. They have this healthy low fat broth which I'm a huge fan of. I'm not a big fan of herbal broths or...","Today Sept 22nd, on a Sunday. They code at 10 am instead of 11 am. Call in advanced!! this is the 2nd time, they close earlier than expected!","Always a great meal from Happy Garden. Only chinese place I'll eat. Love the general tsau, fried dumplings and boneless ribs. Plays does a ton of take out...","After ordering from here a few times, I don't think I would recommend this place. The food is a little too greasy, and the quality has gone downhill. Their...","I'll give it 2 because I honestly feel bad... was there 2 weeks ago, it was terrible.. lo mien was tasteless, the won ton soup was also was also tasteless.....","You've got to understand that this is primarily a bakery/cafe but it serves food on the side. I don't expect bakery food to be on the same level as HK...","$7.95 for half quart size rice roll. What a rip off.  Will not go there again.  They use those smaller than quart size but bigger than half quart container....","This place has good food\n\n\nBut totally rapes you on the prices of cold drinks. Price listed on wall is not correct.","Service was good, food was great!\n\nIt's a casual place, but staff brought the food to us where we were seated as the food became available.  But maybe they...","Small menu, but everything is really good! I've tried a couple of their sandwiches and usually get a side of fries. Great place to come for a meal. Mostly...","They literally have the best THAI ICED TEA ever. It's not too milky or too sweet and it's very refreshing The price is very reasonable - only $4 for a...","Eternal deli is my daily lunch spot it has great fresh food daily and the owner is a nice man too which helps! They have pizza , sandwiches and a variety of...","Good food.  Delicious simple chicken salad with chicken, mayo, avocado on bread.  Beautiful plate arrangement for breakfast but homefries need to be fully...","Stopped in here on a Sunday afternoon after running some errands. I hadn't been in this place in at least a decade. I know the management is different and I...","This store has always been around for me growing up- its fishy smell and perplexing Christmas decorations are just part of the experience. \n\nAs a little...","Amazing steamed pork buns in the food court.  If you're looking for a value lunch that is always hot fresh and ready, I suggest  checking them out.\n\nThe...","My very first review because I just feel that strongly to say something. I took a bite of a curry beef pie, the outside was stale, so I wanted to see how...","I've tried a few poke places, and this might just have to be my FAVE! Came here during my lunch break and I definitely don't regret the walk. This place is...","Long Island has Poke fever! I see new restaurants popping up everywhere, the latest is Chen's Poke Bowl.\n\nIt's always exciting to have a new lunch choice...","I drove by here a few times and it was one of those \"I need to try it\" kind of places. I finally did today and they did not disappoint. \nI got a large poke...","Have ordered delivery from here a few times. It is decent Chinese food but I have had better.  Delivery has always been fast and correct.   I have had the...","Changing your lifestyle to Vegan can be difficult when ordering Take Out. You have to be creative with your taste buds and you've got to be careful about...","This was the third time here.  Very disappointed, maybe because it was a Monday night. I placed a nice order $40. Of which my soup and noodles were missing,...","LEGIT HK BUBBLE TEA AND FOOD!!!!\n\nOh man the beef ho fun here is so freaking good!!!!!!! If it wasn't so far  I would come here!!!!!!!!","Old school prices, no frills, cash only, and no take out menu but that doesn't necessarily make it a bad place. \n\nIt's more than just a bakery and tea spot....","Came here at 1130 and asked for breakfast in english.  Said breakfast was over.  People came in asking for breakfast in Cantonese and they took their order....","This place is a jail cell. They don't allow you to wear hats and charge you for everything like it's a club. Food and hookah is disgusting I got sick both...","I love this place! The owner Riz is mad cool! I love love love halal food and sometimes iffy trying new places but I was excited to try it here and have me...","Great food, great hookah, great people, great music. What more can you want? This place has great air filtration so you'll never even be able to smoke...","I came by here this evening and had a great experience. The price is right and they have plenty of options. They have decent seating here. It has a...","Definitely NOT my favorite pho experience! \n\nFront of the house looks favorable and clean but, the (outside) back... it smells very bad back there. Worse...","Review is based on everything BUT pho because we didn't order it tonight. The weather is just too hot and humid to eat it. Next time!\n\nWe decided to try...","I tried their walnut pastries which is what the shop is named after. It was interesting but I would say the winner here is their bingsu.\n\nMy favorite of...","The girls working there got really bad attitude. I witnessed how a customer asked for hot coffee and they called out iced coffee and she told them \"no I...","Nov 2015:Just tried the croissant taiyaki (boongoh bbang). It's your traditional goldfish pastry filled with red bean paste (I got the one with mochi too)...","Went back today and I realized that the parking lot is actually for the grocery store next door.  Oops!  But there is parking on the street right in front....","I agree with Cindy. This place is great! They were willing to accomodate our requests even though they weren't on the menu. I've tried different places and...","Got the lunch special that comes with 2 rolls & soup for $9. \nI ordered the spicy salmon (with extra tobiko and brown rice) & the tuna roll (with brown...","I just moved to the area and I've been here close to 12-14 times in last 4 months. Almost always we do take out and we get the salmon and tuna crunchy...","Always fresh. Good food. Good value Lacking ambience and service can be \"off\" but it's my new go-to for local sushi. \n Update: still my go-to restaurant for...","Best freaking Thai food in NYC. Period.\n\nI first got to know about it from a foodie colleague of mine. Apparently the Chef is an old Thai lady who doesn't...","I've tried to be fair. Been here twice. Once 5 years ago and recently this past Sunday. It was bad both times. I can't remember why the first time, suffice...","You don't want to read this. Seriously. It's that bad. I've lived my life carefully and have always hoped for my dreams to come true, tonight...","Love this place everything so delicious and fresh!!!! I got this bread that had ham cheese and hash brown and no it wasn't a croissant!!! The hub had the...","BS +++\nSo I'm one of those Paleo-Keto guys who enjoys staring at all these gluten filled cakes and yummy pastries.  This small delectable spot is unlike any...","This busy Bayside location always has fresh goods and great selections. Love coming to Paris Baguette Bayside for my dessert and coffee fix.","Terrific Spicy Beef Brisket noodle soup\n\nI don't know about the rest of the menu but the spicy brisket noodle soup is the real thing.  It is...","Spicy Beef Brisket Noodle Soup has soft brisket, slightly greasy spicy soup, soba noodles and 1/2 egg. The Beef Stew Noodle Soup had tough chewy beef, good...","My family and i come here a lot but mostly for the noodles and fried dumpling if we don't want to travel all the way to flushing. Small little place looks...","One of my favorite lounges in queens!!!\nSuper cute and clean, really spacious too. The hookah is great( I recommend the green goblin) , and the food is...","Love the spot . Dope hookah flavors , my favorite seems to be Pista Kulfi . What I like about this lounge is that, they seem to be very consistent with  the...","1st time here and so far I like it, no ALCOHOL but it's cool, nice place to unwind before, during, and after work...it's super clean and ambiance is really nice","I love this place. \nThe people who work there  are so sweet and they prepare your yogurt as if they were doing it for themselves: very generously. \n\nAnd the...","Delicious froyo, and the woman behind the counter was super friendly! Will definitely come here again when in the area, wanting some froyo!!","Best I ever had considering I eat yogurt all the time. I drive from Port Washington just to get this yogurt and not anything else.","Great yogurt and açaí bowls!! One of my favorite places. Workers are very nice:) come here every week","Stopped in today to check out Dulce Delights Bubble Tea.  The place was clean and the owner was very nice.  The frozen yogurts looked great, tons of options...","We were debating upon two places in the area and chose this one because of its 'great' reviews. We asked for samples and both of the new flavors we tried...","Tried out this place today. Been living in Bayside for the last 3 years and always passed by this place and never noticed it because I thought it is another...","Tea Station is definitely a \"hole-in-the-wall\" place, but their Cantonese/HK food is quite good and tasty. \nA big challenge for some of us who don't read...","Delicious hong Kong tea and tea/coffee drinks. French toast is super Hong Kong. I love their beef tomatoes rice, beef brisket rice and curry chicken...","Have the say the food portions are bigger but the taste is not the same I was happier before","Their quality has gone down a lot.\nTheir chef seen to have changed and need help.\nWe were very disappointed by the food quality and taste.\nPoor chef poor food.","Honestly, this's my first time here and also the last time. Horrible Hk style milk tea, WATERY as normal milk tea. DONT TRY IT!!! This charge me $2.75 not...","I live in Queens but work in the area and this place has really impressed me compared to the higher end spot nearby that is more than double the price. They...","Take out can be like Russian Roulette.  Golden Cove came up spades for  us the day we picked up some grub.  Located off Glen Cove Road, it's pretty typical...","This place is a local chinese food restaurant. I have to say it's also one of the best take out I've eaten by far. Their chicken broccoli white sauce. Yum....","As a bubble tea enthusiast, I've had my fair share of great bubble tea. Hu's Teashop however... hmmm where do I start. I had a less than stellar experience...","Possibly the best pho I've ever had. It's a very different place bc I believe the owners are Korean so they have a spin to it. When you come in they give...","love the special plate! it's the best thing on the menu\n\nthe only reason i am giving it 3 stars is because they need more staff. in the evenings there is...","If I could rate this place zero stars, I would. \nThe food itself, is very mediocre- it is NOT authentic pho and other dishes like the pork chops, are very...","I've spent countless hours here--studying, job hunting, soul searching (I might have exaggerated on this), you name it--that the coffee shop staffers...","Not a bad cafe to relax and study in but there are better options around the neighborhood. This cafe gives a much more cozy and home-like vibe, which is...","The waiter doesn't really understand English so she made a mistake with our order but she was still very attentive. \n\nThe churros are just okay, it doesn't...","Oh how I love this place! I try to go at least once a week, I'm not a huge fan of bubble tea but this place makes it my fav drink (they know my order -...","Dark, dingy, dirty, and cold.  I will not be back.  Plenty of other coffeeshops around.","This place is a little funny...\n\nThe crowd inside is a strange mix of asian high school students, older korean men recovering from their night of drinking,..."]